[
    {
    "id": "sadhana_001",
    "tibetanTitle": "༄༅། །དཔལ་ནག་པོ་ཆེན་པོ་ཕྱག་གཉིས་པའི་སྐུ་བརྙན་རང་བྱུང་བོད་ཐང་མགོན་པོར་བསྟོད་ཅིང་འཕྲིན་ལས་གསོལ་བའི་ཚིག་ཕྲེང་བཞེད་དོན་ལྷུན་གྱིས་གྲུབ་པའི་དབྱངས་ཞེས་པ་བཞུགས་སོ། །",
    "chineseTitle": "自生吉祥二臂大黑天博唐怙主像之祈讚催業文《希願任運之音》",
    "author": "慧幢喇嘛 漢譯 才旺諾布 造 ",
    "category": "儀軌法行",
    "tags": ["大黑天", "二臂怙主", "希願任運" ],
    "ContentTibetan": "<p class=\"tibetan-text\">༈ ན་མོ་གུ་རུ་མ་ཧཱ་ཀཱ་ལཱ་ཡཱ། ཁམས་གསུམ་ལས་འདས་སྒྲིབ་གསུམ་དྲི་མ་སྤངས། །དུས་གསུམ་སངས་རྒྱས་ཀུན་གྱི་འཕྲིན་ལས་ཆེད། །ས་གསུམ་དབང་བསྒྱུར་དྲག་པོ་མིག་གསུམ་ཚུལ། །འཇིག་རྟེན་གསུམ་མགོན་ནག་པོའི་སྐུར་སྣང་བ། །མ་ཧཱ་དེ་ཝའི་སྲས་པོ་མ་མོའི་རྗེ། །ལྷ་ཡི་ལྷར་གྱུར་བདུད་རྣམས་ཀུན་གྱི་བདུད། །ཚོགས་རྗེ་ཚོགས་བདག་དབང་དང་ལྡན་པ་པོ། །བཅོམ་ལྡན་ནག་པོ་ཆེ་ལ་ཕྱག་འཚལ་ལོ། །རྣམ་བཅུ་དབང་ལྡན་ལས་ལ་ཆེ་དབང་བས། །གདུག་པ་ཅན་ཀུན་དྲག་ཏུ་སྒྲོལ་བར་མཛད། །འཁོར་བ་རྒྱུན་གཅོད་ཐར་བའི་ལམ་སྤེལ་ཕྱིར། །ལེགས་ཉེས་སྟེང་འཛིན་བཀའ་ཡི་བྱ་ར་མཛད། །མི་ཐུང་གེལ་བའི་གཟུངས་འཆང་དཔའ་བརྗིད་སྐུ། །མི་མགོ་སྐམ་པོ་ལྔ་ཡི་དབུ་རྒྱན་ཅིང་། །ག་བུར་ཕྲེང་རྒྱུས་ཁྲག་འཛག་དོ་ཤལ་བྱས། །གདེང་ཅན་དབང་པོས་བརྒྱན་ལ་བདག་ཕྱག་འཚལ། །སྐུ་མདོག་མུན་པའི་གཡུང་དྲུང་མིག་སྨན་གྱི། །ཐིག་ལེས་ལན་བརྒྱར་བྱུགས་ཀྱང་མཚོན་མིན་པའི། །ཆེས་གནག་རབ་སྣུམ་འབར་བའི་འོད་ཟེར་འཁྲུགས། །སྦྲང་རྩིའི་ཁ་དོག་བཅུ་གཉིས་ཉི་མ་ཡི། །གཟི་འཕྲོག་སྤྱན་གསུམ་ནས་འབྲས་རྒྱས་འདྲའི་གཟུགས། །འབྲུ་ཚུགས་གཟིགས་ཤིང་ཉག་རྣོ་མཐོ་བ་ཡི། །ཤངས་ནས་རྡོ་རྗེའི་གླུ་དབྱངས་ཧཱུྃ་སྒྲ་འབྱིན། །དཔལ་ཆེན་དཔའ་བོ་ཆེ་ལ་བདག་ཕྱག་འཚལ། །ཞལ་རས་འགྲམ་དུ་འབར་བའི་ཕྲེང་བ་བཞིན། །དམར་སེར་མེ་སྐར་འཕྲོ་བའི་རྒྱན་མཛེས་ཤིང་། །སྨར་སྨིན་ལག་ཚོམ་གློག་སྟོང་འགྱུ་བས་མཚོན། །རྒོད་མའི་མེ་འདྲ་གྱེན་འདར་ཐོར་ཚུགས་སྐྲ། །རིགས་ཀྱི་ཅོད་པན་མི་འཁྲུགས་རྒྱན་རྫོགས་སྐུ། །བདུད་འདུལ་ཏིང་འཛིན་ཕྱག་རྒྱ་ཅན་གྱིས་བརྒྱན། །ཁྲོ་ཆགས་བཞད་ཉམས་ཚེམས་ཕྲེང་མཆེ་བ་གཙིགས། །མྱུ་གུ་མཛེས་པར་བྱས་ལ་བདག་ཕྱག་འཚལ། །བཾ་རོའི་སྟེང་ནས་འགྲོ་ཕྲོར་ཚོམ་བཞིན་ཞབས། །མཉམ་གནས་སྟག་གི་པགས་པས་ཤམ་ཐབ་དཀྲིས། །རྡོ་རྗེའི་ཡུ་བ་བྱས་པའི་གྲི་གུ་གཡས། །བདུད་རྩིས་གང་བའི་ཐོད་པ་ཕྱག་གཡོན་གྱིས། །ཐུགས་ཀར་སྟེང་འོག་ཚུལ་དུ་འཛིན་བྱས་ཤིང་། །ག་ད་ཟུར་བརྒྱན་རྡོ་རྗེའི་མཚན་པ་ཡི། །ཁ་ཊྭཱཾ་ཀ་ནི་གཡོན་གྱི་གྲུ་མོར་འཆང་། །དཔལ་ལྡན་མགོན་པོ་ཆེ་ལ་བདག་ཕྱག་འཚལ། །ནག་པོ་ཁྱོད་ནི་བཅོམ་ལྡན་སངས་རྒྱས་ཀྱི། །ཐུགས་རྗེས་རྣམ་པར་སྤྲུལ་པ་ཁོ་ན་ལས། །རང་རྒྱུད་དྲེགས་པར་ནམ་ཡང་མ་གྱུར་མོད། །ཐབས་ལ་མཁས་པས་ཚར་གཅོད་ཁྲོ་བོར་སྟོན། །མ་རུང་གདུག་པའི་ཚོགས་རྣམས་འཇོམས་མཛད་པ། །རྣམ་བཞི་འཕྲིན་ལས་རོལ་པ་འབྱམས་ཀླས་ཀྱིས། །དེ་བཞིན་གཤེགས་པའི་འཁོར་བཞི་སྐྱོང་བར་མཛད། །ལེགས་ལྡན་དྲག་པོ་ཆེ་ལ་བདག་ཕྱག་འཚལ། །སངས་རྒྱས་བསྟན་པ་ལྔ་བརྒྱ་མཐའ་མའི་དུས། །མི་སྲུན་གདུལ་དཀའ་འདུལ་ལ་སངས་རྒྱས་ཀྱི། །རྨད་བྱུང་ཕྲིན་ལས་ཐམས་ཅད་ཁྱེད་ཀྱིས་བསྒྲུབ། །དགའ་འཇོམས་ལྷ་མིན་ཀུན་གྱི་རིགས་ཀྱི་ནད། །རྣལ་འབྱོར་རིག་འཛིན་ཀུན་གྱི་སྲོག་ཤིང་ཆེ། །གྲུབ་པ་བརྒྱད་ཅུ་ཀུན་གྱི་མངའ་བདག་དཔལ། །ཐར་པ་མཆོག་ཀྱང་ཡོངས་སྟེར་བཅོམ་ལྡན་འདས། །ནག་པོ་ཆེ་ལ་སྙིང་ནས་བདག་ཕྱག་འཚལ། །དེ་ལྟར་ནག་པོ་ཆེ་ལ་རབ་གུས་པས། །ཕྱག་འཚལ་མཆོད་བསྟོད་གསོལ་བ་བཏབ་པའི་མཐུས། །རིག་པ་འཛིན་བདག་བྱང་ཆུབ་སྙིང་པོའི་བར། །ནག་པོ་ཆེན་པོས་བུ་བཞིན་སྐྱོང་མཛད་ནས། །ངན་སོང་གསུམ་གྱི་གཡང་སར་མི་གཏོང་ཞིང་། །དེར་སྐྱེ་ལས་ཀྱི་རྒྱུ་ཡང་ཁྱོད་ཀྱི་མཐུས། །རྣམ་པ་ཀུན་ཏུ་ཉམས་ཤིང་གཅོད་བྱས་ནས། །དགེ་བའི་ལས་ལ་ཡོངས་སུ་གཞུག་དུ་གསོལ། །སྐྱེ་ཀུན་མཐོ་རིས་ཕུན་ཚོགས་ཡོན་ཏན་བདུན། །ལྷ་མིའི་ལམ་མཆོག་འཕགས་ནོར་ཡོན་ཏན་བདུན། །མ་ཉམས་ཚངས་པའི་གནས་སུ་སྐྱེ་འགྱུར་ཞིང་། །སྐྱེས་མ་ཐག་ཏུ་མཚན་ལྡན་བླ་མར་མཇལ། །སྡོམ་རྒྱུན་གསུམ་ཐོབ་བཅས་པ་མ་ཉམས་ཤིང་། །ཕ་མ་མཁན་སློབ་བླ་མ་ལ་གུས་མཆོད། །ཁྱད་པར་མཚན་ལྡན་རྩ་བའི་བླ་མ་ཉིད། །ཅི་དགྱེས་ལས་ལ་སྤྱོད་པའི་གྲོགས་མཛོད་ཅིག །བསྐྱེད་རིམ་ཕྲ་ཐིག་རྫོགས་རིམ་ཆོས་ཉིད་དོན། །བརྩོན་པ་ལྷོད་མེད་ཉིན་མཚན་ཁ་སྦྱོར་དུ། །བསྒོམ་པར་ནུས་ཤིང་ལུས་ངག་ཡིད་ཀྱི་གེགས། །མཐའ་དག་བླ་མ་ནག་པོ་ཆེ་མཐུས་ཞིང་། །ས་ལམ་ཡོན་ཏན་འབྲི་མེད་ཡར་ཟླ་ལྟར། །འཕེལ་བས་ལས་བཞི་ལྟ་སྟངས་བཅུ་གཉིས་དང་། །གྲུབ་པ་ཆེན་པོ་བརྒྱད་སོགས་ཐུན་མོང་གི །དངོས་གྲུབ་ཀུན་ཀྱང་འབད་མེད་ཉིད་འགྲུབ་མཛོད། །ཁྱད་པར་ཐུན་མོང་མ་ཡིན་ཕྱག་རྒྱ་ཆེ། །མི་འགྱུར་བདེ་ཆེན་གནས་ལུགས་རྡོ་རྗེའི་གནས། །ཟབ་ཞི་སྤྲོས་བྲལ་འོད་གསལ་འདུས་མ་བྱས། །བླ་མ་མགོན་པོ་དབྱེར་མེད་ཐུགས་ཀློང་དུ། །བདག་སོགས་འབྲེལ་བཅས་འགྲོ་ཀུན་ཡོངས་གྲོལ་ནས། །ནམ་མཁའི་མཐའ་ཀླས་འགྲོ་བ་ཅི་ཙམ་པ། །མ་ལུས་འདྲེན་པའི་དཔའ་བོར་ཡོངས་གྲུབ་ནས། །རྒྱལ་བ་རྒྱ་མཚོའི་དགོངས་པ་བསྐངས་བར་ཤོག །སྙིང་ནས་འདོད་དོན་གསོལ་བ་བཏབ་པ་འདི། །སྲས་མཆོག་འཕགས་པས་བསྐོར་བའི་རྫོགས་སངས་རྒྱས། །ཀུན་དང་རྡོ་རྗེ་ནག་པོ་ཆེན་པོ་ཡི། །བདེན་པས་བསླུ་མེད་གེགས་མེད་ཉིད་འགྲུབ་ཤོག །ཅེས་དཔལ་ནག་པོ་ཆེན་པོ་ལ་བསྟོད་པ་དང་གསོལ་བ་འདེབས་པའི་ཚིགས་སུ་བཅད་པ་འདི་ནི་བལ་ཡུལ་དུ་བོད་ཐང་མགོན་པོ་ཞེས་རྡོ་ལས་རང་བྱུང་དུ་གྲུབ་པར་ཡང་བཞེད་ཅིང་། ཁ་ཅིག་གིས་མགོན་པོ་ཀླུ་སྒྲུབ་ཀྱི་ཕྱག་གིས་བསྐྲུན་པར་ཡང་འདོད་ལ། གང་ལྟར་སྔོན་ཡེ་རང་དང་ཉེ་བའི་རི་བོར་ཕུལ་ལ་ཌོ་ཞེས་པའི་རྩེ་མོར་ཡོད་པ་ནམ་མཁའ་ལ་འཕུར་སྟེ་བོད་ཐང་དུ་བབ་པར་བལ་ཡུལ་ཀུན་ཏུ་གྲགས་གྱུར་ཏེ་ལ་མཆོད་གཏོར་དང་ལྷན་ཅིག་སྙན་དར་ཕུལ་བའི་ངོས་སུ་ཤིང་ཁྱི་སྣྲོན་ཟླའི་ཚེས་བཅུར་དཔལ་རིག་པ་འཛིན་པས་བརྗོད་པ་དགེའོ། །དགེའོ། །</p>",
    "ContentChinese": "<p class=\"chinese-text\">南摩 咕嚕 瑪哈嘎拉耶<br>超越三界斷三障垢染，三世諸如來之事業故，<br>駕馭三地凶猛三眼相，示現三世間怙黑色身。<br>瑪哈迭瓦子嗣瑪摩主，天中天尊諸魔眾之王，<br>俱足眾薈之主威德力，薄伽大黑天尊吾頂禮。<br>十相自在圓滿甚威勢，以忿怒相渡脫諸暴惡，<br>斷輪迴流增解脫道故，判辨善惡守護佛教義。<br>豐腴矮人之相威勇身，五乾顱骨嚴飾於頂上，<br>白冰穿線作滲血項鍊，以龍王配飾者吾頂禮。<br>永堅黑澤身色以眼藥，塗抹百回滴亦難勝越，<br>極其黑潤亮澤光映輝，蜂蜜色澤爭十二日光。<br>三目恰似米麥般廣長，鼻樑高挺而鼻根細緻，<br>鼻中噴發吽聲金剛歌，大吉祥大勇士吾頂禮。<br>面容頰腮如熾燃串鬘，紅黃火星噴發妙鬢毛，<br>眉鬍髭鬚如千雷晃耀，髮髻如馬面火豎晃蕩。<br>部主寶冠不動嚴圓身，伏魔禪定手印為莊嚴，<br>怒貪笑顏齒鬘張露牙，苗芽為飾無瑕吾頂禮。<br>於邦屍上行止欲邁姿，等住虎皮繫裹緞裙上，<br>右持銜金剛柄之鉞刀，左手執捧盈滿甘露顱。<br>置於心間上下之姿態，八角鐵棒俱金剛嚴飾，<br>三叉杖於左臂肘靠持，吉祥大怙主尊吾頂禮。<br>黑尊爾為薄伽佛陀之，慈悲所化唯一事業相，<br>自心何時亦雖無憍舉，善以方便懲治現怒身。<br>滅除諸等殘暴魔厲眾，四種事業遊戲並守護，<br>無邊善逝如來四眾眷，俱善大威猛尊吾頂禮。<br>諸佛教法末世五百年，降伏桀驁不馴難化徒，<br>佛陀稀妙事業爾成辦，諸滅喜非天之瘟疫病。<br>諸瑜珈持明之大中柱，諸八十證士之吉祥主，<br>惠賜殊勝解脫薄伽梵，至尊大黑天前衷心禮。<br>如是恭仰大黑天之故，頂禮供讚祈請之威力，<br>持明吾證菩提心要間，大黑天尊如子般救護。<br>不墮惡趣三途險崖淵，縱俱墮彼因亦依汝力，<br>一切惡相衰損並除滅，祈請安住一切善業處。<br>羣生善趣圓滿七功德，人天勝道七聖財功德，<br>無衰四梵住中投生且，生已即能謁見俱德師。<br>獲三傳戒遮戒無衰損，孝順父母敬供上師尊，<br>特別於俱德根本上師，令其歡喜行事作助伴。<br>生次微點圓次法性義，精勤不懈晝夜相繼中，<br>堪修持且身語意諸障，依師大黑天力而息滅。<br>地道德如無衰弦月增，四種事業十二視法與，<br>八大成就等共通悉地，一切皆令無勤而獲證。<br>特別乃為不共大手印，不變大樂實相金剛性，<br>深寂離戲光明無為法，上師怙主無別意界中。<br>吾等結緣眾生悉解脫，虛空盡界眾生若干數，<br>普悉成就諸善導勇士，願滿諸佛海會之密意。<br>祈求於此心中之希願，勝子菩薩圍繞正覺佛，<br>金剛大黑天之諦實力，諸願無欺無障皆成就。<br>此吉祥大黑天祈讚詞頌，乃於木狗年心宿月初十日，向此尊像供奉食子並敬獻哈達時，吉祥持明者(仁珍才旺諾布)口述，尼泊爾地區所稱博唐怙主像由岩石中自然形成,或傳為龍樹菩薩親塑造，總之尼泊爾全民皆傳言，此尊像往昔於耶讓城附近一名頗拉周之山頂上，從空中飛越至博唐地區降落於此，善哉善哉！</p>",
    "status": "published",
    "meta": { "words": "N/A", "pages": "N/A", "readTime": "N/A", "preview": "N/A" },
     "availableLanguages": ["bo", "zh", "en"],
    "createdAt": "2025-06-17T11:30:00Z",
    "updatedAt": "2025-06-17T11:30:00Z"
  }
]