[
    {
    "id": "instructions_001",
    "tibetanTitle": "༄༅། །རྫོགས་རིམ་རྩ་རླུང་ཐིག་ལེའི་མན་ངག་གནས་གསུམ་མཁའ་འགྲོའི་ཐུགས་རྗེ་ཀུན་ལ་ཁྱབ་པའི་འོད་ཟེར་གསང་ཆེན་བཅུད་ཀྱི་ཐིག་ལེ་ཞེས་བྱ་བ་བཞུགས་སོ། །",
    "chineseTitle": "圓滿次第氣脈明點訣竅三處空行普照慈悲之光大密精華之要",
    "author": "噶陀仁珍千寶‧貝瑪旺晴 漢譯 才旺諾布 造",
    "category": "導引文",
    "tags": ["圓滿次第", "導引文"],
    "ContentTibetan": "<p class=\"tibetan-text\">༈ མ་ཧཱ་ཤྲཱི་ཧེ་རུ་ཀ་ན་མ། འཁོར་འདས་ཀུན་ཁྱབ་བདེ་ཆེན་བཙུན་མོའི་མཁར། །སྣ་ཚོགས་སྒྱུ་འཕྲུལ་རོལ་བའི་སྤྲིན་འཕྲོ་བ། །བདེ་བ་ཆེན་པོ་པདྨ་བཛྲ་གྱིས། །ཟག་མེད་བདུད་རྩིའི་གྲུ་ཆར་དབྱིངས་ནས་ཕོབས། །གནས་གསུམ་མཁའ་འགྲོའི་ཐུགས་རྗེ་ཉི་མའི་འོད། །སྲིད་གསུམ་ཁྱབ་པར་སྤྲོས་པའི་ཐབས་ཀྱི་ལམ། །ཤིན་ཏུ་གསང་བ་ཆེན་པོའི་མན་ངག་གིས། །ཟག་མེད་རྡོ་རྗེའི་སྐུ་མཆོག་བརྙེས་རྣམས་མཆོད། །ས་བཅུའི་དབང་ཕྱུག་བདུད་འདུལ་ནུས་ལྡན་གླིང་། །གྲུབ་པའི་ཁྱུ་མཆོག་ཀློང་གསལ་སྙིང་པོའི་ཞབས། །རྣམ་པར་སྣང་མཛད་བདེ་ཆེན་གླིང་པ་སོགས། །མ་རྒྱུད་གདམས་པའི་གཏེར་མཛོད་ཆེ་རྣམས་རྒྱལ། །ཚེ་གཅིག་མཁའ་སྤྱོད་གོ་འཕང་མངོན་གྱུར་པའི། །རྫོགས་རིམ་བཀའ་བབས་ཀུན་བཟང་རིན་ཆེན་དང་། །བདག་བློ་གདམས་པའི་གཏེར་དུ་བསྒྲུབ་མཛད་པའི། །དྲིན་ཅན་བླ་མ་བྱང་ཆུབ་བར་དུ་མཆོད། །ཡང་ཕུར་རྫོགས་རིམ་བདུད་རྩིའི་བཏུང་བ་དང་། །བདེ་མཆོག་དུས་འཁོར་མན་ངག་རོ་བརྒྱའི་ཟས། །གཏེར་ཆེན་རྣམ་གསུམ་ཐུགས་ཀྱིས་རྒྱས་བཏབ་པ། །ཁོ་བོའི་དད་དམ་གསེར་གྱི་སྣོད་དུ་འཁྱིལ། །དཔག་མེད་རྒྱུད་སྡེ་འདོད་འབྱུང་ཆུ་གཏེར་ཆེ། །བླ་མའི་མན་ངག་ཐུར་མས་དཀྲུགས་པ་ལས། །བྱིན་རླབས་ལང་ཚོ་རྫོགས་པའི་འོད་དཀར་ཅན། །མཐོང་ནས་མུན་སེལ་གདམས་ཟབ་འགྱེད་ཀྱིས་ཉོན། །<br>སྔོན་འགྲོ། སྐྱེ་བ་གཏན་གྱི་ལེགས་ཉེས་ནི། །དམ་པའི་ཆོས་ལ་རག་ལས་པས། །ངེས་པར་འབྱུང་བའི་བློས་བསྐུལ་ནས། །མཆོག་གསུམ་སྐྱབས་འགྲོ་ཆོས་ཀྱི་མགོ །བླ་མ་མཚན་ལྡན་འཚོལ་བ་དང་། །རང་ཉིད་སློབ་མ་དམ་ལྡན་དུ། །བསྒྲུབ་ནས་བསམ་སྦྱོར་ཆོས་མཐུན་གྱིས། །ཚུལ་བཞིན་བསྟེན་པ་གནད་དུ་ཆེ། །དེ་ཡང་བློ་ལྡོག་རྣམ་པ་བཞིས། །འཁོར་བའི་རྫུན་རྐུབ་མ་ཕུད་ན། །ཡོན་ཏན་བདུད་དུ་སྡང་ཉེ་བས། །སྤྱོད་པ་ཐེག་པ་དམན་དང་བསྟུན། །གཞན་ཕན་བྱང་ཆུབ་སེམས་མེད་ན། །ལྷ་སྒྲུབ་འདྲེ་རུ་འགྱུར་དོགས་པས། །བདག་གཞན་མཉམ་པར་བརྗེ་བ་སོགས། །གོ་ཡུལ་ཙམ་ཡིན་རྒྱུན་དུ་སྦྱོངས། །སོ་ཐར་དང་ནི་བྱང་ཆུབ་སེམས། །གསང་བ་སྔགས་ཀྱི་སྡོམ་པ་སྟེ། །འདི་དང་བྲལ་ན་དངོས་གྲུབ་ཉིད། །མི་འབྱུང་ངེས་པས་རྟག་ཏུ་སྲུངས། །གསང་སྔགས་ལ་ཞུགས་པ་ནས། །སྒྲུབ་གནས་གྲོགས་དང་ཐབས་བཟང་པོས། །ཕྱི་ནང་རྟེན་འབྲེལ་དུ་འདུ་བྱས་ཏེ། །སྐབས་བབས་ཟབ་ཆོས་ཚུལ་བཞིན་སྒྲུབས། །<br>སྔགས་ཀྱི་ཁྱད་ཆོས། ཐེག་ཆེན་ཡོན་ཏན་རྒྱ་མཚོ་དང་། །ཐེག་པ་ཆུང་ངུ་བ་རྗེས་ཆུ། །མདོ་དང་སྔགས་ཀྱི་ཁྱད་པར་ཡང་། །དཔེ་དེས་གཞལ་ནས་ཤེས་པར་བྱ། །ཐབས་མང་དཀའ་བ་མེད་པ་དང་། །མྱུར་ལམ་འབྲས་བུ་ལམ་དུ་བྱེད། །ཤེས་རབ་ཅན་དང་དད་པ་བརྟན། །གཉིས་ཀ་ཚེ་འདིར་གྲོལ་བྱེད་ཆོས། །གསང་བ་སྔགས་ལ་མ་བརྟེན་པར། །རྫོགས་པའི་སངས་རྒྱས་མི་ཐོབ་པ། །མདོ་རྒྱུད་ཀུན་ནས་གསུང་བས་ཕྱིར། །འདི་ལ་མི་འཇུག་བློ་ལྡན་མིན། །སྔོན་འགྲོ་བློ་སྦྱོང་གཞི་བརྟན་ཚེ། །བསྐྱེད་པའི་རིམ་པ་ལ་བརྟེན་ནས། །སྣོད་བཅུད་མ་དག་སྣང་བའི་ཆ། །སྦྱངས་ཤིང་རྫོགས་པའི་རིམ་པར་འཇུག །<br>རྫོགས་རིམ་ཁྱད་ཆོས། འདི་ལྟར་ཆོས་རྣམས་ཐམས་ཅད་ནི། གདོད་ནས་འཁོར་འདས་དབྱེར་མེད་པར། །བདེན་གཉིས་ཟུང་འཇུག་ཡོངས་གྲུབ་ཞལ། །རྫོགས་རིམ་བདེ་སྟོང་ལྷུན་གྲུབ་ཡིན། །ཆགས་བྲལ་དག་ལ་རང་ལུས་དང་། །ཆགས་ལྡན་རྣམས་ལ་གཞན་ལུས་ཏེ། །ཉོན་མོངས་མ་སྤང་ལམ་ཁྱེར་ཐབས། །གསང་བ་སྔགས་ལས་གཞན་དུ་མེད། །དབང་རབ་སྐད་ཅིག་གཅིག་གི་ཆ། །གཞན་རྣམས་ཟླ་བའམ་ལོ་གསུམ་ནང་། །དབུ་མའི་རྩ་མདུད་ཀུན་གྲོལ་ནས། །ས་བཅུའི་སླེབས་འདི་ཨེ་མ་རྨད། །<br>ལུས་གྲུབ་ཚུལ། རྡོ་རྗེ་ཕུང་པོའི་གྲོང་ཁྱེར་ཉིད། །ཅི་ལྟར་བཞུགས་ཚུལ་ལ་རྨོངས་ན། །ས་ལམ་ཡོན་ཏན་ཐམས་ཅད་ནི། །དམུས་ལོང་ལ་ནི་གཟུགས་སྟོན་འདྲ། །དེ་ཕྱིར་རྒྱུད་ལས་འདི་སྐད་གསུངས། །ཕ་དང་མ་ཡི་རྒྱུ་རྐྱེན་ལས། །མེར་མེར་པོ་དང་ནུར་ནུར་པོ། །ལྟར་ལྟར་པོ་གང་གོར་གོར་པོ། །མཁྲང་འགྱུར་ཉིད་དང་ཉ་ལྟ་བུ། །རུ་སྦལ་བཞིན་དང་སྦལ་བ་བཞིན། །རིམ་བཞིན་ཞག་ནི་བདུན་ཕྲག་རེར། །ལྟེ་བ་ནས་ནི་རིམ་བཞིན་གྲུབ། །ཕལ་ཆེར་ཟླ་དགུ་ངོ་བཅུ་ནས། །ལུས་རྫོགས་མ་ཡི་མངལ་ནས་ཐོན། །རྩ་དང་རླུང་དང་ཐིག་ལེ་གསུམ། །ལུས་དང་ལྷན་ཅིག་ཉིད་དུ་གྲུབ། །དེ་བཞིན་ཡོན་ཏན་ཆ་རྣམས་ཀྱང་། །སྦས་པའི་ཚུལ་གྱིས་ལུས་ལ་གནས། །ནམ་ཞིག་འཆི་བའི་དུས་སུ་ཡང་། །སྣང་མཆེད་ཐོབ་པའི་རིམ་པ་དང་། །བར་དོ་བཞི་ཡི་འཆར་ཚུལ་སོགས། །ཀུན་ཀྱང་རླུང་སེམས་བྱེད་ལས་ཉིད། །<br>ཕྱི་ནང་གི་དག་པ། ཕྱི་ནང་དག་པ་སྦྱར་བའི་ཚུལ། །ཆ་ཤས་ཙམ་ཞིག་འདིར་བརྗོད་ན། །མདོ་དང་རྒྱུད་སྡེ་དུ་མ་ནས། །ཕྱི་རོལ་ཅི་བཞིན་ནང་དེ་བཞིན། །ནང་བཞིན་ཕྱི་རོལ་སྣང་བ་སྟེ། །དག་པ་སྦྱོར་ཚུལ་མང་དུ་གསུངས། །ཁྱད་པར་དཔལ་ལྡན་དུས་འཁོར་ལོར། །འཇིག་རྟེན་ཕྱི་དང་ནང་བཅུད་ལུས། །དཀྱིལ་འཁོར་འཁོར་ལོའི་རང་བཞིན་གཞན། །གཞན་ལས་ཞིབ་པའི་ཚུལ་དུ་བཤད། །སྲིད་པ་ཐོག་མར་གྲུབ་པ་ནི། །ལྟེ་བའི་རྩ་འཁོར་ལས་བྱུང་ཕྱིར། །ལྟེ་བའི་བར་འདབ་རྩ་འཁོར་གང་། །བཅུ་གཉིས་ཁྱིམ་དང་དུས་སྦྱོར་བ། །རྩ་བའི་འཁོར་ལོ་ཉིད་དང་ནི། །ཕྱི་རོལ་རྒྱུ་བའི་རྩ་དྲུག་ཅུ། །ལོ་རྒན་དྲུག་ཅུ་ཐམ་པ་ཉིད། །འབྱུང་བ་ལྔ་ཡིས་ལུས་བསྐྱེད་ཕྱིར། །ཤིང་མེ་ཆུ་ལྕགས་ཕྱོགས་རིམ་ཡང་། །དུས་འཁོར་ཤར་རླུང་ལྷོ་མེ་དང་། །བྱང་ཆུ་ནུབ་ཕྱོགས་ས་ཡི་ཁམས། །དབུས་ཀྱི་ས་ཡང་དུས་འཁོར་ལས། །རི་རབ་ཉིད་དེ་ནམ་མཁའི་ཁམས། །ཀུན་ལ་ཁྱབ་པའི་བདག་ཉིད་ཅན། །ཁམས་དྲུག་ལྡན་པ་རྡོ་རྗེའི་ལུས། །དབུ་མ་དག་པ་ཡེ་ཤེས་ཁམས། །རྩ་ཀུན་ལ་ནི་རྣམ་པར་ཁྱབ། །ཕྱི་རོལ་མཁའ་ཡང་དེ་བཞིན་ཏེ། །ཨ་ཝ་དྷུ་ཏི་དུང་ཅན་མ། །སྒྲ་གཉན་དུས་མེ་མ་ནིང་ཁམས། །རོ་མ་དང་ནི་རྐྱང་མ་གང་། །དཀར་དམར་ཐིག་ལེ་འཛིན་བྱེད་རྩ། །ཉི་མ་ཟླ་བ་ཐབས་ཤེས་རབ། །དེར་བརྟེན་རྩ་བའི་འཁོར་ལོ་དྲུག །འབྱུང་ལྔ་ཡེ་ཤེས་ཁམས་དང་དྲུག །གཙུག་ཏོར་ལ་ནི་རྩ་འདབ་བཞི། །ཐུན་མཚམས་བཞི་ཡི་རྣམ་པར་མཚོན། །དཔྲལ་བར་རྩ་ཡི་འདབ་བཅུ་དྲུག །ཚེས་གྲངས་བཅོ་ལྔ་ཡེ་ཤེས་བཅས། །མགྲིན་པའི་རྩ་འདབ་སུམ་ཅུ་གཉིས། །རྒྱུ་སྐར་ཉི་ཤུ་རྩ་བརྒྱད་དང་། །ཡེ་ཤེས་ཆ་ལས་དབྱུ་གུ་བཞི། །སྙིང་གར་རྩ་འདབ་རྣམ་པ་བརྒྱད། །ཐུན་བརྒྱད་དང་ནི་གཟའ་ཆེད་བརྒྱད། །ལྟེ་བར་རྩ་འདབ་དྲུག་ཅུ་བཞི། །དབྱུ་གུ་དྲུག་ཅུ་སྟོང་པ་བཞི། །དུས་སྦྱོར་ལ་སོགས་གོང་བཞིན་བསྟན། །གསང་བའི་རྩ་འདབ་སོ་གཉིས་པར། །དཀར་དམར་བཅུ་དྲུག་ཕྱོགས་སོ་གཉིས། །ཡན་ལག་ཚིག་ཆེན་འཁོར་ལོ་གང་། །བཅུ་གཉིས་ཟླ་བ་ཉིད་དུ་མཚོན། །ཉིང་ལག་ཚིག་འཁོར་དྲུག་ཅུ་དེ། །ཞག་གཅིག་གི་ནི་དབྱུ་གུ་དང་། །རེ་རེར་འདབ་མ་དྲུག་ལྡན་པ། །སུམ་བརྒྱ་དྲུག་ཅུ་དབྱུ་གུ་དབུགས། །ཕྱི་རོལ་ཅི་བཞིན་ནང་དུའོ། །<br>མཆོག་ཏུ་ཐིག་ལེ་འཁོར་འདས་སྲོག །སྲིད་དང་ཞི་བ་མྱང་འདས་ཀུན། །ཀུན་རྫོབ་དང་ནི་དོན་དམ་གྱི། །བྱང་ཆུབ་སེམས་ཀྱི་འཕྲུལ་ལས་གྲུབ། །དེ་ཡང་ཀུན་རྫོབ་རྒྱུའི་ཐིག་ལེ། །ཆུ་དང་མེ་ཁམས་དཀར་དམར་གྱི། །དྭངས་མ་སྤྱི་ཐིག་ཨེ་ཝྃ་དང་། །ཨ་ཧཾ་ཕྱི་རོལ་ཉི་ཟླ་ཡིན། །ཕྲ་རགས་རླུང་དང་འདུས་པའི་ཁམས། །སྒྲ་གཅན་དུས་མེ་ཐིག་ལེ་ཉིད། །སྣ་ཚོགས་ལ་ནི་ཐིག་ལེ་ཁམས། །སྣ་ཚོགས་རྒྱུ་བ་རྒྱུ་སྐར་ཚོགས། །དཀར་དམར་འཕེལ་འགྲིབ་རོལ་བ་ལས། །དཀར་དམར་ལྷོ་བྱང་ཕྱོགས་བསྒྲོད་པ། །དབྱར་དགུན་སྟོན་དཔྱིད་ཚ་གྲང་སོགས། །རྣམ་པ་དུ་མ་སྟོན་པར་བྱེད། །ཁུ་རྡུལ་རླུང་གསུམ་དབུ་མ་རུ། །ཡོངས་འཇུག་གནས་མཐུན་སྐབས་ཡོད་བཞིན། །ཁམས་དྲུག་དུས་ཚིགས་ཟླ་དྲུག་མཐར། །ཟླ་ཉི་ལ་ནི་སྒྲ་གཅན་འཇུག །མདོར་ན་སྣོད་བཅུད་ཆགས་འཇིག་དུས། །འཕྲེལ་འགྲིབ་བདེ་དང་སྡུག་བསྔལ་བ། །ལེགས་ཉེས་མཐའ་དག་ཐིག་ལེ་ཡི། །བྱེད་ལས་ཉིད་དུ་རྒྱལ་བས་གསུངས། །<br>ཁྱད་པར་དུ་ནི་རླུང་གི་ལས། །མཐའ་དག་སྟོབས་དང་ལྡན་པ་སྟེ། །རྩ་དང་ཐིག་ལེའི་བྱེད་པ་ཡང་། །མ་ལུས་པར་ནི་རླུང་གིས་བྱེད། །དེས་ན་དེ་ཀུན་བདག་པོ་ཡང་། །རླུང་ཉིད་དུ་ནི་རབ་ཏུ་གནས། །གཡས་ན་རྒྱུ་བའི་དཀྱིལ་འཁོར་ལྔ། །དྲག་གཟའ་ལྔ་ཡི་རང་བཞིན་དང་། །གཡོན་ན་རྒྱུ་བའི་དཀྱིལ་འཁོར་ལྔ། །ཞི་གཟའ་ལྔ་ཡི་རང་བཞིན་ཅན། །སྲོག་ཐུར་གཉིས་ནི་ཉི་ཟླ་དང་། །གཟའ་རྣམས་རྒྱུ་བའི་ཁྱིམ་ཚོགས་ཀྱང་། །ལྟེ་བའི་གཡས་གཡོན་རྩ་འདབ་མ། །དྲུག་ཅུ་རྩ་བཞི་པདྨའི་ཚུལ། །འདབ་བཞི་ལྟེ་ལྔ་ཁྱོན་དྲུག་ཅུ། །འདབ་མ་ལྟེ་བ་ལས་འཕོ་ཆུང་། །ལྔ་སྟེ་བསྡོམས་པའི་འཕོ་ཆེན་གཅིག །དེ་ཡི་དུས་སྦྱོར་གཅིག་དེ་ཡང་། །གཡོན་གཉིས་མཉམ་དང་མི་མཉམ་ལས། །སྔར་བཤད་བཞིན་དེ་དེ་ལས་ཁྱིམ། །ཞག་དང་ཟླ་བ་ལོ་ལ་སོགས། །ཕྱི་རོལ་དུས་ཀྱི་བྱ་བ་བཞིན། །རླུང་ཁམས་བསྒྲོད་པ་ཉིད་ལས་གྲུབ། །སྲིད་གསུམ་སྐྱེ་འཇིག་འཁོར་འདས་ཆོས། །ཀུན་ཀྱང་རླུང་གི་མཐུ་ལས་སོ། །སྤྱི་བཤད་པ། གདན་བཞི་དུས་འཁོར་དགོས་དོན་བཞིན། །དན་པའི་ཞལ་གདམས་ཟབ་མོ་ནི། །སྐྱེས་བུ་དར་ལ་བབས་པའི་དབུགས། །ཉིན་ཞག་གཅིག་ལ་རྒྱུ་བའི་གྲངས། །ཕྱི་རོལ་རགས་རྩིས་ལོ་གཅིག་གི །ཆུ་ཚོད་ཚད་དུ་འགྱུར་བ་ཡིན། །ཀུན་གྱི་རྩ་བ་ཡེ་ཤེས་རླུང་། །སྣ་ནས་རྒྱུ་བའི་དབུགས་གཅིག་ལ། །དུམ་བུ་སུམ་ཅུ་སོ་གཉིས་དབྱེ། །དེ་ཡི་ཆ་གཅིག་ཡེ་ཤེས་རླུང་། །ཞག་གཅིག་ལ་ནི་ཡེ་ཤེས་རླུང་། །དྲུག་བརྒྱ་བདུན་ཅུ་རྩ་ལྔ་སྟེ། །དེ་ནི་ཞག་གཅིག་དབུགས་ཀྱི་གྲངས། །ཉི་ཁྲི་ཆིག་སྟོང་དྲུག་བརྒྱ་ཉིད། །དུམ་བུ་སུམ་ཅུ་སོ་གཉིས་སུ། །བགོས་པའི་ཐོབ་ནོར་ཉིད་དང་མཚུངས། །འདི་ལ་རྣམ་བཞག་མང་ཡོད་ཀྱང་། །མང་ཐོས་ཉམས་མྱོང་ལྡན་པའི་ཡུལ། །ལས་དང་པོ་ཡི་གནས་སྐབས་སུ། །ལག་ལེན་གནད་དུ་འཁེལ་བ་གཙོ། །<br>དུས་སྦྱོར་ཕྱི་ནང་སྦྱར་བའི་ཚུལ། །རྒྱུད་རྒྱལ་རྡོ་རྗེ་ཕྲེང་བ་དང་། །དགོངས་པ་ལུང་དུ་སྟོན་པ་དང་། །སྡོམ་འབྱུང་ལ་སོགས་རྒྱུད་སྡེ་ནས། །ནང་གི་རྣལ་འབྱོར་མཚོན་པའི་ཕྱིར། །འཕོ་བ་ཞེས་པ་བརྡ་ཡིས། །དེ་ཡང་འཕོ་ཆེན་ཉི་ཤུ་བཞི། །ཉིན་དང་མཚན་མོ་མཉམ་པའི་དུས། །ཉིན་མོ་བཅུ་གཉིས་མཚན་བཅུ་གཉིས། །འཕོ་ཆེན་རེ་ལ་དབུགས་ཀྱི་གྲངས། །བརྒྱ་ཕྲག་དགུ་རེ་རྒྱུ་བ་ཡིན། །དེ་ལ་འཕོ་ཆུང་བཞི་རུ་དབྱེ། །ཉིས་བརྒྱ་ཉི་ཤུ་རྩ་ལྔའི་དབུགས། །འཕོ་ཆེན་རེ་ལ་མགོན་པོ་རེ། །ཉིན་གསུམ་ལན་གསུམ་ཉིད་དུ་འཁོར། །མགོན་པོ་བཞི་ཡི་གཡས་དང་གཡོན། །མཉམ་འགྱུར་རྩུབ་དང་འཇམ་པོའི་སྲོག །རིམ་བཞིན་པདྨ་མགོན་པོ་དང་། །ལས་དང་རིན་ཆེན་རྡོ་རྗེ་མགོན། །འཕོ་ཆུང་ལྷ་མོ་བཞི་ཡི་རླུང་། །སྟེང་ངོས་མཁུར་ཚོས་སྣ་དབུས་མཆུ། །རྒྱུ་རིམ་གོས་དཀར་སྒྲོལ་མ་དང་། །སྤྱན་མ་བདག་མོ་ཉིད་དུ་གསུངས། །འཕོ་ཆེན་ཉེར་བཞི་འཕོ་ཆུང་ནི། །དགུ་བཅུ་དྲུག་ཏུ་དབྱེ་བ་སྟེ། །དེ་ཉིད་ཉིན་ཞག་ཕྲུག་གཅིག་ཚད། །ཉི་ཁྲི་ཆིག་སྟོང་དྲུག་བརྒྱ་སྲོག །དེ་ལྟར་འདུས་སོགས་དགོངས་པ་དང་། །རྣལ་འབྱོར་གསང་མཐའི་མན་ངག་ལས། །ཡུལ་ཆེན་ཉེར་བཞིའི་རྩ་དང་རླུང་། །འཕོ་ཆེན་ཉེར་བཞི་ཉིད་དང་སྦྱོར། །དེ་ཡང་འཕོ་ཆེན་རེ་རེ་ལ། །དབང་དང་ལོངས་སྤྱོད་འཇུག་པ་གསུམ། །ཅིག་ཆར་ཉིད་དུ་འཆར་བ་སྟེ། །དེ་ལྟར་འཕོ་བའི་རྣམ་གྲངས་ནི། །དུ་མ་གསུངས་པ་ཤེས་སླད་དུ། །སྐབས་འདིར་ཅུང་ཟད་འཕྲོས་པ་སྟེ། །དཔལ་ལྡན་དུས་ཀྱི་འཁོར་ལོ་ལས། །ཕྱི་ནང་གཞན་གསུམ་མཉམ་སྦྱོར་ཕྱིར། །དུས་སྦྱོར་བཅུ་གཉིས་ཕྱི་རོལ་དུ། །མཁའ་ལ་བཅུ་གཉིས་ཁྱིམ་འཁོར་ལོ། །ཉིན་ཞག་གཅིག་དང་འཆར་ནུབ་དབང་། །ས་ལ་དུས་ཀྱི་སྦྱོར་བར་འགྱུར། །ཁྱིམ་གྱི་གནས་ལུགས་ངེས་པ་ཡིས། །ཉི་མ་གང་ལ་ངེས་པའི་ཁྱིམ། །དེས་དྲངས་ལག་ན་ཞེས་དུས་སྦྱོར། །བཅུ་གཉིས་ཏཱཏྐཱལ་རིམ་པ་འབྱུང་། །དེ་ཡང་ལུག་འཁྲིགས་སེང་སྲང་གཞུ། །བུམ་པ་མི་མཉམ་དུས་སྦྱོར་དྲུག །སྣ་བུག་གཡོན་ན་རྒྱུ་བའི་རླུང་། །དབུས་སྟེང་སྣ་གཤོག་སྣ་ཡི་འོག །རྒྱུ་བའི་དཀྱིལ་འཁོར་ལྔ་བསྐྱེད་རིམ། །མཁའ་རླུང་མེ་ཆུ་ས་རིམ་པ། །དེ་ལ་འཆར་གཟའ་སྒྲ་གཅན་དང་། །ལྷག་པ་པ་སངས་ཀེ་ཏུ་ཡིན། །གླང་པོ་བུ་མོ་སྡིག་ཆུ་སྲིན། །ཉ་ནི་མཉམ་པའི་དུས་སྦྱོར་ཏེ། །སྣ་བུག་གཡས་ན་རྒྱུ་བའི་རླུང་། །འོག་དང་སྣ་འགྲམ་སྣ་སྟེང་དབུགས། །རྒྱུ་བའི་དཀྱིལ་འཁོར་ལྔ་བསྡུད་རིམ། །ས་ཆུ་མེ་རླུང་ནམ་མཁའ་སྟེ། །དེ་ལ་འཆར་གཟའ་སྤེན་ཕུར་བུ། །མིག་དམར་ཉི་མ་དུས་མེའོ། །གཞན་ཡང་དུས་སྦྱོར་མཚན་ཉིད་ནི། །གཡོ་དང་བརྟན་དང་མཉམ་པ་ནི། །ལུག་དང་ཀཪྚ་སྲང་ཆུ་སྲིན། །གཡོ་བ་བཞི་ཡིན་བརྟན་པ་ནི། །གླང་དང་སེངྒེ་སྡིག་པ་བུམ། །གཉིས་མཉམ་བཞི་ནི་འཁྲིག་བུ་མོ། །གཞུ་དང་ཉ་རུ་ཀུན་ཏུ་གྲགས། །དེ་ལྟར་ཡོངས་སུ་ཤེས་བྱས་ནས། །ཕྱི་རུ་ཉིན་མཚན་མཉམ་པའི་དུས། །དུས་སྦྱོར་ཉིན་དྲུག་མཚན་དྲུག་སྟེ། །དུས་སྦྱོར་དེ་ཡི་ཡུན་ཚད་ནི། །རགས་པ་དབྱུ་གུ་ལྔ་ལྔ་ཡིན། །དུས་སྦྱོར་རེ་ལ་འཕོ་ཆེན་རེ། །མཉམ་སྟེ་དབུགས་སྟོང་བརྒྱད་བརྒྱར་འགྱུར། །དབྱུ་གུ་འཕོ་ཆུང་ཚད་དུ་རྫོགས། །དེས་ན་སུམ་བརྒྱ་དྲུག་ཅུར་ངེས། །ད་དུང་ཅུང་ཟད་གསལ་བཤད་ན། །མཁའ་ལ་ཁྱིམ་གང་འཆར་བའི་དུས། །དེ་སྲིད་དེ་ཡི་དུས་སྦྱོར་ཡིན། །ཁྱིམ་རེ་ལ་ནི་རྐང་བ་དགུ། །སྐར་མ་བཞི་ལ་རྐང་པ་གཅིག །རྐང་རེ་འཆར་ཡུན་དབུགས་ཉིས་བརྒྱ། །དེས་ན་བར་སྐར་གཅིག་རྫོགས་ཡུན། །རགས་རྩིས་དབུགས་ནི་བརྒྱ་ཕྲག་བརྒྱད། །དེ་ལྟར་འཕེལ་འགྲིབ་མེད་འཆར་ཡང་། །ཉིན་མཚན་རིང་ཐུང་བཞེད་པ་མང་། །ཞིབ་ཏུ་བརྩི་ཚུལ་གཞན་ལས་ཤེས། །འོན་ཀྱང་རྒྱུད་ལས་སྲུང་ཚད་སྐབས། །ཉིན་ཚན་རིང་པོའི་མཐུར་རག་དུས། །ཆད་ལྷག་མེད་པར་དུས་སྦྱོར་དྲུག །གསལ་བར་བཞག་ཉིད་ངེས་པར་བྱ། །<br>རྟེན་འབྲེལ། རླུང་གི་འཕོ་བའི་ཆ་བཅུ་གཉིས། །རྟེན་འབྲེལ་ཉིད་དང་འགྲོག་པའི་ཚུལ། །རྟེན་འབྲེལ་རྣམ་པ་བཅུ་གཉིས་ནི། །མ་རིག་འདུ་བྱེད་རྣམ་པར་ཤེས། །མིང་གཟུགས་སྐྱེ་མཆེད་རེག་པ་དང་། །ཚོར་བ་སྲེད་པ་ལེན་པ་དང་། །སྲིད་པ་སྐྱེ་བ་རྒ་ཤིའོ། །འདི་ལྟར་ལུགས་འབྱུང་འཁོར་བའི་ཆོས། །ལུགས་ལས་ལྡོག་པ་མྱང་འདས་སོ། །དེ་ཉིད་ཕྱི་རོལ་ལོ་ཟླ་ཞག །དུས་ཏེ་རྣམ་པ་སྦྱོར་བ་སྟེ། །ལོ་ནི་མ་རིག་བྱི་བ་དང་། །འདུ་བྱེད་གླང་དང་རྣམ་ཤེས་སྟག །མིང་གཟུགས་ཡོས་ལ་སྐྱེ་མཆེད་འབྲུག །སྦྲུལ་རེག་རྟ་ཚོར་ལུག་སྲེད་པ། །སྤྲེའུ་ལེན་པ་བྱ་སྲིད་པ། །སྐྱེ་བ་ཁྱི་ལ་རྒ་ཤི་ཕག །༸ཟླ་བར་རྟེན་འབྲེལ་འཆར་ཚུལ་ནི། །རྒྱལ་ཟླ་མ་རིག་ཆུ་སྲིན་ཁྱིམ། །མཆུ་ཟླ་འདུ་བྱེད་བུམ་པའི་ཁྱིམ། །དེ་ལྟར་ལུགས་འབྱུང་ཚུལ་དུ་སྦྱར། །༸འདིར་ནི་ཞག་ལ་སྤྱོད་པའི་ཚུལ། །ཆུ་སྲིན་ཉ་གླང་དང་སྦལ་བ། །བུ་མོ་ལ་སོགས་མཉམ་ཟླ་དྲུག །མཉམ་ལ་ཡང་ངོ་གཡོན་སྐྱེ་བ། །ལུགས་འབྱུང་སྤྲོ་བ་སྲིད་རྟེན་འབྲེལ། །མར་ངོ་གཡས་པ་འཆི་བ་སྟེ། །ལུགས་ལྡོག་བསྡུད་པ་བཞི་རྟེན་འབྲེལ། །བུམ་ལུག་འཁྲིག་དང་སེངྒེ་དང་། །སྲུང་གཞུ་ལ་སོགས་མི་མཉམ་དྲུག །མཉམ་པ་ཉིད་ལས་གོ་ལྡོག་གོ །དེ་ཡང་མཉམ་པ་དཔེར་བཀོད་ན། །ཡར་ངོ་ལུགས་འབྱུང་མར་ངོ་ལྡོག །རྒྱལ་ཟླའི་ཚེས་གཅིག་མ་རིག་པ། །གཉིས་པ་འདུ་བྱེད་སོགས་རིམ་བཞིན། །བཅུ་གསུམ་བཅུ་བཞི་བཅོ་ལྔ་ལ། །རང་གི་ཚེས་གསུམ་བཞི་ལྔ་ལ། །འཆར་བའི་རྟེན་འབྲེལ་ཅི་བཞིན་བཀོད། །དམར་ཕྱོགས་མ་རིག་རྒ་ཤི་ནས། །ལུགས་ལྡོག་ལྷག་མ་སྔར་བཞིན་བསྐང་། །སྐབས་རེར་ཡར་ངོ་ཞག་ལྷག་སྟེ། །བཅུ་དྲུག་བྱུང་ཚེ་རེག་པ་བསྣན། །ཆད་ནས་བཅུ་བཞིར་སོང་བ་ན། །བཅོ་ལྔ་བཏོན་ཤུལ་རེག་པ་སྦྱོར། །མི་མཉམ་མཆུ་ཟླ་དཔེར་བཀོད་ན། །ཡར་མར་ཚེས་གཅིག་འདུ་བྱེད་དེ། །ཡར་ངོ་ལུགས་ལྡོག་མར་ལུགས་འབྱུང་། །ཡར་ངོའི་ཚེས་གཉིས་མ་རིག་པ། །གསུམ་པ་རྒ་ཤི་རིམ་བཞིན་སྦྱར། །མར་ངོའི་ཚེས་གཉིས་རྣམ་ཤེས་ཏེ། །གསུམ་ལ་མིང་གཟུགས་སོགས་རིམ་བཞིན། །ཆད་ལྷག་དཀར་ཕྱོགས་མ་རིག་པ། །དམར་ཕྱོགས་ལ་ནི་ཚོར་བ་སྦྱོར། །མདོར་ན་ཆད་ལྷག་བསྐང་པའི་ཚུལ། །ཚེས་གྲངས་དྲུག་པའི་རྟེན་འབྲེལ་ཡིན། །༸དུས་ཀྱི་རྟེན་འབྲེལ་དུས་སྦྱོར་ནི། །ཏཱཏྐཱལ་གང་ལ་བབ་པ་ཡི། །དེ་དེའི་དུས་སྦྱོར་འཆར་བ་སྟེ། །ཆུ་སྲིན་མ་རིག་སྦྱར་བས་ཤེས། །ཆོས་རྣམས་རྟེན་ཅིང་འབྲེལ་འབྱུང་ཕྱིར། །ནང་འབྱུང་དང་ནི་ཕྱིའི་འཇིག་རྟེན། །གདོད་ནས་ངོ་བོ་གཅིག་ཉིད་དུ། །རྟོགས་པའི་སྐྱེས་བུ་སྐལ་བ་བཟང་། །མ་རིག་རླུང་སེམས་བྱེད་ལས་ཀྱིས། །འཁྲུལ་ཞིང་ཅི་ལྟར་གྲོལ་བའི་ཚུལ། །རྟེན་འབྲེལ་ཤེས་ལ་རག་ལས་པས། །མདོ་སྔགས་གཅིག་ཏུ་དྲིལ་བར་མཛོད། །རྣལ་འབྱོར་རྩ་ཐིག་རླུང་གསུམ་གྱི། །ཉམས་ལེན་གནད་དུ་བསྣུན་ཤེས་ན། །ལུས་ལྡོག་རྟེན་འབྲེལ་བཅུ་གཉིས་ཀྱིས། །མངོན་འཚང་རྒྱ་ལ་ཐེ་ཚོམ་མེད། །<br>རྩ་ཡི་གཙོ་བོ་རྣམ་པ་གསུམ་བཤད་པ། །དབུ་མ་ལུས་དབུས་ཁང་སྟོང་ཀ་ལྟར་གནས། །གང་དུ་མ་ཡོ་པས་ན་དབུ་མ་དང་། །བདེ་བ་ཀུན་བསྐྱེད་ཀུན་དར་མ་ཡང་ཟེར། །འདི་ནི་ཀུན་རྫོབ་ལྟར་ན་ཕྲ་བའི་རྩ། །རྩ་རྣམས་གྱེས་པའི་མ་མོ་དངོས་ཡིན་ཀྱང་། །དོན་དུ་བསྒོམ་པ་ལས་བྱུང་ཡེ་ཤེས་རྩ། །ཁ་དོག་དབྱིབས་སོགས་རྟེན་འབྲེལ་སྟོབས་ཀྱིས་བཞག །ལྟེ་བ་ལས་སྐྱེས་ཡར་སྣ་གསུམ་དུ་གྱེས། །དབུ་མ་ཚངས་བུག་རྩེ་གཡས་རྣ་དེར་ཟུག །ཡལ་ཀ་ཕྲ་གཉིས་སྣ་བུག་སོ་སོར་གྱེས། །རྩེ་གཡོན་ཕྱོགས་དེའི་ནང་དུ་གནས་པའོ། །མར་སྣ་ཕྲ་བ་གསང་བའི་གནས་སུ་འཕྱངས། །དེ་ལ་མདུད་པ་བཞིའམ་ཉེར་གཅིག་སྟེ། །ལྟེ་བར་ལུས་བསྐྱེད་ཐིག་ལེ་དཀར་ཆ་དང་། །སྙིང་གར་དྲན་པ་འགྱུ་བྱེད་དམར་ཆ་དང་། །མགྲིན་པར་འབྱེད་བྱེད་རླུང་གི་ཐིག་ལེ་དང་། །སྤྱི་བོར་སྣང་བ་འོད་ཀྱི་ཐིག་ལེ་སོགས། །མ་དག་གནས་སྐབས་མདུད་པའི་སྦུབས་སུ་འཐིམ། །དག་ཚེ་སྟོབས་རྒྱས་བློ་གསལ་གཟི་མདངས་འཕེལ། །<br>རོ་མ་སྐྱེས་པ་རྣམས་ལ་གཡས་ནས་འབྱུང་། །བདེ་བ་ཀུན་གྱི་རོ་བཅུད་འཛིན་པ་དང་། །འདོད་ཆགས་ལས་གྱུར་ཐབས་ཀྱི་རང་བཞིན་ཅན། །གཏེམས་པས་ཟས་མཆོག་བཞིན་དུ་རོ་མཆོག་མྱོང་། །རྐྱང་མ་སྙིང་གི་རྩེ་ནས་གཡོན་ཏུ་ཐོན། །གཞན་དང་མི་འབྲེལ་རིང་བུར་གནས་པའི་རྩེ། །མིག་གཡོན་ལ་ཟུག་རྟོག་བྲལ་ཉམས་བསྐྱེད་ཕྱིར། །ཞེ་སྡང་ལས་གྱུར་ཤེས་རབ་ཡེ་ཤེས་མཚོན། །<br>རྩ་གསུམ་རྒྱུད་དུ་ཐབས་གྲོལ་ཁྱད་པར་གྱིས། །འཁོར་ལོ་བདུན་དྲུག་ལྔའམ་བཞིར་གྲགས་ཏེ། །ཉོན་མོངས་དག་དང་ཡེ་ཤེས་འཕེལ་བའི་ཆ། །འཕྲི་སྣན་སྣ་ཚོགས་སྦྱང་གཞི་སྦྱོང་བྱེད་ཚུལ། །ལྟེ་བའི་རྩ་འདབ་དྲུག་ཅུ་རྩ་བཞི་ལས། །ཉོན་མོངས་དང་ནི་ཡེ་ཤེས་འཆར་བའི་རྩ། །རྣམ་པར་གྱེས་པ་སུམ་བརྒྱ་རྩ་བརྒྱད་དེ། །དབྱེ་ན་ཉིས་སྟོང་བཞི་བརྒྱ་སོ་གཉིས་ཡོད། །སྙིང་གར་རྩ་བའི་འདབ་མ་རྣམ་བརྒྱད་ཀྱི། །ཤེས་རབ་འོད་རྩ་དང་ནི་ཉོན་མོངས་རྩ། །རྣམ་པར་གྱེས་པ་སུམ་ཅུ་རྩ་བརྒྱད་དེ། །དབྱེ་ན་རྩ་ཕྲན་སྟོང་དང་དགུ་བརྒྱ་ཡོད། །མགྲིན་པར་རྩ་བའི་འདབ་མ་བཅུ་དྲུག་གི །རིག་པ་ཤེས་རབ་དང་ནི་ཉོན་མོངས་རྩ། །རྣམ་པར་གྱེས་པ་སུམ་བརྒྱ་བཞི་བཅུ་དང་། །དེ་ལས་དཔག་མེད་འཁོར་ལོ་ཀུན་ཏུ་འབྲེལ། །སྤྱི་བོར་རྩ་འདབ་སུམ་ཅུ་རྩ་གཉིས་ཀྱི། །ཡེ་ཤེས་འཆར་བའི་སྒོ་དང་ཉོན་མོངས་རྩ། །རྣམ་པར་གྱེས་པ་སུམ་བརྒྱ་དྲུག་ཅུ་དང་། །དེ་ལས་ཉིས་སྟོང་དགུ་སོགས་གྲངས་མེད་གྱེས། །ཁྱད་པར་གཞན་ལུས་མྱུར་བདེ་ཕོ་ཉའི་ལམ། །བདེ་སྟོང་ཟུང་འཇུག་ཡེ་ཤེས་བསྐྱེད་པའི་གནས། །གསང་བའི་འཁོར་ལོ་རྩ་འདབ་ཉེར་བརྒྱད་ལས། །རྣམ་པར་གྱེས་པ་བདུན་ཅུ་རྩ་གཉིས་ཡོད། །འདི་ལ་རིགས་དང་ཕོ་མོའི་ཁྱད་པར་གྱིས། །ཐབས་ལམ་དབུ་མའི་མར་སྣ་ཕྲ་བའི་རྩ། །ལམ་དུ་བྱེད་པ་བརྒྱུད་པའི་མན་ངག་ལས། །འདོད་ཆེན་ཀུན་གྱིས་རང་དགར་སྤྱོད་ནུས་མིན། །<br>དེ་ནས་རླུང་གི་གནས་ཚུལ་བཤད་པ་ནི། །རྩ་བའི་རླུང་ལྔ་ཡན་ལག་རླུང་ལྔ་དང་། །ཉི་ཁྲི་ཆིག་སྟོང་རྒྱུ་བ་དྲུག་བརྒྱའི་རླུང་། །མང་དུ་གསུངས་ཀྱང་གཙོ་བོར་རླུང་བཅུར་འདུ། །དེ་ཡང་རྩ་བ་ཡན་ལག་གཉིས་ཕྱེས་པའི། །སྲོག་འཛིན་རྣམ་ཤེས་ཆུ་ཁམས་སྙིང་ལ་རྒྱུ། །དཀར་པོ་མི་བསྐྱོད་ངོ་བོ་དབྱིབས་ཟླ་གམ། །སྲོག་གི་རྟེན་བྱེད་ཡིད་ཀྱི་དབང་པོ་ཆགས། །གྱེན་རྒྱུ་འདུ་ཤེས་མེ་ཁམས་མགྲིན་པར་གནས། །དམར་པོ་སྣང་མཐའི་ངོ་བོ་དབྱིབས་གྲུབ་གསུམ། །དབུགས་ཀྱི་རྟེན་བྱེད་སྨྲ་བརྗོད་བྱ་བ་གང་། །ཕྱི་ནང་འབྱུང་བ་གཅིག་ཏུ་འདྲེས་པར་བྱེད། །ཐུར་སེལ་ཚོར་ཕུང་ས་ཁམས་འདོམ་ལ་གནས། །སོར་པོ་རིན་འབྱུང་ངོ་བོ་དབྱིབས་གྲུ་བཞི། །འགྲོ་འདུག་དྲི་ཆུ་དྲི་ཆེན་འདོར་བྱེད་ཅིང་། །ཐིག་ལེ་དཀར་དམར་འབེབ་དང་འདྲེན་པར་བྱེད། །མཉམ་གནས་འདུ་བྱེད་རླུང་ཁམས་ལྟེ་བར་གནས། །ལྗང་སེར་དོན་གྲུབ་ངོ་བོ་གཞུ་ཡི་དབྱིབས། །ལུས་ལ་དྲོད་འབེབས་གྲང་པའི་ནད་ཀུན་སེལ། །ཟས་སྐོམ་བཞུ་ཞིང་གཏུམ་མོ་འདྲེན་པར་བྱེད། །ཁྱབ་བྱེད་གཟུགས་ཕུང་མཁའ་ཁམས་ལུས་ཀུན་ཁྱབ། །སྔོན་པོ་རྣམ་སྣང་ངོ་བོ་དབྱིབས་བཟླུམ་པོ། །དགའ་སྡུག་ཉམས་བརྟས་འཆི་བའི་ཚེ་ན་རྒྱུ། །དེ་ལྟར་རླུང་ལྔར་དབང་བས་སྐུ་ལྔ་ཐོབ། །སྲོག་འཛིན་དབང་པོ་ལྔ་རུ་རྒྱུ་བ་ཡི། །ཡན་ལག་ལྔ་ཡི་རླུང་གི་བཞུགས་ཚུལ་ནི། །རྒྱུ་མ་ཀླུ་སྤྲུལ་འཁྱིལ་འདྲ་གནས་པའི་རླུང་། །གདུག་པའི་ནད་སེལ་མིག་ཤེས་གཟུགས་དང་སྤྲོད། །མཆིན་པ་རུས་སྦལ་དབྱིབས་ལ་གནས་པའི་རླུང་། །ཡན་ལག་བརྐྱངས་བསྐུམ་རྣ་ཤེས་སྒྲ་དང་སྤྲོད། །གློ་བ་རྩང་པ་ལྟ་བུར་གནས་པའི་རླུང་། །གཡལ་འདར་ཆགས་བསྐྱེད་ལྕེ་ཤེས་དྲི་དང་སྤྲོད། །མཁལ་མ་གཞུ་དབྱིབས་ལྟ་བུར་གནས་པའི་རླུང་། །སྲོག་འཛིན་སྦྲིད་པ་ལུས་དང་རེག་བྱ་སྤྲོད། །རླུང་གི་བྱེད་ལས་དང་ནི་འཕོ་བའི་ཆ། །རྒྱུད་དོན་རིན་ཆེན་གཏེར་གྱི་མཛོད་ཆེན་པོ། །དམ་པའི་ཞལ་དང་རྒྱས་འགྲེལ་ལ་ལྟོས་ཕྱིར། །དཔེ་ཐོག་བྲོ་བརྡུང་ཙམ་ལ་མ་རེ་ཞིག །<br>ཐིག་ལེའི་རིམ་པ་རྣམ་པ་མང་མོད་ཀྱང་། །གཙོ་བོ་མཚན་བཅས་རྫས་ཀྱི་ཐིག་ལེ་དང་། །མཚན་མེད་ལྷུན་གྲུབ་འོད་གསལ་ཐིག་ལེ་གཉིས། །གསུང་བའི་དང་པོ་ཐབས་ཀྱི་ལམ་འདི་བསྟན། །ཐབས་ལམ་རྩ་བ་ཐིག་ལེའི་བཞུགས་ཚུལ་ནི། །སྤྱི་བོ་དཀར་ཆ་ཐབས་ཀྱི་ཐིག་ལེ་དང་། །ལྟེ་བར་དམར་ཆ་ཤེས་རབ་ཐིག་ལེ་ཡོད། །རྩ་བ་འོད་གསལ་སྤྲོས་བྲལ་ཐིག་ལེ་དང་། །འཁྲུལ་བ་ཀུན་བཏགས་མ་རིག་ཐིག་ལེ་དང་། །ཁམས་ལྔ་འདུས་པ་རྫས་ཀྱི་ཐིག་ལེ་གསུམ། །གསུང་པའི་ཕྱི་མ་མཚན་བཅས་རྫོགས་པའི་ལམ། །དེ་ཡང་ཐིག་ལེ་གནད་དུ་བསྣུན་པའི་ཚུལ། །ལོ་དང་ཟླ་བ་ཚེས་དང་དུས་ཚོད་བཞིན། །དགའ་བ་བཅུ་དྲུག་སྟོང་ཉིད་བཅུ་དྲུག་དང་། །ལྷ་མོ་བཅུ་དྲུག་འབྲས་བུ་སྐུ་བཅུ་དྲུག །ལོ་ལ་རྒྱུ་ཚུལ། དབྱར་ཉི་བཟློག་ནས་ཟླ་བ་དྲུག་གི་བར། །ཟླ་བ་བྱང་ཆུབ་སེམས་ཉིད་འཕེལ་ཞིང་རྒྱས། །མཚན་མོ་རིང་ཞིང་བསིལ་ངར་རིམ་བཞིན་འཕེལ། །རིག་པ་དྭགས་ཤིང་ཐིག་ལེ་དབང་དུ་འདུ། །དགུན་ཉི་ལྡོག་ནས་ཟླ་བ་དྲུག་གི་བར། །ཉི་མ་གཏུམ་མོའི་དམར་ཆ་འབར་ཞིང་རྒྱུ། །ཉིན་མོ་རིང་ཞིང་ཚ་ངར་རིམ་བཞིན་ལངས། །འདོད་ཆགས་སྡང་ཞིང་གཉིད་ཆེ་དབང་པོ་འཐིབ། །ཟླ་བ་ལ་རྒྱུ་ཚུལ། །ཚེས་གཅིག་མཐེ་བོང་གཡས་ལ་ཨ་ཐུང་ངུ་། །ཚེས་གཉིས་བྱིན་པའི་གནས་སུ་ཨཱ་རིང་པོ། །ཚེས་གསུམ་བརླ་ཡི་གནས་སུ་ཨི་ཐུང་ངུ་། །ཚེས་བཞི་གསང་བའི་གནས་སུ་ཨཱི་རིང་པོ། །ཚེས་ལྔ་ལྟེ་བའི་གནས་སུ་ཨུ་ཐུང་ངུ་། །ཚེས་དྲུག་སྙིང་གི་དབུས་སུ་ཨཱུ་རིང་པོ། །ཚེས་བདུན་ནུ་མའི་ངོས་ལ་རི་ཐུང་ངུ་། །ཚེས་བརྒྱད་ལག་པ་ལ་གནས་རཱི་རིང་པོ། །ཚེས་དགུ་ལྐོག་མ་ལ་གནས་ལི་ཐུང་ངུ་། །ཚེས་བཅུ་མཆུ་སྒྲོས་ལ་གནས་ལཱི་རིང་པོ། །བཅུ་གཅིག་མཁུར་ཚོས་ལ་གནས་ཨེ་ཐུང་ངུ་། །བཅུ་གཉིས་མིག་ཏུ་གནས་པ་ཨཻ་རིང་པོ། །བཅུ་གསུམ་རྣ་བར་གསན་པ་ཨོ་ཐུང་ངུ་། །བཅུ་བཞི་སྤྱི་བོར་གནས་པ་ཨཽ་རིང་པོ། །བཅོ་ལྔ་སྤྱི་བོའི་རོ་མར་ཨཾ་དུ་གནས། །བཅུ་དྲུག་འཕེལ་བའི་ཆ་ཀུན་ཡོངས་རྫོགས་ཏེ། །འགྲིབ་པའི་མགོ་བརྩམས་ཚེག་དྲག་བཅས་པའི་ཨཿ དབུ་མར་ཐིམ་ཞིང་ལུས་ཀུན་ཁྱབ་པར་བྱེད། །ཡར་ངོའི་ཚེས་གཅིག་སྐྱེས་པའི་གཡས་པ་དང་། །བུད་མེད་རྣམས་ཀྱི་མཐེ་བོང་གཡོན་ནས་འཕོ། །མར་ངོའི་ཚེས་ལ་དེ་གཉིས་གོ་བཟློག་ཅིང་། །བཅོ་ལྔར་སྤྱི་བོའི་རྐྱང་མར་བརྟེན་ཅིང་འཕེལ། །དེ་ལྟར་ཀུན་རྫོབ་ཐིག་ལེ་ཤེས་བྱས་ཏེ།།དབབ་བསྐྱེད་འདྲེན་བཀྲམ་གནད་དུ་བསྣུན་པ་ཡིས།།སྟོང་བཞིས་དྲངས་པའི་འོད་གསལ་འཆར་བ་དང་། །བདེ་ཆེན་རྡོ་རྗེའི་སྐུ་མཆོག་ཐོབ་པར་འགྱུར། །<br>དབུ་མའི་མར་སྣར་གཏུམ་མོ་ཞེས་གྲགས་པའི། །མ་ལས་ཐོབ་པའི་དམར་ཆ་ཨཿ ཐུང་གཟུགས། ལས་སུ་རུང་བས་བདེ་ཆེན་ཐིག་ལེ་འདྲེན། །སྤྱི་ལྟར་དབྱེ་ན་གཏུམ་མོ་རྣམ་པ་གསུམ། །སྐུ་ཡི་གཏུམ་མོའི་འཁྲིལ་འཁོར་ལ་བརྟེན་ནས། །མེ་རུ་སྦར་ཞིང་དྲག་ཏུ་འབར་བ་དང་། །གསུང་གི་གཏམ་མོ་ཡིག་འབྲུ་རླུང་གི་དབྱིབས། །ཅི་བཞིན་དམིགས་བདེ་ལྟར་འབར་བ་དང་། །ཐུགས་ཀྱི་གཏུམ་མོ་དམིགས་མེད་སྟོང་པའི་དབྱིངས། །ཤེས་རབ་སྒྲོན་མེ་ཤུགས་ཀྱིས་འབར་བའོ། །ཐུགས་ཀྱི་གཏུམ་མོ་ལའང་རྣམ་གསུམ་སྟེ། །དྲོད་བསྐྱེད་དམ་ཚིག་ཕྱག་རྒྱའི་གཏུམ་མོ་དང་། །བདེ་བསྐྱེད་ཆོས་ཀྱི་ཕྱག་རྒྱའི་གཏུམ་མོ་དང་། །བདེ་སྟོང་དབྱེར་མེད་ཕྱག་རྒྱ་ཆེན་པོ་སོགས། །རྣམ་པ་གསུམ་དང་སྒོམ་ཚུལ་གྱིས་བཞག་པའི། །གཏུམ་མོ་སྣ་ཚོགས་ཆེན་རྣམས་ཀྱིས་བཞེད། །<br>རྣལ་འབྱོར་དྲུག་གསེར་རྡོ་མ་བཞུགས་གསེར་དུ་མི་འགྱུར་ལ། །འོ་མ་མ་དཀྲུགས་མར་མི་འབྱུང་བ་བཞིན། །རྩ་རླུང་ཐིག་ལེ་ལུས་དང་མི་འབྲལ་ཡང་། །འཁྲུལ་འཁོར་མན་ངག་མེད་ན་དོན་མི་འགྲུབ། །མདོ་སྔགས་ཀུན་ནས་བསྔགས་པའི་ལུས་ཀྱི་གནད། །འཁྲུལ་འཁོར་ཀུན་གྱི་རྩ་བ་རྨད་བྱུང་བ། །རྣམ་པར་སྣང་མཛད་ཆོས་བདུན་ཞེས་གྲགས་པ། །སྣ་ཚོགས་སྣང་ཡང་ལམ་གྱི་སྐབས་ཐོབ་བཞིན། །རྐང་པ་རྡོ་རྗེའི་སྐྱིལ་ཀྲུང་བཅས་པ་ཡིས། །ཐུར་སེལ་ས་ཡི་རླུང་རྣམས་དབུ་མར་འདྲེན། །མཐེ་བོང་རྩེ་མོས་སྲིན་ལག་མནན་པ་ཡིས། །མེ་མཉམ་རླུང་གི་རླུང་རྣམས་དབུ་མར་འདྲེན། །སྒལ་ཚིགས་ཡོ་མེད་དྲང་བོར་བསྲང་བ་ཡིས། །སྲོག་འཛིན་ཆུ་ཡི་རླུང་རྣམས་དབུ་མར་འདྲེན། །མགྲིན་པ་ལྕགས་ཀྱུ་ལྟ་བུར་གུག་པ་ཡིས། །གྱེན་རྒྱུ་མེ་ཡི་རླུང་རྣམས་དབུ་མར་འདྲེན། །དཔུང་བ་རྒོད་གཤོག་ལྟ་བུར་བརྐྱངས་བ་ཡིས། །ཁྱབ་བྱེད་མཁའ་ཁམས་རླུང་རྣམས་དབུ་མར་འདྲེན། །མིག་གཉིས་དལ་གྱིས་སྣ་རྩེར་བཞག་པ་ཡིས། །ཕྲ་བ་ཡན་ལག་རླུང་རྣམས་དབུ་མར་འདྲེན། །དམིགས་གནད་ལུས་ཀྱི་དེ་ཉིད་ཤེས་པ་ཡིས། །ཆོས་བདུན་འདིས་ཀྱང་དགོས་པ་མང་འགྲུབ་ཀྱང་། །གཞན་དུ་ཆོས་བརྒྱད་འདུག་ཚུལ་བརྟན་པོ་དང་། །གསང་བའི་མན་ངག་མེད་ལ་དགོས་པ་ཆུང་། །ཕྱི་ལུས་གྲིམ་པོ་ཆུན་དང་ལྡན་པ་དང་། །ནང་སེམས་བག་ལྷོད་ལྟ་གདེངས་ལྡན་པའི་ངང་། །རླུང་སེམས་གཅིག་ཏུ་འདུས་པའི་འཁྲུལ་འཁོར་གྱིས། །ཕྱི་ནང་འབྱུང་བ་ཀུན་ལ་རང་དབང་འགྱུར། །དང་པོ་སྲུང་བ་རྡོ་རྗེའི་རྣལ་འབྱོར་ནི། །རྡོ་རྗེའི་སྐྱིལ་ཀྲུང་བཅས་པའི་ཆོས་བདུན་གྱིས། །ཡི་དམ་གསལ་བའི་དམིགས་པའི་གནད་དང་བཅས། །རླུང་ཁུག་རེ་བཞིན་བཅའ་བཤིག་ལུག་སྤྲུགས་བྱ། །དེ་ཡིས་ཕྱི་ནང་གེགས་རྣམས་སེལ་བ་དང་། །ཉམས་ལེན་ལམ་ལ་བར་ཆད་མེད་པར་བྱེད། །གཉིས་པ་ཉེས་ཚོགས་རང་གྲོལ་རྣལ་འབྱོར་ནི། །ཆོས་བདུན་པའི་ལག་གཉིས་སྡིག་མཛུབ་རྒྱ། །བརླ་ནས་པུས་མོར་ལག་ངོ་ལུས་དང་སྦྱར། །གཡས་ཀྱི་རྩ་བརྒྱུད་རྣ་རྟག་གཡས་ནས་ཐོན། །སྤྱི་བོའི་གཙུག་བརྒྱུད་སྨིན་མའི་མཚམས་སུ་ཕབ། །གུང་མོས་སྣ་བུག་གཡས་མནན་རླུང་རོ་བསལ། །པད་སྐོར་དང་བཅས་འཕེན་སྡུད་ལམ་གསུམ་དང་། །གཡོན་དང་ལག་གཉིས་མཉམ་དུའང་དེ་བཞིན་ནོ། །དེ་ཡིས་རླུང་རོ་རྩ་ལ་རྒྱུ་བ་ཡིས། ཁོག་པའི་ནད་ཞི་ཕྱི་ནས་དྭངས་མ་འདྲེན། ཁམས་དང་དབང་པོ་གསལ་ཞིང་བྱིང་རྒོད་སེལ། །ཏིང་ངེ་འཛིན་ལ་འཇུག་པའི་སྔོན་འགྲོ་བྱེད། །གསུམ་པ་སྐུ་གསུམ་བདུད་རྩིའི་རྣལ་འབྱོར་ནི། །ཆོས་བདུན་ལྡན་པས་འཇམ་རླུང་དལ་གྱིས་བཟུང་། །རླུང་ཁུག་རེ་བཞིན་བཅའ་བཤིག་རེ་རེ་བྱ། །དེ་ཉིད་གྲུབ་པས་ཚེ་རིང་གཞོན་ཉམས་འཛིན། །བཞི་པ་སྟོང་སྦྱང་འཇའ་ལུས་རྣལ་འབྱོར་ནི། །ཆོས་བདུན་ལྡན་པས་རླུང་སེམས་གཅིག་ཏུ་དྲིལ། །ཕྱི་ལུས་ནང་རྩ་གསང་བ་སེམས་ཉིད་དེ། །རེ་རེ་བཞིན་དུ་བཅས་བཤིག་ལུས་སྤྲུག་བྱ། །དེས་ནི་སྣང་བ་རྒྱུ་མར་ཤར་བ་ཡིས། །བཟང་ངན་ཀུན་ལ་རེ་དོགས་ཆོད་པར་བྱེད། །ལྔ་པ་འཆི་མེད་བུམ་ཅན་རྣལ་འབྱོར་ནི། །ཆོས་བདུན་རླུང་སྦྱོར་བཞི་དང་ལྡན་པ་ཡིས། །གཡས་ནས་ཕོ་རླུང་གཡོན་ནས་མོ་རླུང་བཅག །དབུས་ནས་མ་ནིང་རླུང་བཅག་མདའ་ལྟར་འཕེན། །བུམ་ཆུང་འབྲིང་དང་ཆེན་པོ་གོ་རིམ་བཞིན། །སྔ་མ་འབྱོང་ནས་ཕྱི་མ་སྦྱངས་བར་བྱེད། །བུམ་ཆེན་དྲུག་གི་ཚད་ལ་བཅའ་བཤིག་རེ། །སྦྱར་བས་རླུང་བཅུ་རིམ་གྱིས་འདྲེན་པ་དང་། །ཚེ་ཚད་ཤེས་ཤིང་འཆི་མེད་བཅུད་ལེན་འགྲུབ། །འདི་ཉིད་མན་ངག་ལྡན་པ་བསླབ་བྱའི་གནད། །དྲུག་པ་གཏུམ་མོ་བདེ་དྲོད་རྣལ་འབྱོར་ནི། །ཆོས་བདུན་ལྡན་པས་རླུང་རིག་ལྟེ་བར་གཏད། །མཚན་ཉིད་བཞི་ལྡན་གཏུམ་མོ་སྦར་བ་དང་། །རྩ་རྒྱུད་བླ་མ་ཕག་མོར་བསྟིམ་པ་དང་། །ཐམས་ཅད་བདེ་ཆེན་ཐིག་ལེར་བཞུ་བ་གསུམ། །སྦྱང་ཚེ་སོ་སོ་རླུང་ཁུག་རེ་རེ་དང་། །གསུམ་པོ་ཚར་རྗེས་བཅའ་བཤིག་ལུས་སྤྲུག་སོགས། །དགོས་ཀྱང་གོམས་ཚེ་རང་གི་ཉམས་དང་སྦྱར། །དེས་ནི་གྲང་བའི་ནད་ཀུན་སེལ་བ་དང་། །ཤེས་རབ་འཕེལ་ཞིང་མི་རྟོག་བདེ་ཆེན་བསྐྱེད། །དེ་ལྟར་རྩ་རླུང་ཐིག་ལེའི་རྨང་གཞི་མཆོག །རྣལ་འབྱོར་དྲུག་གིས་ལུས་ཀྱི་རྩ་སློང་ཞིང་། །ཉམས་པ་སོར་ཆུད་བཟང་པོ་གོང་དུ་བསྐྱེད། །ཟབ་ལམ་རྫོགས་རིམ་བསྒོམ་པའི་སྣོད་རུང་བྱེད། །<br>གསང་བ་འདུས་པ་གཤིན་རྗེ་གཤེད་སྐོར་སོགས། །ཕ་རྒྱུད་རྣམས་ལས་རླུང་སྦྱར་གཙོ་བོར་འདོན། །རླུང་ལྔ་དག་པས་གསལ་སྟོང་ཡེ་ཤེས་བསྐྱེད། །དེ་ཡི་མན་ངག་བདུད་རྩིའི་རྣལ་འབྱོར་ཉིད། །ཡང་ཕུར་བདེ་མཆོག་དགྱེས་པ་རྡོ་རྗེ་སོགས། །མ་རྒྱུད་རྣམས་ལས་ཐིག་ལེ་གཙོ་བོར་འདོན། །ཞུ་བདེ་སྟོབས་ཀྱིས་དགའ་བའི་ཡེ་ཤེས་བསྐྱེད། །དེ་ཡི་མན་ངག་གཏུམ་མོའི་རྣལ་འབྱོར་ཉིད། །གསང་བ་སྙིང་པོ་དུས་ཀྱི་འཁོར་ལོ་སོགས། །གཉིས་མེད་རྒྱུད་ལས་རྩ་ཐིག་རླུང་གསུམ་དྲིལ། །སྐྱེ་འགག་གནས་བྲལ་ཡེ་ཤེས་མངོན་དུ་བྱེད། །དེ་ཡང་གཏུམ་མོའི་རྣལ་འབྱོར་ཉིད་ལ་ཚང་། །དེ་ཕྱི་བླ་མེད་སྔགས་ཀྱི་རྫོགས་རིམ་ཀུན། །མན་ངག་འདི་ཡི་ལུགས་ལ་འདུ་བའི་ཕྱིར། །ཁམས་གསུམ་ནོར་བུ་དུས་གཅིག་སྤུང་ནའང་། །ཟབ་ཆོས་འདི་ཡི་ཆ་ཙམ་གཞལ་མི་ནུས། །སྐལ་བ་ལྡན་པའི་སྐྱེས་བུའི་ལག་མཐིལ་དུ། །རང་བྱུང་ནོར་སྐལ་ཡིན་པ་ཤེས་པར་གྱིས། །<br>ཡན་ལག་ལྔའི་འཁྲུལ་འཁོར། །དང་པོ་དྲོད་བསྐྱེད་མེ་ཡི་འཁོར་ལོ་ནི། །རྡོར་བསོར་པུས་གཏད་ཆོས་དྲུག་ལྡན་པ་ཡི། །གཡས་གཡོན་གཉིས་སུ་ཕོ་སྐོར་གསུམ་རེ་དང་། །མདུན་རྒྱབ་བཅག་པའི་འབེབས་ཆུང་ལན་གསུམ་བྱ། །དེས་ནི་རྒྱུ་མ་ཕོ་བའི་ནད་སེལ་ཞིང་། །སྦས་པའི་རྩ་རྣམས་མངོན་དུ་འབྱིན་པར་བྱེད། །གཉིས་པ་སྟོབས་ཆེན་རླུང་གི་འཁོར་ལོ་ནི། །རྡོར་བསོར་པུས་སྟེང་བཞག་པས་ཆོས་དྲུག་གིས། །རྐེད་པ་གཡས་སྐོར་ལན་གསུམ་གཡོན་དེ་བཞིན། །གཡས་གཡོན་མདུན་རྒྱབ་བཅག་འབེབས་ཆུང་གསུམ། །དེ་ཡིས་རྩ་འཆུག་འགྲམ་དང་གས་པ་གསོ། །རླུང་ལས་གྱུར་པའི་ནད་རྣམས་ཞི་བར་བྱེད། །གསུམ་པ་རྣམ་གྲོལ་ཆོས་ཀྱི་འཁོར་ལོ་ནི། །ཆོས་བདུན་ལྡན་པའི་དཔུང་མགོ་གྱེན་དུ་བསྟོད། །མགོ་བོ་གཡས་གཡོན་དལ་གྱིས་གསུམ་རེ་སྐོར། །མདུན་རྒྱབ་དགྱེ་འགུག་གསུམ་དང་གཡས་གཡོན་བཅག །འབེབས་ཆུང་གསུམ་བརྒྱབ་ཡང་དག་དོན་ལ་བལྟ། །ལྟག་རྩ་འཆུས་དང་མིག་དང་སྣ་ནད་སེལ། །བཞི་པ་གདུང་སེལ་བདེ་བའི་འཁོར་ལོ་ནི། །རྡོར་བསོར་ཕྱག་རྒྱ་གཡས་མདུན་གཡོན་རྒྱབ་བཅས། །ཆོས་དྲུག་ལྡན་པས་པད་སྐོར་མཆན་རྡེབ་གསུམ། །དེ་བཞིན་ལག་གཡོན་མདུན་དང་གཡས་པ་རྒྱབ། །པད་སྐོར་མཆན་རྡེབ་སྦྲེལ་བ་ལན་གསུམ་དང་། །ལག་གཉིས་རྐེད་པར་བྲོས་འདེད་བཤད་ཆུང་གསུམ། །འབེབས་ཆུང་གསུམ་བརྒྱབ་ལྟ་བའི་ངོར་བསྐྱངས་པས། །སྙིང་ཁྲག་རྒྱུ་བ་ངན་པ་བརྒྱལ་གཟེར་སེལ། །ལྔ་པ་དྲི་མེད་པདྨའི་འཁོར་ལོ་ནི། །ཆོས་བདུན་ལྡན་པས་རླུང་བཟུང་དམིགས་གནད་བཅས། །ལག་གཉིས་ཤད་བརྐྱངས་པད་སྐོར་ཐལ་རྡེབས་འཕུར། །མཛུབ་གུང་བརྐྱངས་པའི་རྡོ་རྗེའི་ཁུ་ཚུར་བྱ། །ལག་གཡས་མདུན་དང་གཡོན་པ་རྒྱབ་བྱས་ཏེ། །ཐོད་པའི་སྐྲ་ལ་བྱུགས་པ་ལན་གསུམ་དང་། །ལག་གཡོན་གོ་ལྡོག་མཉམ་དུ་ངོ་བྱུག་གསུམ། །བཅའ་བཤིག་འབེབས་ཆུང་གསུམ་བརྒྱབ་གནས་ལུགས་བསྐྱངས། །དེས་ནི་མཁྲིས་པ་བད་ཀན་སྲིན་ནད་དང་། །མགོ་དང་བྱང་ཁོག་སྟོད་ཀྱི་ནད་རྣམས་སེལ། །དྲུག་པ་རབ་མྱུར་གློག་གི་འཁོར་ལོ་ནི། །ཕྱེད་སྐྱིལ་བཅས་པའི་ཆོས་དྲུག་བཞུགས་སྟངས་ཀྱིས། །མཆན་རྡེབ་དང་བཅས་ལག་གཉིས་ཤད་ཀྱིས་བརྐྱངས། །དཔུང་བརྡེག་ལག་གཡོན་གཡས་པའི་སོར་རྩེར་བཞག །སོར་རྩེ་བར་བྱུགས་གཡས་པའི་མཆན་དུ་བརྡབས། །གཡས་སུ་ལན་གསུམ་གཡོན་པའང་དེ་བཞིན། །བཅའ་བཤིག་གཅིག་དང་འབེབས་ཆུང་ལན་གསུམ་བྱ། །ལག་པའི་རྩ་དང་ཚིག་གི་ནད་རྣམས་སེལ། །བདུན་པ་རྣལ་འབྱོར་དགའ་བའི་འཁོར་ལོ་ནི། །རྐང་གཡོན་ཕྱེད་སྐྱིལ་གཡས་མཐིལ་ས་ལ་ཕབ། །ལག་གཡས་སྟེང་བཅས་གཡས་པའི་པུས་མོར་འཁྱུད། །འཕགས་ཆུང་དང་བཅས་རྐང་གཡས་མདུན་དུ་བརྐྱངས། །ལག་གཉིས་བྲལ་ནས་པུས་མོའི་བར་བྱུགས་རྗེས། །ལག་གཡོན་རང་ཕྱོགས་པུས་མོའི་སྟེང་དུ་འཇོག །གཡས་པས་རང་ཕྱོགས་དཔྱི་ཐར་ལན་གསུམ་བརྡེག །ལག་གཡས་ཁུ་ཚུར་རང་ཕྱོགས་པུས་སྟེང་བཀོད། །གཡོན་པའི་མཐེབ་གུང་སྦྱར་བའི་ཕྱག་རྒྱ་ཡིས། །གཡས་ཀྱིས་རྐང་པའི་སྲིན་ལག་ནས་འཁྱུད་ཅིང་། །གཡོན་པའི་བརླ་སྟེང་བཀོད་དང་ཆབ་གཅིག་ཏུ། །ཁོད་སྟོད་གཡས་སུ་གཅུས་ཏེ་རླུང་རོ་དོར། །སླར་ཡང་གཡོན་དུ་དེ་བཞིན་ལན་གཅིག་སྦྱངས། །འབེབས་ཆུང་གསུམ་བརྒྱབ་གཉུག་མའི་རང་ངོ་བསྐྱངས། །དེས་ནི་བསྟོད་སྨད་ཀུན་གྱི་ནད་སྤྱི་དང་། །འཁྲུལ་འཁོར་སྐབས་ཀྱི་གེགས་རྣམས་སེལ་བར་བྱེད། །བརྒྱད་པ་སྣང་བྱེད་འོད་གསལ་འཁོར་ལོ་ནི། །རྡོར་བསོར་པུས་སྟེང་བཞག་པའི་ཆོས་དྲུག་གིས། །འཕགས་ཆུང་དང་བཅས་ཕྲལ་དུ་གྱེན་ལ་ལངས། །ཁུ་ཚུར་མདུན་རྒྱབ་སྐོར་བ་གསུམ་རེ་དང་། །པད་སྐོར་ཐལ་རྡེབས་མཐིལ་འཕུར་ལན་གསུམ་བྱ། །སྐྲ་བྱུགས་ངོ་འཕུར་ཁུ་ཚུར་ཕྲག་བརྡེག་བཅས། །གསུམ་རེ་བཅའ་བཤིག་ལངས་འབེབས་ཆེ་གསུམ་དང་། །བར་འབེབས་འབེབས་ཆུང་གསུམ་རེ་ཧ་སྤྲུག་གསུམ། །དེ་ལྟར་ཡན་ལག་ལྔ་ཡིས་འཁྲུལ་འཁོར་བརྒྱད། །ཉམས་སུ་བླང་པས་ལུས་ཀྱི་ནད་གཞི་ཞིང་། །ལུས་ལ་དྲོད་འབར་སེམས་ལ་བདེ་བ་རྒྱས། །རྣམ་པར་མི་རྟོག་ཡེ་ཤེས་རྒྱུད་ལ་སྐྱེ། །<br>དངོས་གཞིའི་འཁྲུལ་འཁོར། དངོས་གཞི་དབབས་བསྐྱིལ་བཟློག་བཀྲམ་གེགས་སེལ་སོགས། །རྣམ་གྲངས་མང་ཡང་ཐོག་མར་གཏུམ་མོ་དང་། །ཐིག་ལེའི་འཁྲུལ་འཁོར་གནད་དུ་ཚུད་དགོས་པས། །སྦྱང་ཚུལ་སྐུ་གསུམ་བདུད་རྩིའི་འཁོར་ལོར་མཚུངས། །༸འབེབས་པའི་འཁྲུལ་འཁོར། ལས་ལ་སྦྱར་ཚེ་འབེབས་བསྐྱིལ་ལྡོག་པ་ཡི། །དམིགས་པ་གསུམ་པོ་ལམ་གྱི་རྩ་བར་ཟུངས། །༸དང་པོ་རྩལ་ལྡན་ཁྱུང་གི་འཁྲུལ་འཁོར་ནི། རྡོར་བསོར་པུས་སྟེང་བཞག་པའི་ཆོས་དྲུག་གིས། །བཅའ་བཤིག་འཕགས་ཆུང་དང་བཅས་རྐང་གཉིས་བརྐྱང་། །ལག་གཉིས་བསྣོལ་བས་བརླ་ནས་སོར་རྩེར་བྱུགས། །ཁུ་ཚུར་བརླ་ཐད་གསུམ་བརྡེག་ཕྱིར་འབེབས་གཅིག །འབེབས་ཆུང་དང་རྐྱང་འབེབས་གཅིག་གི་རྗེས། །ཁུ་ཚུར་པུས་མོར་གཏད་ལ་རླུང་རོ་དོར། །དེས་ནི་ཐིག་ལེ་གནས་ནས་གཡོ་བ་དང་། །སྡུག་བསྔལ་བདེ་བར་འགྱུར་བའི་དགོས་པ་ཡོད། །༸རྩ་འདོན་འཁྲུལ་འཁོར་ལྔ་ལས་བཟློག་པའི་འཁྲུལ་འཁོར་གཉིས། གཉིས་པ་གླང་ཆེན་ཆུ་འཐུང་འཁྲུལ་འཁོར་ནི། །རྡོར་བསོར་པུས་སྟེང་བཞག་པའི་ཆོས་དྲུག་གིས། །བཅའ་བཤིག་འཕགས་ཆུང་དང་བཅས་ཤད་ཀྱིས་ལངས། །པུས་མོ་གྲུ་གཉིས་དཔྲལ་བ་བཅས་སར་ཕབ། །སོར་མོ་ལྟག་བསྣོལ་ཨུ་སྒྲ་ལན་གསུམ་དང་། །བར་འབེབས་གསུམ་བཅས་རླུང་རོ་ལྷག་མེད་དོར། །༸གསུམ་པ་སྟག་མོ་ཧ་སྒྲའི་འཁྲུལ་འཁོར་ནི། རྡོར་བསོར་པུས་སྟེང་བཞག་པའི་ཆོས་དྲུག་གིས། །བཅའ་བཤིག་འཕགས་ཆུང་དང་བཅས་ཤད་ཀྱིས་ལངས། །ལག་གཉིས་མཐེབ་གུང་རྐང་པའི་སྲིན་མཛུབ་བཟུང་། །ཧཱ་ཧག་གསུམ་བརྗོད་བར་འབེབས་ལན་གསུམ་དང་། །ཁུ་ཚུར་པུས་གཏད་རླུང་རོ་གཡོན་དུ་དོར། །དེ་ལྟར་ལྡོག་པའི་འཁྲུལ་འཁོར་རྣམ་གཉིས་ཀྱིས། །སྲིད་ཀྱི་རྒྱུན་གཅོད་ལུས་ལ་གཟི་མདངས་འབར། །༸བཟློག་བཀྲམ་ཟུང་གི་འཁྲུལ་འཁོར། །༸བཞི་པ་ཝ་མོའི་དྲི་སྣོམ་འཁྲུལ་འཁོར་ནི། །རྐང་གཡོན་འོག་ཏུ་བྱས་པའི་ཆོས་དྲུག་གིས། །འཕགས་ཆུང་བཅའ་བཤིག་བཅས་པས་གྱེན་དུ་ལངས། །གུང་མོ་སྦྲེལ་བའི་ལག་པ་ལྟག་པར་འཁྱུད། །པུས་གྲུ་སར་ཕབ་དཔྲལ་པ་གྱེན་དུ་བསྟན། །སྣོམ་ཚུལ་གསུམ་དང་བར་འབེབས་ལན་གསུམ་བརྒྱབ། །ཁུ་ཚུར་པུས་མོར་གཏད་དེ་རླུང་རོ་བསལ། །དེས་ནི་ཐིག་ལེ་ལྡོག་བཀྲམ་བདེ་ཆེན་བསྐྱེད། །༸བསྐྱིལ་བཀྲམ་ཟུང་གི་འཁྲུལ་འཁོར། །༸ལྔ་པ་གཡང་མོའི་ལུས་སྤྲུག་འཁྲུལ་འཁོར་ནི། །རྡོར་བསོར་པུས་སྟེང་བཞག་པའི་ཆོས་དྲུག་གིས། །བཅའ་བཤིག་འཕགས་ཆུང་དང་བཅས་ཤད་ཀྱིས་ལངས། །མཐིལ་བཞི་སར་ཕབ་མགོ་བོ་གཡས་གཡོན་དུ། །ལན་གསུམ་བསྐོར་ཞིང་དགྱེ་འགུག་ཡང་དེ་བཞིན། །རྐང་མཐིལ་གཡས་པས་འཕོང་མགོ་ལན་གསུམ་བརྡེག །གཡོན་པ་དེ་བཞིན་ལག་གཡས་ཁུ་ཚུར་གྱིས། །ཕྲག་པར་གསུམ་བརྡེག་གཡོན་པའང་དེ་བཞིན། །ལུས་སྤྲུག་ལན་གསུམ་བར་འབེབས་དེ་ཡི་གྲངས། །ཁུ་ཚུར་པུས་མོར་གཏད་དེ་རླུང་རོ་དོར། །དེས་ནི་ཐིག་ལེ་འགག་དང་ཁྲག་སྲན་སེལ། །ལུས་གནས་ཀུན་ལ་བདེ་བས་ཁྱབ་པ་ཡི། །བཟོད་མི་ཤེས་པའི་བདེ་བ་ཁོང་ནས་འབར། །༸འདྲེན་དགྲམ་གྱི་འཁྲུལ་འཁོར་དྲུག་ནི། དྲུག་པ་རྟག་པ་ཆོས་འཁོར་འཁྲུལ་འཁོར་ནི། རྡོར་བསོར་པུས་མོར་གཏད་པའི་ཆོས་དྲུག་གིས། །ལག་གཉིས་བཅའ་བཤིག་མཐེ་བོང་རྣ་བར་སྦྱར། །གུང་མོ་དང་ནི་མཛུམ་མོ་མིག་ལ་བཀབ། །སྲིན་མཛུབ་སྣ་དང་ཐེའུ་ཆུང་ཁ་ལ་བཞག །མགོ་བོ་གཡས་གཡོན་གཉིས་སུ་ལན་གསུམ་བསྐོར། །དགྱེ་འགུག་གསུམ་དང་བར་འབེབས་ལན་གསུམ་བྱ། །དེས་ནི་ཐིག་ལེ་མགོ་རུ་ཁྱབ་པར་བྱེད། །༸བདུན་པ་སེངྒེ་འགྱིངས་སྟབས་འཁྲུལ་འཁོར་ནི། །རྡོར་བསོར་པུས་སྟེང་བཞག་པའི་ཆོས་དྲུག་གིས། །བཅའ་བཤིག་འཕགས་ཆུང་དང་བཅས་གྱེན་དུ་ལངས། །རྐང་མཐིལ་སྦྱར་ཞིང་སོར་མོ་ས་ལ་བརྟན། །པུས་མོ་ཕྱིར་བརྐྱངས་ཁུ་ཚུར་ནང་དུ་གཏད། །མགོ་བོ་བཏེགས་ཤིང་གཡས་གཡོན་དབུགས་གསུམ་དུ། །ཕྱི་འཛིན་གསུམ་རེ་ལུས་པོ་ལན་གསུམ་སྤྲུག །དྲག་འབེབས་གསུམ་བརྒྱབ་རླུང་རོ་ལྷག་མེད་དོར། །དེས་ནི་ཐིག་ལེ་གྱོན་ལྡོག་བདེ་ཆེན་འཕེལ། །རྩ་གནས་ཀུན་ལ་བདེ་བ་འཕེལ་བར་བྱེད། །༸བརྒྱད་པ་གཡུ་འབྲུག་འཁྱིལ་བའི་འཁྲུལ་འཁོར་ནི། །རྡོར་བསོར་པུས་སྟེང་བཞག་པའི་ཆོས་དྲུག་གིས། །བཅའ་བཤིག་འཕགས་ཆུང་རྐང་གཉིས་མདུན་དུ་བརྐྱངས། །ལག་གཉིས་ཁུ་ཚུར་དཔྱི་ཐད་གདན་ལ་བརྟེན། །རྐང་པ་གཡས་གཡོན་བརྐྱང་སྐུམ་གསུམ་རེ་དང་། །འབེབས་ཆུང་གསུམ་རྗེས་རླུང་རོ་ཕྱི་རུ་དོར། །དེས་ནི་ཐིག་ལེ་ཡན་ལག་གནས་སུ་བཀྲམ། །ཁྲག་ཤུགས་རྒྱུ་བ་ངན་པ་སེལ་བ་བྱེད། །༸དགུ་པ་གྱི་ལིང་སིལ་སྤྲུག་འཁྲུལ་འཁོར་ནི། །རྡོར་བསོར་པུས་མོར་གཏད་པའི་ཆོས་དྲུག་གིས། །བཅའ་བཤིག་འཕགས་ཆུང་དང་བཅས་རྒྱབ་ཏུ་ལོག །ཉ་བཞིན་ནམ་མཁར་འཕང་བའི་སྒལ་འབེབས་གསུམ། །རྩ་འདར་བཏོན་ཞིང་བར་འབེབས་ལན་གསུམ་བརྒྱབ། །ཐིག་ལེ་པག་པར་བཀྲམ་ཞིང་རླུང་སྲན་ཞི། །༸བཅུ་བ་གྱི་ལིང་གན་འདྲིལ་འཁྲུལ་འཁོར་ནི། །རྡོར་བསོར་པུས་སྟེང་བཞག་པའི་ཆོས་དྲུག་གི །བཅའ་བཤིག་འཕགས་ཆུང་དང་བཅས་རྒྱབ་ཏུ་ལོག །ཧ་ཞེས་པ་ཉ་བཞི་ནམ་མཁའི་མཐོངས་ལ་འཕང་། །ཧ྅ཞེས་སྒྲ་དང་བཅས་པས་གཡས་སུ་འདྲིལ། །གཡོན་དུ་དེ་བཞིན་སྡོམ་པས་ལན་གསུམ་འདྲིལ། །བར་འདེབས་གསུམ་བརྒྱབ་རླུང་རོ་ལྷག་མེད་བསལ། །དེས་ནི་ཐིག་ལེ་བ་སྤུའི་བུ་གར་བཀྲམ། །དྭངས་མ་སྐྱོན་དུ་གྱུར་པའི་ནད་རིགས་སེལ། །༸བཅུ་གཅིག་སེངྒེ་རྣམ་རོལ་འཁྲུལ་འཁོར་ནི། །རྡོར་བསོར་པུས་མོར་གཏད་པའི་ཆོས་དྲུག་གིས། །བཅའ་བཤིག་དང་བཅས་གྱེན་དུ་ཤད་ཀྱིས་ལངས། །རྡོ་རྗེ་འཆང་གི་ཕྱག་རྒྱ་ཐུགས་ཀར་བཅའ། །རྐང་མཐིལ་སྦྱར་ཞིང་སོར་མོ་ས་ལ་བརྟན། །པུས་མོ་ཕྱིར་བརྐྱང་ཁོག་སྟོད་གཟེངས་སུ་བསྟོད། །མགོ་བོ་བཏེགས་ཤིང་གཡས་ཡོན་དབུས་གསུམ་དུ། །སྣོམ་ཚུལ་ཕྱི་འཛིན་གསུམ་རེ་ལན་གསུམ་སྤྲུག །རྡོ་རྗེའི་ཐོགས་འབེབས་བརྒྱབ་ཅིང་རླུང་རོ་བསལ། །འདི་ནི་བཟློག་བཀྲམ་འཁྲུལ་འཁོར་ཐམས་ཅད་ཀྱི། །སྙིང་པོ་ཡིན་ཞེས་གྲུབ་ཐོབ་རྣམས་ཀྱིས་བསྔགས། །༸ཀུན་གྱི་ཡན་ལག་བཅུ་གཉིས་ཀུན་བཟང་དགྱེས་པའི་འཁྲུལ་འཁོར་ནི། ཆོས་བདུན་ལྡན་པའི་མགོ་བོ་གཡས་གཡོན་དུ། །ལན་གསུམ་བསྐོར་ཞིང་ཕྱོགས་གཉིས་བཅག་རེ་དང་། །གྲུ་མོ་ཤེད་བསྐྱེད་ཁུ་ཚུར་ནུ་སྟེང་བརྡེག །པད་སྐོར་དང་བཅས་རྡོར་བསོར་པུས་མོར་གཏད། །གཡག་གཡོན་རྐེད་སྐོར་གསུམ་དང་བར་འབེབས་གསུམ། །ལངས་ཏེ་རྐང་བའི་རྟིང་གིས་འཕོང་མགོ་བརྡེག །ཁུ་ཚུར་ནུ་སྟེང་བརྡབ་པ་ལན་གསུམ་དང་། །ལངས་འབེབས་གཅིག་དང་བར་འབེབས་གཉིས་བཅས་བརྒྱབ། །འཁྲུལ་འཁོར་ཀུན་གྱི་ཆ་ཤས་འདི་ལ་ཚང་། །དབབ་བསྐྱིལ་ལྡོག་བཀྲམ་ལས་ཀུན་འདི་ཡིས་བྱེད། །ཏིང་འཛིན་ལྡན་ན་ནད་རྣམས་གཉེན་པོར་འགྱུར། །ཁྱད་པར་དམིགས་མེད་ལྟ་བའི་གདེངས་ལྡན་པར། །བསྐྱིལ་བཟློག་བཀྲམ་པ་སྒྱུ་མའི་ལྟད་མོ་བཞིན། །གང་ཤར་ཕྱག་རྒྱ་གང་སྣང་བདེ་བ་ཆེ། །འཁོར་འདས་གཉིས་མེད་ལྷུན་གྲུབ་བདེ་ཆེན་འགྲུབ། །དངོས་གཞིའི་འཁྲུལ་འཁོར་རྣམ་པ་བཅུ་གཉིས་ཀྱིས། །དུས་སྦྱོར་བཅུ་གཉིས་དབུ་མའི་དབྱིངས་སུ་དག །རྩ་བ་རེ་ལས་ཡན་ལག་རེ་གྱེས་པས། །ཉེར་བཞིའི་གནས་ཀྱི་དཔའ་བོ་མཁའ་འགྲོ་འདུ། །འོད་གསལ་ཉི་མ་སྙིང་གི་དབུས་ནས་འཆར། །ཚེ་འདིར་མཁའ་སྤྱོད་འགྲུབ་པ་རྡོ་རྗེའི་བཀའ། །<br>རྗེས་ཀྱི་བྱ་བ་བོགས་འདོན་གེགས་སེལ་དང་། །བཀྲ་ཤིས་གསུམ་གྱིས་ལམ་གྱི་གནད་རྣམས་བསྡུས། །དང་པོ་རབ་འབར་ཉི་མའི་འཁྲུལ་འཁོར་ནི། །རྐང་གཡོན་ནང་དུ་བྱས་པ་ཉྭ་གཉིས་བསྣོལ། །ལག་གཡས་རྒྱབ་ཏུ་བྱས་པའི་གྲུབ་གཉིས་ཀྱིས། །པུས་མོར་འཁྱུད་པས་རྡོར་འཆང་ཕྱག་རྒྱ་བཅའ། །བུམ་ཆེན་ལན་མ་བདུན་དང་བཅའ་བཤིག་རེ། །རླུང་རོ་དལ་གྱིས་བསལ་བས་མེ་དྲོད་བསྐྱེད། །གཉིས་པ་དྭངས་བསིལ་ཟླ་བའི་འཁྲུལ་འཁོར་ནི། །ཞབས་གཉིས་པད་སྐྱིལ་དོར་བསོར་པུས་མོར་གཏད། །མགོ་བོ་གཟེངས་བསྟོད་ཧ་སྒྲ་ལན་གསུམ་འདོན། །དེས་ནི་ཚ་བའི་ནད་ཞི་རིག་པ་དྭངས། །ཐ་མ་བཀྲ་ཤིས་འཁོར་ལོའི་འཁྲུལ་འཁོར་ནི། །ཆོས་བདུན་བཅའ་བཤིག་ཆོས་འཆད་ཕྱག་རྒྱ་དང་། །མཆོག་སྦྱིན་མཉམ་བཞག་སྐྱབས་སྦྱིན་ཕྱག་རྒྱ་དང་། །ས་གནོན་ལ་སོགས་རྒྱལ་བ་རིགས་ལྔའི་རྒྱ། །རང་ཕྱོགས་བརྒྱབ་སྟེ་གདན་སྐོར་ལན་གསུམ་དང་། །འབེབས་ཆུང་འབྲིང་དང་ཆེན་པོ་གསུམ་རེ་བརྒྱབ། །དེས་ནི་གནས་དུས་ཀུན་དུ་བཀྲ་ཤིས་ཤིང་། །རྒྱལ་བསྟན་མདོ་སྔགས་ཡུན་དུ་གནས་པ་མཚོན། །<br>ཉམས་ཀྱི་རིམ་པ་མཐའ་དག་མདོར་བསྡུ་ན། །འཇིག་རྟེན་འཇིག་རྟེན་འདས་པའི་ཉམས་གཉིས་ཏེ། །སྣང་ཉམས་སྟོང་ཉམས་འཇམ་རྩུབ་གཉིས་རེ་འབྱུང་། །གང་ལ་རེ་དོགས་ཞེན་པ་མེད་ན་གྲོལ། །གེགས་སེལ་བོགས་འདོན་མན་ངག་ཁྱད་པར་ཅན། །གང་ཟག་དབང་པོའི་ཁམས་དང་རིམ་པ་བཞིན། །རྣམ་གྲངས་མང་ཡང་སྨན་དང་རྩ་བཅོས་དང་། །བླ་མར་གསོལ་འདེབས་སྟོང་སྦྱང་ཁྱད་དུ་འཕགས། །རྩ་རླུང་གྲུབ་པས་ཐུན་མོང་དངོས་གྲུབ་དང་། །མངོན་ཤེས་རྫུ་འཕྲུལ་ལྡན་ཞིང་ཉམས་རྟོགས་འཕེལ། །ལས་རླུང་དབུ་མའི་དབྱིངས་སུ་གྲོལ་བ་ཡིས། །མཆོག་གི་དངོས་གྲུབ་ཁ་སྦྱོར་བདུན་ལྡན་འགྲུབ། །<br>མཆོག་ཏུ་གསང་བ་འོག་སྒོའི་གདམས་པ་མཆོག །མཁའ་འགྲོའམ་དཔའ་བོ་བརྟགས་འགུགས་སྦྱང་བ་དང་། །གསང་ཐུར་གདམས་པ་རྡོ་རྗེ་ཆུ་འཐུང་དང་། །པདྨ་དུང་འབུད་ནུས་པ་ཐོན་པར་བྱ། །དེ་ནས་ཡིད་མཐུན་དབེན་པའི་ནགས་ཁྲོད་དུ། །དམ་ཚིག་ཐུབ་པའི་གྲོགས་དང་ཆབས་ཅིག་ཏུ། །དགའ་བ་བཞི་ཡི་ཉམས་རྩལ་སྦྱང་བ་ཡིས། །ཟླ་དྲུག་གམ་ལོ་གསུམ་ནང་དུ་བདེ་ཆེན་རྙེད། །འདི་ཉིད་ཅི་བཞིན་སློབ་པའི་སྣོད་མཆོག་ནི། །བླ་མ་སངས་རྒྱས་དངོས་སུ་བལྟ་བ་དང་། །དམ་ཚིག་སྲོག་གི་ཕྱིར་ཡང་མི་གཏོང་པའི། །གཅིག་གཉིས་ཁོ་ནར་སྙན་བརྒྱུད་ཡིན་ཕྱིར་གཞིག །<br>དེ་ལྟར་གསལ་རྒྱས་གདམས་པ་བསྟན་ཟིན་ནས། །རྒྱུན་དུ་ཉམས་ལེན་གནད་དུ་དྲིལ་བའི་ཚུལ། །ཐོ་རངས་འདུ་བ་སྙོམས་པའི་དུས་སྐབས་སུ། །བླ་མར་གསོལ་འདེབས་སྐྱབས་སེམས་སྔོན་དུ་འགྲོ། །དེ་ནས་རང་ལུས་གནས་ཡུལ་སྟོང་པའི་ངང་། །སྐད་ཅིག་གནམ་ས་ཆོས་འབྱུང་མཁའ་སྤྱོད་ཞིང་། །དབུས་སུ་ཨེ་དམར་པད་ཉི་བམ་རོའི་སྟེང་། །ཨཿལས་ཕག་དམར་ཁྲོ་མོའི་ཆས་རྫོགས་པ། །གཡས་གཡོན་གྲི་ཐོད་ཞབས་གཉིས་གར་སྟབས་རོལ། །ལུས་ནང་སྟོང་ར་དམ་དམར་གུར་ཕུབ་འདྲ། །དབུས་སུ་རྩ་མཆོག་དབུ་མ་ཤེལ་བུམ་ལྟར། །མཚན་ཉིད་བཞི་ལྡན་གཡས་གཡོན་རོལ་རྐྱང་ཟུང་། །མར་སྣ་ལྟེ་འོག་གཉེར་ནས་དབུ་མར་ཚུད། །དབུ་མའི་ཡར་སྣེ་ཚངས་བུག་རོ་རྐང་སྣ། །འཁོར་ལོ་བཞི་བཅས་གསལ་སྣང་འདུས་གསུམ་ཁ། །ལྟེ་འོག་སོར་བཞིའི་ཉི་སྟེང་བླ་མ་དང་། །དབྱེར་མེད་རཾཿདམར་མེ་འབར་ཡིད་གཏད་ངང་། །བླ་མར་གསོལ་བཏབ་གནད་ལྡན་རླུང་དགུ་འབུད། །དལ་རླུང་དར་ཅིག་སློད་བཞག་སླར་རྔུབ་འདོད། །ཤར་ཚེ་རྔུབ་ཆུང་བསྣད་བཅས་ལྟེ་འོག་མནན། །རོ་རྐྱང་ནས་བརྒྱུད་དབུ་མར་རླུང་ཞུགས་པས། །རཾ་ལས་མེ་འབར་ལྟེ་བའི་རྩ་འདབ་གང་། །རིམ་བཞིན་གོམས་ནས་གསང་གནས་སྙིང་ག་ཁེང་། །བསམ་བྱས་ཕོ་སྐོར་རྐེད་སྐོར་སྐབས་སྐབས་བྱ། །མི་ཐུབ་སྙམ་ཚེ་མིག་ཟིམ་རིག་པ་ཉིད། །ལྟེ་འོག་ལ་གཏད་རླུང་རོ་ལྷག་མེད་འབུད། །དེ་ལྟར་རྔུབ་དགང་གཞིལ་འབུད་སྦྱོར་བ་བཞི། །གསུང་པ་རླུང་དགང་མི་ཐུབ་པ་སྙམས་ཚེ། །བ་སྤུའི་བུ་ག་ཁྲོལ་ཚགས་ལྟར་བསམ་ནང་། །རླུང་རྣམས་སྔོ་བསང་གཏོན་དམིགས་ལུས་འདར་བཏོན། །དེ་ནས་འབུད་བྱ་རླུང་དགར་རན་ཚོད་ཅེས། །འདི་དུས་འཁྲུལ་འཁོར་ཡན་ལག་ལྔ་སྦྱང་ནི། །རྩ་མདུད་གློད་ཕྱིར་འབད་ཅེས་གསུང་པ་བྱ། །དེ་ལ་གོམས་ནས་ཡེ་ཤེས་གཏུམ་མོ་ནི། །ལྟེ་བའི་ཨཿཤད་མེ་ཡི་གཏུམ་མོ་ཡི། །ཟླ་བ་ཧཾ་མགོ་ཐུར་བསྟན་དྲོད་ཀྱིས་བཞུ། །བདུད་རྩི་བབས་པ་མེ་དང་བྲོས་འདེད་མཐར། །སྙིང་གར་འདྲེས་ཏེ་རིམ་བཞིན་བྱང་སེམས་རྒྱས། །མགྲིན་སྙིང་ལྟེ་གསང་འཁོར་ལོའི་རྩ་འདབ་གང་། །དམིགས་གནད་དགའ་བཞི་ངོས་བཟུང་ཡས་བརྟན་བརྟག །སླར་བཟློག་རིག་པ་སྤྱི་བོར་མཁའ་ལ་གཏད། །སྦྱོར་བ་དྲུག་གིས་འདྲེན་བྱས་མས་བརྟན་དགའ། །འཁོར་ལོ་བཞིར་མྱོང་དུད་འགྲོའི་འགྱུར་བཞི་ཡིས། །ཚངས་པའི་སར་བསྐྱལ་སེང་རོལ་ཆོས་འབྱུང་གིས། །བཀྲམ་བྱས་ཁུ་ཚུར་ཟུག་པས་རྩ་མིག་གདབ། །དེ་ནས་བདེ་སྟོང་ཆོས་ཉིད་ཀློང་ཡངས་སུ། །དམིགས་བསམ་བརྗོད་བྲལ་ངང་ཀློད་འདི་ནི་བསྔགས། །ཐབས་ལམ་རྩ་བ་བོགས་འདོན་སྤྱོད་གཙོ་ཡིན། །དེ་བས་ཐུན་མོང་ཐུན་མིན་སྤྱོད་པ་ནི། །ཀུན་བརྡར་ཀུན་བཟང་བརྟུལ་ཞུགས་རྣམ་རྒྱལ་སྤྱོད། །གང་ཟག་དབང་རིམ་གསུམ་མཐུན་ཚོགས་དབེན་སྤྱོད། །མདོར་དྲིལ་ཕྱི་ལྟར་ཚངས་སྤྱོད་ཚུལ་ཁྲིམས་བསྟུན། །ནང་ལྟར་སེམས་བསྐྱེད་སྙིང་རྗེ་གཙོ་བོར་འདོན། །གསང་བ་ཐབས་ལམ་གསང་སྔགས་ཟབ་མོར་སྤྱོད། །ཀུན་ཀྱང་ཐོ་ཅོ་བག་མེད་རྩིང་སྤྱོད་དང་། །སྙན་གྲགས་ལོ་འདོད་རྒྱུ་མིན་ཞེན་བྲལ་དང་། །བག་ཡོད་རྒྱལ་བའི་གསུང་བསྟུན་དོན་ལ་སྤྱོད། །ཨེ་མ་འབྲས་བུ་ཞེས་གྲགས་སྒྲ་ཆེན་དེ། །སྔར་མེད་གཞན་ནས་བྱུང་བ་ཞིག་མིན་ཀྱེ། །ཀུན་རྫོབ་གློ་བུར་དྲི་མ་རང་སངས་ཏེ། །རང་རིག་སྒྲིབ་བྲལ་མཐོང་ལ་འབྲས་བུར་བཏགས། །འཁྲུལ་པ་སངས་ཚེ་སྐུ་དང་ཡེ་ཤེས་རྒྱས། །དེ་ལ་སངས་རྒྱས་ཞེས་སུ་བརྗོད་པ་སྟེ། །བརྩོན་འགྲུས་ལྡན་པས་བསྐྱེད་རྫོགས་ཉམས་བླང་མཐར། །རེ་དོགས་འཕྲང་ལས་གྲོལ་ཚེ་འབྲས་བུ་ཡིན། །དེ་ལྟར་ལྟ་བསྒོམ་སྤྱོད་འབྲས་མདོར་དྲིལ་ན། །ལྟ་བ་རྒྱ་མཚོའི་ནང་གི་གཟའ་སྐར་ལྟར། །དེར་འཛིན་ཤེས་པ་རྩིས་གདབ་བྲལ་བར་ཞོག །བསྒོམ་པ་ནམ་མཁའ་ཡངས་པའི་ཀློང་བཞིན་དུ། །ཕྱོགས་རིས་བློས་བྱོས་སྒོམ་དང་བྲལ་བར་ཞོག །སྤྱོད་པ་སྒྱུ་མའི་སྐྱེས་བུའི་འཁྲུལ་འཁོར་བཞིན། །ཞེན་བྲལ་རང་བབ་བག་ཡངས་ངང་དུ་ཞོག །འབྲས་བུ་རི་བོ་ཆེན་པོ་ཅི་བཞིན་དུ། །གོང་བསྒྲོད་ལྟོས་གཞི་རེ་དོགས་མེད་པར་ཞོག །གསང་ངག་ཆོས་ཀུན་རྩ་བ་བྱིན་རླབས་ཡིན། །བྱིན་རླབས་བླ་མར་རགས་ལས་མོས་གུས་གཅེས། །ཐེག་ཆེན་གཞི་ཡིན་གཞན་ཕན་སེམས་བསྐྱེད་གཅེས། །ཆོས་ཀྱི་སྲོག་ཡིན་སྡོམ་དང་དམ་ཚིག་གཅེས། །བསྟན་པའི་གཞི་ཡིན་ཚོགས་གཉིས་ཟུང་འཇུག་གཅེས། །ཆོས་ཀྱི་ལམ་གྲོགས་བརྩོན་འགྲུས་སྙིང་རུས་གཅེས། །ཨེ་མ་སྤྱིར་ཡང་ཆོས་བཞིན་སྤྱོད་པ་ལ། །དམ་ཚིག་མི་བསྲུང་སངས་རྒྱས་རེ་བ་ནི། །སོལ་བ་ཕྱི་བདར་བྱས་ནས་དུང་འདོད་འདྲ། །རྒྱུ་འབྲས་མི་བསྲུང་བྱང་ཆུབ་ཐོབ་འདོད་ནི། །བྱེ་མ་བཙིར་ནས་མར་ཁུ་འདོད་པ་འདྲ། །བླ་མ་མ་དགྱེས་དགེ་བ་གང་བསྒྲུབ་ཀུན། །ས་བོན་མེ་ལ་བསྲེག་པའི་ལྗང་བུ་འདྲ། །དེ་བས་རྟག་ཏུ་བླ་མར་གུས་གྱིས་ཤིག །དེ་ལྟར་རྫོགས་རིམ་བསྐོར་ལས་འཕྲོས་པའི་གཏམ། །ཉམས་ལེན་འདོད་ལ་རྟོགས་པའི་བོགས་འདོན་ཕྱིར། །རྒྱལ་བཀའ་གྲུབ་ཐོབ་ཞལ་ལུང་ཁྱད་པར་དུ། །རྩ་བའི་བླ་མའི་གསུང་གི་མན་ངག་ཉིད། །རང་གི་ཉམས་མྱོངས་དང་བསྟུན་སྨྲས་པ་ཡིན། །མི་ཤེས་མཁས་འདོད་ཚེ་འདིའི་མི་ཆོས་དང་། །སྟོད་སྨད་གྲགས་པ་སྒྲུབ་པའི་ཆེད་དུ་མིན། །འདི་ལྟར་སྟོན་ལ་གཏན་ཚིགས་ལུང་དང་ནི། །མན་ངག་ཆེ་བའི་ཚིག་ཚོགས་མང་པོ་ཞིག །བརྗོད་པར་འོས་ཀྱང་གསང་བ་སྲུང་ཕྱིར་བཞག །སྤྱིར་ཡང་ཉམས་སུ་མ་བླང་ཚིག་སྐམ་པོ། །འབྲུག་སྟོང་ལྡིར་ཡང་འཆི་དུས་སྟོང་སྐད་ཡིན། །ཉམས་ལེན་ཐུབ་ན་རྒྱལ་གསུང་ཚིག་རེས་ཆོག །རྒྱལ་བའི་གསུང་ཆོས་རྒྱ་མཚོ་ལྟ་བུ་ལ། །བློ་རྨོངས་བདག་གི་ཚིག་གིས་ཅི་ཞིག་བྱ། །འདིར་ནི་བདུད་འདུལ་རྡོ་རྗེ་ཀློང་གསལ་སྙིང་། །འདྲེན་མཆོག་པདྨ་བདེ་ཆེན་གླིང་པ་སྟེ། །གཏེར་ཆེན་གསུམ་གྱི་མན་ངག་རྩ་བ་དང་། །བདེ་གསང་དུས་འཁོར་སྦས་དོན་འདི་ལ་ཚང་། །ཨོ་རྒྱན་རྗེ་ནས་དམ་པ་བདེ་གཤེགས་དང་། །ཀཿཐོག་བླ་རབས་གོང་མ་རིམ་བྱོན་གྱི། །སྦས་ནས་ཉམས་སུ་ལེན་པའི་མན་ངག་སྟེ། །རིམ་བརྒྱུད་བཀའ་ཡི་རྒྱ་མཚོ་ཆེན་པོའང་འདི། །དེ་ཕྱིར་གངས་ཅན་བརྟོལ་ནས་རྒྱ་གར་ཉུལ། །ཨོ་རྒྱན་མཁའ་འགྲོའི་གླིང་དུ་སླེབས་ནའང་། །རྫོགས་རིམ་གདམས་པ་འདི་ལས་ལྷག་པ་མེད། །འདི་ཉིད་ཅི་བཞིན་ཉམས་ལེན་བུ་རེ་ལས། །འཕྱར་ཆོས་བྱེད་ན་དེ་སྲོག་མ་དམ་གཟས། །རོལ་མཛོད་བཛྲ་ས་མཱ་ཡ་དམ་ཛཿ ཉམས་ལེན་བུ་ལ་རྟག་ཏུ་གྲོགས་མཛོད་ཅིག །གསང་ཞིང་ཚུལ་བཞིན་ཉམས་སུ་ལེན་པ་པོར། །བཀའ་སྲུང་དྲེག་པའི་ཚོགས་ཀྱིས་རྟག་བསྲུང་ཞིང་། །མཐུན་རྐྱེན་དངོས་གྲུབ་དབྱར་མཚོ་ལྟ་བུར་འཕེལ། །ཚེ་འདིར་གྲོལ་བ་ཐོབ་པ་རྡོ་རྗེའི་ལུང་། །འདི་ལྟར་བྲིས་པའི་དགེ་བས་འགྲོ་བ་ཀུན། །ཐེག་མཆོག་དགེ་བའི་བཤེས་ཀྱིས་རྗེས་བཟུངས་ཤིང་། །རིམ་གཉིས་ཉམས་རྟོགས་ཡར་ངོའི་ཟླ་ལ་འགྲོགས། །དོན་གཉིས་ལྷུན་གྲུབ་སངས་རྒྱས་མྱུར་ཐོབ་ཤོག །ཅེས་ཚེ་རབས་ཀུན་ཏུ་འབྲལ་མེད་ཚོམ་བུ་གཅིག་ཏུ་འགྲོ་བ་འདུལ་བའི་སྨོན་ལམ་གྱི་མཐུ་གྲུབ་པ་གཉག་རིགས་ཀྱི་རྣལ་འབྱོར་མ་ནམ་མཁའ་ཡེ་ཤེས་གསལ་སྒྲོན་ངོར་བྲིས་པའི་ཞལ་གདམས་སྙིང་ཁྲག་གི་དྭངས་མ་དེ་ཉིད་ཀྱི་གཏུམ་མོའི་ཉམས་ལེན་ཐད་རྒྱས་པ་ཞིག་དགོས་ཞེས་རང་གི་ཆོས་ཀྱི་བུ་དུ་མས་ལན་གཅིག་ཡིན་པར་ཡང་ཡང་བསྐུལ་བ་དང་། སླར་ཡང་རྣལ་འབྱོར་མ་དེ་ཉིད་དང་སྐྱེས་མཆོག་འབར་ར་བ་སོགས་ཀྱིས་མིག་སྨན་མདོག་གི་ཅང་ཤེས། ཐབས་ཤེས་ཀྱི་རྡོར་དྲིལ། གསེར་དངུལ་གྱི་བདོག་པ། གཞོན་ནུ་མའི་སྟོན་མོ་སོགས་ཚོགས་ཀྱིས་མཆོད་པ། རྫོགས་རིམ་འདི་ཉིད་རྒྱུན་ཆགས་སུ་ཉམས་སུ་ལེན་པའི་ཐུགས་དམ་མཛད་པ་དང་། ཆོས་བཞིན་སྤྱོད་པའི་གྲྭ་བ་བདུན་ཙམ་གྱིས་དཔལ་རྡོ་རྗེ་སེམས་དཔའི་ཡི་གེ་བརྒྱ་པ་འབུམ་ཕྲག་གཏོང་བའི་དམ་བཅའ་བྱས་པས་ཡིད་མགུ་སྟེ། སྔགས་ཀྱི་དགེ་སྦྱོང་རིག་འཛིན་ཚེ་དབང་ནོར་བུ་འཕྲིན་ལས་འགྲོ་འདུལ་རྩལ་གྱིས་དཀར་ཕྱོགས་དགའ་བ་དང་པོར་རྒྱལ་བ་ལོ་རས་ཀྱི་སྒྲུབ་གནས་བྱ་གནམ་དབུ་རིར་བྲིས་པས་ཀུན་གྱི་རྒྱུད་ལ་བདེ་སྟོང་སྤྲོས་པ་དང་བྲལ་བའི་ཡེ་ཤེས་སྐྱེ་བར་གྱུར་ཅིག །</p>",
    "ContentChinese": "<p class=\"chinese-text\">摩訶師利嘿嚕嘎南瑪<br>普照輪涅大樂尊妃界，放化遊戲雲霞妙相重，<br>大樂殊喜蓮華金剛杵，界降無漏甘露雨霏霏。<br>三處空行大悲曦軒輝，三有普覆方便之妙道，<br>由依最極大密口訣力，獲諸無漏金剛身供養。<br>十地自在降魔具力洲，成就群彥之主明界藏，<br>毗盧遮那大樂洲尊等，母續口訣大寶藏諸勝。<br>即身現前空行果位者，圓次教傳普賢珍寶等，<br>吾意能成訣竅寶藏之，大恩上師菩提間虔供。<br>淨橛圓次甘露之飲泉，勝樂時輪訣竅百味珍，<br>三大伏藏師意令印者，吾信淨誓金器中旋聚。<br>無量續部滿願灝滄瀛，上師口訣勺箸拌旋勻，<br>圓滿加持韶華明月光，見即驅暗深訣施聆聽。<br>前行<br>終生善與惡，由依妙法故，出離心勸勵，<br>三皈依法首，尋找具德師，自身具誓徒，<br>修行心如法，如理依為要，尚且四轉心，<br>不破輪迴謊，功德成魔障，故行依小乘，<br>若無菩提心，疑修佛成魔，故自他交換，<br>恆修非遍解，別解脫菩薩，密乘等戒律，<br>若離無成就，必當恆守持，若入祕密乘，<br>住處伴善法，內外合緣起，如法應時修。<br>密乘之殊勝<br>大乘功德海，小乘牛跡水，經部及密乘，<br>比喻量能知，無苦多方便，快速果道用，<br>智者定信者，二今解脫法，不靠祕密乘，<br>無法獲佛果，經續皆言故，不入非智者，<br>前行基穩期，依生起次第，情器不淨分，<br>淨後入圓次。<br>圓滿次第之殊勝<br>如是一切諸法乃，本來輪涅無分別，<br>二諦雙運圓成面，圓次樂空任運也。<br>為了離貪者自身，亦為具貪者他身，<br>煩惱不棄道用法，密乘之外別無他。<br>上根利器一剎那，其餘月或三年內，<br>解開中脈諸脈結，直至十地此奇妙。<br>色身成相之理<br>金剛蘊界之宮城，不知如何安住理，<br>一切道與地功德，如示盲者看色相。<br>由此續中如是說，父親母親因緣故，<br>蕩漾流動凝酪位，橢圓形及圓圓形。<br>堅肉位及如魚形，如龜形及如蛙形，<br>如此晝夜每一週，由依基礎漸形成。<br>期約九月又十日，圓滿身成出母胎，<br>脈與氣及明點三，與身同時而圓成。<br>如是一切功德分，隱藏形式住色身，<br>何時逢遇死亡期，現和增得之次第，<br>四種中陰顯象等，一切氣和心所作。<br>外內之淨行<br>一、脈輪<br>如何外內淨行理，於此敷演稍許分，<br>諸多經典續中說，外界如何內亦是。<br>如同內界現外界，淨行方法述繁多，<br>尤其吉祥時輪續，外世界與內情身。<br>壇城之輪他自性，所說道理極詳細，<br>生有初次形成期，臍處脈輪所生故。<br>臍處中間之脈輪，是為十二宮合時，<br>此處根本年輪及，外處所現六十脈。<br>是為六十甲子年，五行而成色身故，<br>木火水金依次方，十輪東風南為火。<br>北水西方為土大，中央土依時輪言，<br>須彌山即虛空界，遍滿一切之自性。<br>具足六界金剛身，中脈清淨智慧界，<br>遍滿一切諸脈處，外界虛空亦如是。<br>阿哇德德具螺母，羅睺羅時火平界，<br>味脈以及獨脈乃，持此紅白明點脈。<br>日月方便與智慧，頂髻輪有四支脈，<br>此乃表示為四座，眉輪具有十六脈。<br>表為十五日智慧，喉輪三十二支脈，<br>表為二十八星及，智慧所分之四刻。<br>心輪具有八支脈，表為八座及八曜，<br>臍輪六十四支脈，表為六十刻四空。<br>合時等如前所述，密輪三十二支脈，<br>望晦十六卅二方，四肢大節之輪乃。<br>表為十二之月份，小節六十之輪乃，<br>表為一晝夜之刻，各個具有六分支，<br>三百六十刻氣息，如何外界內亦是。<br>二、明點<br>殊勝明點輪涅命，一切輪迴即寂靜，<br>世俗以及勝義之，菩提心之幻所成。<br>尚且世俗因明點，水及火界紅白之，<br>精華頂點埃萬字，阿杭外界為日月。<br>粗和細氣集合界，羅睺時火乃明點，<br>具有種種明點界，種種行為流星眾。<br>紅白增減遊戲力，上下太陽南北行，<br>春夏秋冬熱與寒，示現顯出諸種相。<br>精和塵氣三中脈，偶爾亦有全入期，<br>六界時期六月終，羅睺入於日與月。<br>總之情器住及滅，增減痛苦和快樂，<br>一切善惡明點之，佛曰即乃其所為。<br>三、氣息<br>尤其氣風所作業，一切均具大力量，<br>根本明點之作用，亦為無餘氣所作。<br>是故此等一切主，確為此所言之氣，<br>右方流行五壇城，五種凶曜之自性。<br>左方流動五壇城，五種寂靜曜自性，<br>命氣下行二日月，所有星曜之宮位。<br>臍出左右之支脈，六十四支如蓮花，<br>四瓣中五總六十，脈及中央有小遷。<br>五次總集為大遷，以上此合時亦為，<br>二方平與不平故，如是前述此星宮。<br>各一夜月及年等，如是外界季節業，<br>氣界行動而圓成，三界生滅輪涅法，<br>一切顯現氣之力。<br>總說<br>依如四座時輪義，聖者甚深口訣乃，<br>韶華青年之氣息，晝夜一天之息數。<br>粗數外界一年之，恰為時間之總量，<br>所有根本智慧氣，鼻處流動一氣息。<br>可分為數三十二，其一分為智慧氣，<br>一天具有智慧氣，六百七十餘有五。<br>此乃一天氣息數，兩萬一千六百之，<br>分數而為三十二，即為除後所得寶。<br>此中含具諸多理，多聞經驗者能瞭，<br>現為初學之時期，實踐擷要為重點。<br>內外合時<br>合時內外相合理，續部之王金剛鬘，<br>勝意授記之經續，勝樂敦炯等續部。<br>表為於內瑜伽故，會以遷轉名暗示，<br>此亦二十四大遷，晝與夜間平等期。<br>晝有十二夜十二，每一大遷氣息數，<br>流行具有九百次，此亦分為四小遷。<br>二百二十五息數，各大遷有一怙主，<br>晝夜各自轉三次，四怙主之左右方。<br>平變粗及柔之氣，依次蓮花怙主及，<br>事業珍寶金剛怙，小遷四位佛母氣。<br>上頰鼻中脣之方，行次白衣度母尊，<br>宣說佛眼主母尊，大遷二四小遷數。<br>分為九十餘有六，其亦晝夜之數量，<br>二萬一千六百氣，此上意集經等義。<br>瑜伽終密口訣中，二十四境脈與氣，<br>相合二十四大遷，復次各個一大遷。<br>得與享受入三種，同時一起顯現出，<br>如是遷轉之數理，宣說多種能解故。<br>於此稍事廣宣說，吉祥時輪金剛中，<br>外內他三相合故，十二合時與外界。<br>天空十二宮之輪，一晝夜間出與落，<br>地上即為合時同，如何了解星宮乃。<br>應要了解當日宮，其引羅哪為合時，<br>十二答嘎依次生，復次羊雙子獅射。<br>寶瓶不平六合時，左邊鼻孔流行氣，<br>中央上方鼻翼下，流行五壇如生次。<br>空風火水土依次，其時現出羅睺羅，<br>是為水金計都曜，金牛室女蠍羯磨。<br>雙魚平等之合時，右邊鼻孔流行氣，<br>下頰上鼻及中央，流行五壇如圓次。<br>土水火風及虛空，其現土曜及木曜，<br>火曜日曜時火曜，復次合時之性相。<br>動搖穩定及平等，白羊巨蟹秤魔羯，<br>此為四動穩定乃，金牛獅子天蠍瓶。<br>平等四乃雙室女，射手雙魚為普稱，<br>如是須能圓滿知，外界晝夜平等期。<br>合時晝六夜亦六，其言合時住時量，<br>粗數各個有五刻，每個合時等大遷。<br>氣息一千八百整，時刻小遷中圓滿，<br>此故確數三百六，尚有稍微說明處。<br>虛空現出任何宮，此間是為其合時，<br>各個宮有九序數，四個行星依序數。<br>一序數為二百息，此故一刻中星間，<br>粗數量氣息八百，雖是無增減而現。<br>晝夜長短眾紛紜，詳細算法參他處，<br>續部言說秤量時，晝與夜間兩長時，<br>無有缺餘六合時，明說其量必明知。<br>緣起<br>氣息遷轉十二分，於與緣起相合理，<br>十二緣起即乃為，無明行緣及識緣。<br>名色諸根及觸緣，受緣愛緣及取緣，<br>有及生老死緣起，如是順流輪迴法。<br>反之逆流即涅槃，外界即為年日月，<br>與時辰等相配合，年為鼠肖即無明。<br>行緣牛肖識為虎，名色兔諸根為龍，<br>蛇觸馬受羊愛緣，猴為取緣雞有緣。<br>生緣即狗老死豬，月分緣起顯現內，<br>鬼宿無明魔羯宮，星宿行緣寶瓶宮。<br>如是順流式相配，此言一天享受理，<br>魔羯雙魚牛巨蟹，室女等六平等月。<br>平月上旬左生緣，順流數現輪緣起，<br>下旬右方死緣起，逆數攝受涅緣起。<br>寶瓶白羊雙獅子，射手秤六不平月，<br>數法反於平等月，復次平等月譬喻。<br>上旬順流下旬逆，鬼宿初一為無明，<br>初二行緣等依次，十三十四十五日。<br>本月初三四五之，顯現緣起為相同，<br>下旬由無明老死，逆數其餘如前補。<br>上旬若有閏日時，多出之日為觸緣，<br>日數不足成十四，取出十五加觸緣。<br>不平星宿月譬喻，上下初一為行緣，<br>上旬逆數下順數，上旬初二為無明。<br>初三老死依次第，下旬初二為識緣，<br>初三名色等依次，上旬缺閏無明緣。<br>下旬受緣相配合，如何缺日增補理，<br>是為初六之緣起，時間緣起合時乃。<br>合時直至於何處，各其合時即顯現，<br>羯磨無明合即知，內大以及外世界。<br>本來即為同一體，了悟其者具善緣，<br>無明氣心所作業，迷惑如何解脫理。<br>需靠緣起之了解，經部密續合為一，<br>瑜伽氣脈明點三，若知修行擊重點，<br>逆數十二緣起之，獲得成佛無懷疑。<br>脈輪<br>宣說主要三種脈，中脈形如空房柱，<br>無彎曲而稱中脈，諸樂生故根答瑪。<br>若依俗諦微細脈，一切分支脈之母，<br>勝義定生智慧脈，色形等依緣起說。<br>臍生脈端分為三，中脈梵穴右支耳，<br>二支脈稍入二鼻，左支進入自方耳。<br>微細脈根入密處，其有四結或廿一，<br>臍有生身白明點，心有起念紅明點。<br>喉有分解氣明點，頂有顯現光明點，<br>不淨時期結中沉，淨時增力清心嚴。<br>味脈男眾右方生，受持一切安樂味，<br>貪欲方便之自性，壓時如享妙味食。<br>獨脈經心左方出，無他連故稱名之，<br>端入左眼生無念，表為瞋心即智慧。<br>三脈方便解脫別，輪有七六五或四，<br>清淨煩惱增智分，種增減能淨所淨。<br>臍有六十四支脈，生起煩惱智慧脈，<br>分出三百有八支，分二千四百卅二。<br>心間根本八種脈，煩惱智慧光明脈，<br>分為三十有八支，其分一千有九百。<br>喉間根本十六脈，煩惱本明智慧脈，<br>分為三百有四十，其分無數連諸輪。<br>頂輪根本三十二，顯現煩惱智慧脈，<br>分為三百有六十，分兩千九等無數。<br>尤他身速樂使道，生起樂空雙智處，<br>密輪根本廿八脈，其分七十二支脈。<br>此因陰陽種差異，方便中脈末微細，<br>道用除傳承口訣，非為大欲者任用。<br>氣息<br>然而言說諸氣之理論，五種根本氣與五支氣，<br>兩萬一千六百行氣等，宣說種種攝於十主氣。<br>復次分為根本與支氣，命氣識蘊水界行於心，<br>白色不動佛性半圓形，依靠生命意識安住處。<br>上氣想蘊火界行於喉，紅色彌陀體性三角形，<br>依靠呼吸發出聲音話，外與內界能融合為一。<br>下氣受蘊土界行於陰，黃色寶生體性四方形，<br>功用行住排除大小穢，降落吸引紅白兩明點。<br>等氣行蘊風行住於臍，黃綠不空體性形如弓，<br>功用暖身解除諸寒病，飲食消化引起猛烈火。<br>遍氣色蘊空界滿全身，藍色毗盧體性為圓形，<br>功用收受苦樂死期行，如是自在五氣獲五身。<br>持命氣乃行於五根者，分支五氣如何安住理，<br>住於腸如龍蛇盤旋氣，消除凶病眼識與色合。<br>住於肝如烏龜形狀氣，肢體伸收耳識與聲合，<br>住於肺如蜥蜴形狀氣，瞋恨生起鼻識與香合。<br>住於心如天子形狀氣，哈欠生欲舌識與味合，<br>住於腎如彎弓形狀氣，持命噴嚏身識與觸合。<br>氣之作用以及遷移分，續部意義大珍寶藏庫，<br>依靠成就口訣廣解義，非為只依書卷上舞姿。<br>明點<br>雖有紛多諸異之明點，主要有為相物體明點，<br>無相任運光明二明點，分之宣說第一方便道。<br>如何安住方便根明點，頂有方便白分之明點，<br>臍有智慧紅分之明點，根本光明離戲之明點。<br>幻化遍計無明之明點，五行界集物體三明點，<br>宣分最後有相圓次道，復次如何明點撃要理。<br>年月日與時辰依次第，十六歡喜十六空性及，<br>十六天女十六果位身，夏季日回六個月期間。<br>增長月亮興盛菩提心，夜間越長寒涼力漸增，<br>心性清明自在攝明點，冬季回日六個月期間。<br>增燃太陽猛烈紅分盛，晝間越長暖熱力漸增，<br>生起貪欲沉睡蒙諸根，初一住於右拇指短阿。<br>初二住於脛腿間長阿，初三住於大腿間短峉，<br>初四住於祕密處長峉，初五住於肚臍處短嗚。<br>初六住於肚心間長嗚，初七住於胸乳處短日，<br>初八住於右手處長日，初九住於喉部間短樂。<br>初十住於嘴唇處長樂，十一住於顴骨處短欸，<br>十二住於眼睛處長欸，十三住於耳朵處短歐。<br>十四住於頭頂處長歐，十五頂部味脈內盎字，<br>十六圓滿一切增長分，開始隱沒具涅槃點阿。<br>融入中脈遍滿於全身，上旬初一男眾之右方，<br>女眾左方拇指處遷移，上旬初一此兩者反之。<br>十五頂部住獨脈增長，如是了解世俗明點後，<br>降住引散擊於要處之，四空性引起顯現光明，<br>獲得大樂金剛勝身果。<br>猛火<br>中脈下尖有稱猛烈火，母親所得紅分短阿形，<br>自在實用能引大樂點，總計分為三種猛烈火。<br>身之猛火依靠於幻輪，點燃起火猛烈而燃燒，<br>語之猛火氣與文字形，如何觀想如是而燃燒。<br>意之猛火無緣空性界，智慧明燈自然而燃燒，<br>意之明點亦可分為三，生暖誓句手印猛烈火。<br>生樂法之手印猛烈火，樂空無別大手印火等，<br>如是三種修行理而分，十八猛火成就眾宣說。<br>六瑜伽<br>金石非經熔煉不成金，亦如乳無搖和不成酥，<br>氣脈明點雖然不離身，若無口訣幻輪不成事。<br>一切經續稱讚身要點，所有幻輪根本奇妙者，<br>稱為毗盧遮那七法姿，雖有種種當下如道行。<br>足姿金剛跏趺坐之故，下行土氣眾引於中脈，<br>拇指壓於無名指根故，平等風氣眾引於中脈。<br>脊椎無有彎曲正直故，持命水氣眾引於中脈，<br>喉嚨如鉤形微彎曲故，上行火氣眾引於中脈。<br>手膀如鷹翅般展伸故，遍行空氣眾引於中脈，<br>雙眼漸漸視於鼻尖故，微細支氣眾引於中脈。<br>明瞭觀想身體要點者，七法姿亦能成諸多事，<br>徒具八風坐姿安穩及，無有祕密口訣利益微。<br>外之身體具有緊實樣，內心鬆坦正見之定中，<br>氣心合而為一幻輪之，一切內外大界成自在。<br>第一護衛金剛瑜伽乃，金剛跏趺具七法坐姿，<br>具有明觀本尊之要點，各氣間行解姿及抖身。<br>其能消除內外密諸障，修行道上無障礙間斷，<br>第二眾過自解瑜伽乃，具七法姿雙手期剋印。<br>大腿至膝手心貼於身，隨循右脈右耳後上行，<br>經過頂輪降於眉之間，食指壓於右鼻出濁氣。<br>具足轉蓮三次行射收，換左雙手同時如是做，<br>此能濁氣行於諸脈之，內病消除吸引外內精。<br>心情諸根清明除昏舉，亦乃入於三摩定前行，<br>第三三身甘露瑜伽乃，具七法姿漸持柔和氣。<br>各個氣間亦可行解姿，此法成就長壽保韶華，<br>第四觀空虹身瑜伽乃，具七法姿氣心合為一。<br>外身內脈祕密心性彼，各個可行解姿及抖身，<br>其能一切現象成幻相，斷除一切善惡希疑念。<br>第五無死寶瓶瑜伽乃，具七法姿具氣四德之，<br>右邊陽氣左邊壓陰氣，中央中性氣壓射如箭。<br>小瓶中瓶大瓶氣依次，依序熟悉前面再習後，<br>大約六大寶瓶量解姿，其能十種氣漸次攝引。<br>明瞭壽量成就無死丹，此需口訣乃為教要點，<br>第六猛火樂暖瑜伽乃，具七法姿本明氣置臍。<br>點燃具有四德猛烈火，根本傳承上師融亥母，<br>一切使融大樂明點三，練習期間各個一氣間。<br>圓滿三種解姿行抖身，雖是行此但依自經驗，<br>此能消除一切風寒疾，增長智慧生起無別樂。<br>如是氣脈明點基礎要，六種瑜伽生起脈之力，<br>衰滅恢復善種更生起，成為深道圓次之根器。<br>此圓滿次第之殊勝。<br>密集金剛閻魔金剛等，眾多父續主要修練氣，<br>五氣清淨生起明空智，其法口訣為甘露瑜伽。<br>淨與橛勝樂喜金剛等，眾多母續主要修明點，<br>融樂之力生起歡喜智，其法口訣為猛火瑜伽。<br>大幻密藏時輪金剛等，無二續中氣脈明點合，<br>現前遠離不生滅住智，其亦圓滿猛烈火瑜伽。<br>此故無上密乘諸圓次，皆攝受此傳承口訣內，<br>若以三界珍寶一時聚，莫可量比此深法毫分，<br>具足善緣行者之掌中，乃為自生財分當了知。<br>五支幻輪<br>第一生暖燃火轉輪乃，舉金剛置膝具六法姿，<br>左右二方腹各轉三次，前後一置解姿小降三。<br>其能消除腸與胃之疾，隱藏諸脈皆能顯現出，<br>第二大力氣風轉輪乃，舉金剛置膝具六法姿。<br>腰部右轉三次左如是，右左前後一置三小降，<br>其能恢復脈裂及發炎，消除氣風所出諸疾病。<br>第三解脫妙法轉輪乃，具七法姿肩胛舉上提，<br>頭部緩緩左右各轉三，前低後昂三次左右置。<br>小降三次直觀真實義，其能消除眼鼻枕骨穴，<br>第四除苦安樂轉輪乃，舉金剛印右前左後置。<br>具六法姿轉蓮擊腋三，如是左手前及右手後，<br>轉蓮擊腋連續行三次，雙手逃追小涮行三次。<br>三次小降保認正知見，其能消除心血中風病，<br>第五無垢蓮花轉輪乃，具六法姿持氣之觀要。<br>雙手立生轉蓮拍掌搓，食指中指伸出金剛拳，<br>右手前方左手於後方，額上之髮梳伏計三次。<br>反之左手後雙手搓臉，解姿小降三次護本性，<br>其能涎病膽病及病蟲，頭與上身之病能消除。<br>第六極迅打雷轉輪乃，短盤具足六法姿坐姿，<br>具足擊腋雙手立即伸，擊肩左手置於右肩上。<br>搓揉至指尖回拍腋窩，一次解姿小降行三次，<br>消除手臂脈與關節病。<br>第七瑜伽歡喜轉輪乃，左腳單盤右腳踏於地，<br>右手於上環抱右膝腿，具足小蹦右腿伸前方。<br>雙手分摸大腿至腳底，左手置於自方膝蓋上，<br>右手置放腿邊擊三次，右手置於自方膝蓋上。<br>左手食指拇指之手印，摳住於右腳之無名指，<br>置於左邊大腿同一時，上身扭轉右方出濁氣。<br>復次左方如是練一次，小降三次保認本基界，<br>其能總體上下身體病，消除一切幻輪諸障礙。<br>第八使現光明轉輪乃，舉金剛置膝具五法姿，<br>具足小蹦即刻而直起，握拳前方後方轉三次。<br>轉蓮拍掌搓掌各三次，梳髮搓臉握拳擊肩膀，<br>各個三次解姿三立降，中降小降各三哈抖三。<br>如是五支幻輪總計八，真實實行能除身之病，<br>身生暖火心中增安樂，無分別智生起於心緒。<br>正行幻輪<br>正行降滿逆遍除障等，雖有眾多首為猛烈火，<br>明點幻輪必需達擊要，練法如同三身甘露輪。<br>跳降幻輪<br>真實實行降滿逆反之，三種觀想是為道之根，<br>第一具力大鵬幻輪乃，舉金剛置膝具六法姿。<br>解姿連同小蹦伸雙足，雙手交叉擦腿至趾端，<br>握拳腿邊擊三回降一，兩次小降單降一次後，<br>握拳置於膝上出濁氣，其有各處明點能動搖。<br>及與苦轉安樂之利益<br>脈引五支幻輪中二逆轉幻輪<br>第二大象飲水幻輪乃，舉金剛置膝具六法姿，<br>解姿連同小蹦即立起，雙膝手肘額首降於地。<br>交指置枕骨發三峉聲，中降三次出濁氣無餘，<br>第三母虎吼聲幻輪乃，舉金剛置膝具六法姿。<br>解姿連同小蹦即立起，雙手拇中指持足無名，<br>哈喝三誦中降行三次，握拳置膝濁氣出左方，<br>如是兩種逆回幻輪力，斷輪迴流體軀耀丰澤。<br>逆展幻輪<br>第四狐狸嗅香幻輪乃，左足於下具足五法姿，<br>解姿連同小蹦即立起，中指相接手置枕骨穴。<br>膝肘觸地額頭往上昂，嗅息三次中降行三次，<br>握拳置於膝上出濁氣，其能明點逆遍生大樂。<br>收展幻輪<br>第五綿羊抖身幻輪乃，舉金剛置膝具六法姿，<br>解姿連同小蹦即立起，四掌著地頭往左右方。<br>轉動三次俯仰亦如是，右方足踝擊臀部三次，<br>左方如之右手握拳頭，擊肩三次左方亦如是。<br>抖身三次中降如其數，握拳置於膝上出濁氣，<br>其能消除明點血塞瘤，大樂遍滿身各處之故，<br>無法消受之樂由內燃。<br>六引遍幻輪<br>第六恆住法輪幻輪乃，舉金剛置膝具六法姿，<br>雙手解姿拇指貼於耳，食指以及中指矇住眼。<br>無名指壓鼻小指置口，頭部左右兩方轉三次，<br>俯仰三次中降行三次，其能明點遍滿於頭部。<br>第七獅子雄威幻輪乃，舉金剛置膝具六法姿，<br>解姿連同小蹦即立起，足掌相合諸指定於地。<br>膝蓋外張拳頭置其內，昂首向左右及中三方，<br>外持各三抖身亦三次，猛降三次濁氣無餘出。<br>其能明點逆上增大樂，一切脈處遍滿大樂興，<br>第八青龍盤旋幻輪乃，舉金剛置膝具六法姿。<br>解姿小蹦雙足向前伸，雙手握拳依置髖骨墊，<br>左右二足伸屈各三次，小降三次濁氣出於外。<br>其能明點遍散於肢體，消降血壓循環不良疾，<br>第九駿馬抖身幻輪乃，舉金剛置膝具六法姿。<br>解姿連同小蹦行仰躺，四肢伸射背降行三次，<br>發筋抖脈中降行三次，其能明點散膚除風瘤。<br>第十駿馬仰翻幻輪乃，舉金剛置膝具六法姿，<br>解姿連同小蹦行仰躺，發出哈聲四肢伸射空。<br>發出喝聲右方行翻滾，左方如是總數翻三次，<br>中降三次濁氣無餘出，其能明點遍散毛細孔，<br>消除精華成過失之疾。<br>十一獅子遊戲幻輪乃，舉金剛置膝具六法姿，<br>連同解姿向上即立起，金剛總持手印置心間。<br>足掌相合諸指定於地，膝蓋外張上身上挺直，<br>昂首左右中間等三方，聞嗅外持各三抖身三。<br>結作金剛雷降除濁氣，此稱逆遍一切幻輪之，<br>精要為諸成就者讚頌。<br>十二普賢歡喜幻輪乃，具七法姿頭右及左方，<br>輪轉三次兩方置一次，手肘用力握拳擊乳上。<br>轉蓮金剛舉置於膝上，左右轉腰三次中降三，<br>立起而後足跟擊臀三，握拳擊於乳房處三次。<br>立降一次中降行二次，一切幻輪部分於此圓，<br>降滿逆遍諸業以此為，若具禪定成諸病對治。<br>尤其具足無緣見把握，滿逆遍等如幻術戲法，<br>隨生手印隨現大妙樂，輪涅無二任運大樂成。<br>正行幻輪十二項力故，十二合時淨於中脈界，<br>各個根本分出一分支，廿四境處勇士空行聚，<br>光明曦軒昇駕於心中，今生圓成空行金剛諭。<br>後行<br>後行起效消除障礙及，吉祥三者攝受道要義，<br>第一熾灼朗日幻輪乃，足左於內小腿相交叉。<br>右手置背兩肘相互勾，擁膝形成金剛總持印，<br>七次大寶瓶後行解姿，漸漸緩出濁氣生火暖。<br>第二清涼明月幻輪乃，雙足蓮姿舉金剛置膝，<br>首部上仰發出三哈聲，其能消除熱病心清明。<br>最終吉祥轉輪幻輪乃，具七法姿解姿法輪印，<br>施印定印施依之手印，觸地印等五方佛手印。<br>向自方行坐墊式三轉，小降中降大降各三次，<br>其表一切時地恆吉祥，表為佛法經續永住世。<br>經驗與成就<br>一切覺受次第總概述，世間及出世間之覺受，<br>現覺空覺粗柔兩生起，任悉無有疑望能解脫。<br>除障起效殊勝之口訣，循補特迦羅根器次第，<br>數類多但醫藥調脈且，祈請上師觀空極殊勝。<br>氣脈練成共通之成就，具足神通神變增證悟，<br>業氣入於中脈界解脫，獲殊勝成就七支和合。<br>雙運口訣<br>極密下門殊勝口訣乃，勇士空行觀察召與淨，<br>密棍金剛飲水之口訣，蓮花吹螺能力必實現。<br>復次合意僻靜森林中，能守誓句伴友同一起，<br>四種歡喜覺受力修故，六月或三年內獲大樂。<br>此法傳授根器之徒弟，上師視為真實等覺佛，<br>縱遇命難不捨誓句者，惟一一二耳傳故不言。<br>日修瑜伽<br>如是廣明口訣已宣說，恆時修行要點集合理，<br>淩晨氣心平和之時期，前行祈師皈依及發心。<br>此後自身境處空性中，剎那天地法源空行剎，<br>中央紅矣日月屍體上，阿成紅色亥母忿怒裝。<br>右鉞左顱雙足舞步姿，身內空性如紅布帳棚，<br>中間殊勝中脈如晶瓶，具足四相上部於梵穴。<br>下端臍下皺處入中脈，中脈下端獨味脈之根，<br>明觀四輪三脈會合處，臍下日上根本上師尊。<br>無別熾紅讓字上定意，祈請上師具要出九氣，<br>柔氣暫息復次欲吸時，具要微細吸氣住臍下。<br>由經獨及味脈入中脈，讓字起火遍滿臍脈輪，<br>依此練習滿於密心輪，偶爾要行腰轉及腹轉。<br>無能住氣之時目漸合，心住臍下濁氣無餘出，<br>如是吸住壓散出四相，言之住氣無能止之時。<br>觀想毛細孔如網眼般，諸氣藍色漸除行抖身，<br>所出住氣適中為要點，其時亦行五支幻輪乃。<br>宣說解開脈輪故必行，熟練此後智慧猛烈火，<br>臍間阿夏火之猛火力，月亮倒立杭字以暖融。<br>降下甘露與火逃追後，心間融合漸增菩提心，<br>充滿喉心臍與密輪處，觀要辨認四喜定順流。<br>復次逆回心轉頂輪處，和合六法力引喜逆回，<br>四輪享受畜生四變力，送於梵地獅戲法源之。<br>散遍握拳擊於脈要點，復次樂空廣大法性中，<br>無緣離詮界安置應讚，方便道根增長行為要。<br>如此共與不共之行為，根達普賢禁行勝利行，<br>眾生三根器依眾靜行(部行)，總說外為依如梵行戒。<br>內以發心慈悲心為要，密為甚深密乘方便行，<br>一切無有狂妄粗魯行，遠離名聲自私貪圖念。<br>不逸依止佛經同事行，謂曰耶瑪果位大名者，<br>非為前無他處所生也，凡俗客塵之障自清淨。<br>明見本明離障稱果位，幻相覺期增長身與智，<br>此能稱為覺增之佛陀，精進行者實踐生圓後。<br>跨越疑望險道乃果位，如是見修行果總攝說，<br>見如大海之內星辰般，離棄執著算計中安置。<br>修如廣大虛空之界般，離棄偏見心造中安置，<br>行如幻術士之戲法般，離貪自然悠閒中安置。<br>果如崇山崔巍嵯峨般，無有增益企望希憂置，<br>一切密乘法根為加持，加持依師信心是為要。<br>大乘基為利他心為要，法之命根誓句戒為要，<br>教法根二資雙運為要，法之道友精進行為要。<br>哀哉總是如法而修行，不守誓句欲證佛位乃，<br>如欲白螺然頻磨烏炭，不重因果欲得菩提乃。<br>如欲奶油然擠壓沙粒，上師不悅所作諸善業，<br>如欲苗芽然播焦灰種，此故催請恆時敬上師。<br>如是圓滿次第附說言，思欲實踐者增證悟故，<br>佛經及成就者之言教，尤其根本上師之口訣。<br>依為自身經驗而言說，為以愚假智者今世法，<br>毀謗讚頌名聲非為此，如此宣之理因所依經。<br>口訣甚多詞句廣繁者，理應宣說無宣為守密，<br>總說無有實修乾枯語，千雷同響至死成空談。<br>若能實踐佛語片言足，佛之法語如同大海般，<br>愚者吾之言語何所用，但依降魔金剛明界藏。<br>殊勝導師蓮花大樂洲，三位取藏大師口訣根，<br>樂密時輪密義圓於此，鄔金王臣當巴德夏及。<br>先祖噶陀傳承上師之，隱密實修之法此口訣，<br>遠傳經續大海亦為此，此故往赴雪域遊天竺。<br>抵臨鄔金空行洲當中，圓次口訣無有較此勝，<br>此為些分如法行子外，惟當揚法其命母誓曜。<br>若佐班雜薩瑪雅當雜，恆時助伴如是修行者，<br>保密如是修行之行者，兇猛護法眾會恆守護，<br>順緣成就夏海般增長，今生獲得解脫金剛喻。<br>迴向<br>如此撰述善力諸眾生，妙乘之善知識能攝受，<br>二次證悟等如上旬月，願證速得二利任運佛。<br>此乃由世世生生不離同度眾生之祈願成就者寧氏瑜伽母虛空智慧明燈勸請而書〈忠告心血精華〉內猛火部分，吾數法子屢勸給予詳解，寧氏瑜伽母與聖者巴日哇大師等乃供養黑色駿馬、表方慧之金剛鈴杵、金銀等物質與童女宴會等修福之供，且立誓長期修此圓滿次第，復與如法修行七僧立誓修持十萬遍吉祥金剛薩埵百字明，吾欣慰焉。密咒比丘持明壽自在寶事業度眾力於聖者羅日之修行處強南屋日，上旬初喜日撰。願普眾生起樂空離戲之智矣。</p>",
    "status": "published",
    "meta": { "words": "N/A", "pages": "N/A", "readTime": "N/A", "preview": "N/A" },
     "availableLanguages": ["bo", "zh", "en"],
    "createdAt": "2025-06-15T23:49:00Z",
    "updatedAt": "2025-06-15T23:49:00Z"
  }
]