[
  {
    "id": "history_001",
    "tibetanTitle": "༄༅། །རྒྱལ་བའི་བསྟན་པ་རིན་པོ་ཆེ་བྱང་ཕྱོགས་སུ་འབྱུང་བའི་རྩ་ལག་བོད་རྗེ་ལྷ་བཙད་པོའི་གདུང་རབས་ཚིག་ཉུང་དོན་གསལ་ཡིད་ཀྱི་མེ་ལོང་ཞེས་བྱ་བ་བཞུགས་སོ། །",
    "chineseTitle": "佛教珍寶於北方產生之本枝藏王哈贊普朝代片言彰旨意之明鏡",
    "author": "才旺諾布",
    "category": "歷史",
    "tags": ["歷史","朝代","藏王"],
    "ContentTibetan": "<p class=\"tibetan-text\">༈ ཨོཾ་སྭ་སྟི། རྒྱལ་བའི་བསྟན་པ་རིན་པོ་ཆེ་བྱང་ཕྱོགས་སུ་འབྱུང་བའི་རྩ་ལག བོད་རྗེ་ལྷ་བཙན་པོའི་(གདུང་)རབས་ཚིག་ཉུང་དོན་གསལ་ཡིད་ཀྱི་མེ་ལོང་ཞེས་བྱ་བ། ན་མོ་ལོ་ཀེ་ཤྭ་རཱ་ཡ། ཨོཾ་མ་ཎི་པདྨེ་ཧཱུྃ། དེ་ཡང་རི་ཁ་བ་ཅན་གྱི་ལྗོངས་མི་ཡི་བདག་པོ་འཕགས་མཆོག་སྤྲུལ་པའི་སྐུ་འཇིག་རྟེན་དབང་ཕྱུག་སྲོང་བཙན་སྒམ་པོ་མེ་གླང་ལོར་སྐུ་བལྟམས། དགུ་ལོ་བཅུ་གསུམ་པ་ས་གླང་ལ་རྒྱལ་སྲིད་བཟུང་། དགུ་བཅུ་རྩ་བཞི་ལྕགས་ཕོ་ཁྱི་ཡི་ལོ་ལ་སྐུ་འོད་ཀྱི་གོང་བུར་གྱུར་ནས་འཕགས་པའི་ཐུགས་ཀར་ཐིམ། བར་དེར་ལྷ་སྲས་གུང་སྲོང་བཅུ་བདུན་མཐར་ཁྲིར་བཀོད་དེ་དགུང་ལོ་བཅུ་དགུ་བཞེས་ནས་སྐུ་ཞི་བར་གཤེགས་ཞེས་གྲགས་པས། ལོ་ངོ་གསུམ་རྒྱལ་སྲིད་མཛད་ཀྱང་སྲས་སྐུ་ན་ཕྲ་བས་རྒྱལ་སྲིད་རགས་པ་ཡབ་ནས་བཞེས་པ་དང་། དེ་ནས་སྲས་གཤེགས་པས་སླར་རྒྱལ་སྲིད་བསྐྱར་ནས་མཛད་ཅིང་། དེ་ལྟར་དགུ་བཅུ་རྩ་བཞི་ལ་ལོ་བཅུ་གཉིས་ཀྱིས་འཕྲིས་ཤིང་སྲས་ཀྱིས་རྒྱལ་སྲིད་སྐྱོང་བའི་ལོ་ཧྲིལ་པོ་གཉིས་མ་བསྒྲང་ན་སྲིད་དངོས་ལ་ལོ་བརྒྱད་ཅུ་དང་། སྲས་ཀྱི་དེ་ཡང་ལོ་ཁོངས་སུ་བརྩིས་ན་བརྒྱད་ཅུ་རྩ་གཉིས་ཏེ། བཀའ་ཆེམས་ལས། བརྒྱད་ཅུ་རྩ་གཉིས་རྒྱལ་པོའི་ལོ། །ལོན་ནས་རྒྱལ་པོ་འགྲོ་གསུངས་ཏེ། །ཞེས་པ་ཡང་དེ་ལ་དགོངས་ཤིང་། འཇམ་དཔལ་རྩ་རྒྱུད་ནས་རྒྱལ་སྲིད་ལོ་བརྒྱད་ཅུ་མཛད་པར་ལུང་བསྟན་པ་དང་ཡང་འགྲིག ཕྱིས་ཀྱི་མཁས་པ་ཁ་ཅིག་གིས་ས་གླང་ལ་འཁྲུངས་ཞེས་གསུངས་ཏེ། དེ་ནི་ས་གླང་ཡིན་པའི་སྒྲུབ་བྱེད་ལྕགས་ཁྱི་ལ་གཤེགས་པར་བྱེད་ན་ལོ་རྒྱུས་དེ་རིགས་ཐམས་ཅད་མཐུན་པར་མེ་གླང་ལ་འཁྲུངས་ཞེས་གསུངས་པས་དེ་གཉིས་གཅིག་གིས་གཅིག་ག་ལ་འགོག་ནུས། ཆོས་རྗེ་གཡའ་བཟང་པའི་གསུང་རྒྱུན་ལ་བྱེད་ན། དེབ་སྔོན་དུ་དེ་ཡི་ལུང་དྲངས་པ། ང་ཉིད་ལྔ་བརྒྱ་ཐ་མའི་ཚེ། །བཞི་བརྒྱ་ཉི་ཤུ་རྩ་ལྔ་ན། །ལྷོ་ཕྱོགས་གཡོར་པོའི་རྒྱལ་ཁམས་སུ། །གླང་ཆེན་གསེར་གྱི་ལོ་ལ་འཁྲུངས། །མཚན་ནི་དྷརྨ་པྲ་ཎི་ཞེས། །རྒྱལ་པོ་འདི་སྐད་གསུངས་ཞེས་པར། །དམ་པའི་ཆོས་རྣམས་འཆད་པར་བྱེད། །ཅེས་གསུངས་པ་དེ་ཡང་ཞལ་དུ་འདོན་ཞེས་བྲིས་མོད། དེ་ནི་རྒྱལ་པོ་ལྕགས་གླང་ལ་གཤེགས་ནས་བཞི་བརྒྱ་ཉི་ཤུ་རྩ་ལྔར་ཤིང་སྟག་གམ་ཤིང་ཡོས་གང་རིགས་འཆར་བར་ངེས་པས་གཡའ་བཟང་བའི་འཁྲུངས་ལོ་ས་གླང་དང་བསྒྲིགས་མི་ནུས་ཏེ་མངོན་སུམ་ཉིད་དུ་འགལ་ལོ། །གཡའ་བཟང་ཆོས་རྗེའི་ལུང་བསྟན་བཀའ་ཆེམས་ཐོ་ལིང་མར་ཡོད་པ་ནི། དེབ་སྔོན་དུ་བྲིས་པ་དང་ལོ་ཚིགས་མི་མཐུན་ཏེ། འདི་སྐད་དུ། གསོན་ཅིག་བློན་པོ་འགར་གྱིས་སྣ་དྲངས་ནས་བློན་བདུན། །བདག་ནི་ལྕགས་ཕོ་ཁྱི་ཡི་ལོ་ལ་འདས་གྱུར་ནས། །གཅིག་ནས་གཉིས་སུ་བསྒྲངས་པའི་ལྔ་བརྒྱ་ཉི་ཤུ་ན། །གཡོར་པོའི་རྒྱལ་ཁམས་གངས་ཀྱི་རི་རྒྱུད་དུ། །དགེ་སློང་དྷརྨ་པྲ་ཎི་ཞེས་བྱ་བར། །གླང་ཆེན་གསེར་གྱི་ལོ་ལ་སྐུ་འཁྲུངས་ནས། །ཁྱོད་ཀྱིས་སྣ་དྲངས་ནང་བློན་བདུན་པོ་རྣམས། །སྲས་སུ་ཁྱོད་འཁྲུངས་གཞན་ཡང་མཇལ་བར་གྱུར། །ཞེས་གླེགས་བམ་རྙིང་ངེས་རྣམས་སུ་ཚིག་ཟུར་འདྲ་མིན་འདུག་ཀྱང་དངོས་དོན་ལོ་ཚིགས་གཅིག་ཏུ་བྱུང་བས། ལྔ་བརྒྱ་ཉི་ཤུ་ནི་ལྕགས་ཁྱི་ནས་ས་གླང་དང་འགྲིག་པར་མ་ཟད། བདག་གིས་འདིར་བཀོད་ལོ་གྲངས་དང་ཆེད་དུ་མ་བསྒྲིགས་བཞིན་རང་བཞིན་གྱིས་ཤིན་ཏུ་འགྲིགས་པས་ཡ་མཚན་ནོ། །དེབ་སྔོན་སོགས་ཁ་ཅིག་གི་འདོད་པ་ལྟར་ན་ལོ་དྲུག་ཅུ་སྐོར་གཅིག་འཕྲིས་དགོས་པར་གསལ་ལོ། །གང་ལྟར་གཡའ་བཟང་བས་ས་གླང་ལ་འཁྲུངས་རྒྱུར་གསུངས་པ་ལས། ཆོས་རྒྱལ་ས་གླང་ལ་འཁྲུངས་པའི་སྒྲུབ་བྱེད་མེད་ལ་འཇམ་དཔལ་རྩ་རྒྱུད་ཀྱིས་ལུང་བསྟན་པ་ནི། རྒྱལ་སྲིད་མཛད་པའི་ཚད་ལས་སྐུ་ཚེའི་ཚད་མ་ཡིན་པ། ལོ་ནི་བརྒྱད་ཅུ་རྒྱལ་སྲིད་བྱས། །ཞེས་ཚིག་མངོན་སུམ་པས་གསལ་བ་སྟེ། དེས་ན་འཁྲུངས་ལོ་དང་རྒྱལ་སྲིད་བཟུང་བའི་ལོ་ཕྱེད་པ་གལ་ཆེ་ལ། འདིར་བཤད་པ་ནི་སྔར་གྱི་ཡིག་རྙིང་ཁུངས་ལྡན་མཐའ་དག་པར་མེ་གླང་ལ་འཁྲུངས་ཞེས་མགྲིན་གཅིག་ཏུ་ཡོད་པ་རང་བཟོས་རྟོགས་མི་དགོས་ཤིང་། ལྕགས་ཁྱི་ལ་གཤེགས་པ་བཅས་འཐད་ཅིང་རིག་པ་ཡིད་ཆེས་པའི་གནས་སོ། །དེ་ལྟར་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་བོད་ཀྱི་རྒྱལ་པོར་སྤྲུལ་པ་དེ་ཉིད་གདུང་རབས་ཇི་སྙེད་བཅས་འཇམ་དཔལ་རྩ་རྒྱུད་དུ་འདི་སྐད་ཅེས་ལུང་བསྟན་ཏེ། དེ་བཞིན་གཤེགས་པའི་བསྟན་འདི་ལ། །རྣམ་པ་སྣ་ཚོགས་བྱ་བ་བྱེད། །བྱང་གི་ཕྱོགས་ལ་བརྟེན་ནས་ནི། །དེ་ཡི་ཚེ་ན་འབྱུང་བར་འགྱུར། །ལྷ་ལྡན་ཡུལ་ཞེས་བྱ་བ་ཡི། །གངས་ཅན་རི་ཡི་ནང་གནས་པའི། །རྒྱལ་པོ་མི་ཡི་ལྷ་ཞེས་པ། །ལི་ཙ་བྱི་རྣམས་རིགས་སུ་འཁྲུངས། །དེ་ཡང་སྔགས་ཀྱི་དོན་སྒྲུབ་སྟེ། །ལོངས་སྤྱོད་ཚེ་དང་ལྡན་པར་གྱུར། །རིག་པ་ལོངས་སྤྱོད་ལྡན་ཞེས་བྱ། །མི་ཡི་བདག་པོ་དེ་ཡང་གྲུབ། །ལོ་ནི་བརྒྱད་ཅུར་རྒྱལ་སྲིད་བྱས། །དེས་ནི་རྐུན་མ་རྣམ་པར་སྤངས། །རྒྱལ་པོ་དེས་ནི་སྲོག་སྤངས་ནས། །དེ་ཡང་སྔགས་ནི་མྱུར་འགྲུབ་སྟེ། །ཞི་དང་རྒྱས་པ་བསིལ་བྱེད་པའོ། །འཇིག་རྟེན་སྒྲོལ་མ་ཞེས་གྲགས་དང་། །ལྷ་མོ་གོས་དཀར་མོ་དང་ནི། །དཀར་མོ་ཆེན་མོ་གཞན་ཕན་བཙོན་(བརྩོན།) རྟག་ཏུ་ཡིད་ནི་མི་སྐྱོ་བའོ། །དེ་ལ་སོགས་པ་གསུངས་པ་ཡི། །དེ་བཞིན་རྒྱལ་པོ་མང་པོ་ནི། །རྣམ་པ་དུ་མ་མང་པོ་དག །ཁ་དོག་སྣ་ཚོགས་སྣ་ཚོགས་གཟུགས། །ཁ་བ་ཅན་གནས་ཀླ་ཀློའི་རྒྱལ། །དེ་ཡང་སྟོན་པ་མཆོད་བྱེད་པའོ། །ཁྱུ་མཆོག་ཁྱུ་མཆོག་བཟང་པོ་དང་། །ས་འོད་དེ་བཞིན་ས་འོད་བཟང་། །དེ་བཞིན་ཕ་རོལ་གནོན་ཉིད་དང་། །རྐང་པའི་འགྲོས་ཤེས་བསྟན་པ་ཡིན། །ས་སྲུང་དང་ནི་བེའུ་དང་། །འོད་ལྡན་ཉིད་ནི་ཕྱི་མ་ཡིན། །ཐ་མར་འཆར་རྒྱལ་ངང་ཚུལ་ཏེ། །ཀླ་ཀློའི་རྣམ་པ་སྣ་ཚོགས་ཡིན། །དེ་འོག་ལུགས་ནི་རྣམ་ཞིག་ཅིང་། །ཕྱི་རིལ་སྐྱེ་དགུའི་ཉེ་བར་སྤྱོད། །ཅེས་ལུང་བསྟན་པ་ཡིན་ཏེ། དེ་ལ་བོད་ཀྱི་མཁས་པ་དུ་མ་མཐུན་པ་ཉིད་དང་། འགོས་ལོ་གཞོན་ནུ་དཔལ་བས་འདི་སྐད་གསུངས་ཏེ། བྱང་གི་ཕྱོགས་དང་ཁ་བ་ཅན་ནི་གྲགས་ཆེ་ཞིང་། ལྷ་ལྡན་ནི་ལྷ་སའོ། །ལོ་བརྒྱད་ཅུ་རྒྱལ་སྲིད་བྱེད་པ་ནི་ལོ་བརྒྱད་ཅུ་རྩ་གཉིས་བཞུགས་ཤིང་བར་དུ་གུང་སྲོང་གུང་བཙན་གྱིས་ཀྱང་རྒྱལ་སྲིད་ཅུང་ཟད་མཛད་པའོ། །སྒྲོལ་མ་དང་གོས་དཀར་མོ་དང་དཀར་མོ་ཆེན་མོ་ནི་བཙུན་མོའི་མཆོག་གསུམ་སྟེ། ཀོང་ཇོ་དང་བལ་མོ་བཟའ་དང་འབྲིང་བཟའ་མ་ཐོད་དཀར་རོ། །ལི་ཙ་བྱིའི་རིགས་སུ་བྱུང་བ་ནི། ཡངས་པ་ཅན་པའི་རྒྱུད་ཡིན་པའོ། །ཀླ་ཀློའི་རྒྱལ་པོ་ནི་ནུབ་ཕྱོགས་ཏ་ཞིག་(ཟིག)གི་ཡུལ་ལ་དབང་བྱེད་པའོ། །དེ་བཞིན་དུ་རྒྱལ་པོ་མང་པོ་ནི་འོག་ནས་འབྱུང་བ་རྣམས་ཏེ། ཁྱུ་མཆོག་ནི་མང་སྲོང་ངོ་། །ཁྱུ་མཆོག་བཟང་ནི་ཀླུང་ནམ་མོ། ས་འོད་ནི་མེས་ཨག་ཚོམ་མོ། །ས་འོད་བཟང་ནི་ཁྲི་སྲོང་ལྡེའུ་བཙན་ནོ། །ཕ་རོལ་གནོན་ནི་མུ་ནེ་བཙན་པོའོ། །རྐང་པའི་འགྲོས་ནི་ཁྲི་ལྡེ་སྲོང་བཙན་ནོ། །ས་སྲུང་ནི་རལ་པ་ཅན་ནོ། །བེའུ་ནི་གླང་དར་མའོ། །འོད་ལྡན་ནི་འོད་སྲུང་སྟེ། ལྡན་པ་དང་སྲུང་བ་ལ་ཨ་བ་ཏི་ཟེར་བའི་ཕྱིར་རོ། །ཐ་མ་འཆར་རྒྱལ་ངང་ཚུལ་ནི། ཉི་མ་འཆར་བའི་ཕྱོགས་ནས་བོད་ལ་དབང་བྱེད་པའི་ཧོར་རྒྱལ་པོ་ཡིན་ཞེས་འགའ་ཞིག་འདོད་ལ། ཤར་ཁ་ཞེས་པའི་ལུང་འདིར་རྒྱལ་པོ་དཔལ་འཁོར་བཙན་ཡིན་ཡང་རུང་ངོ་། །དེ་ནས་བོད་སྤྱི་ལ་དབང་བྱེད་པའི་རྒྱལ་པོ་མེད་པས་ལུགས་རྣམ་པར་ཞིག་གོ །ཞེས་སྨྲས་པ་གཞན་ནི་དེ་ལྟར་མི་འཐད་པ་མེད་ཀྱང་བཙུན་མོའི་སྐབས་རྒྱ་བལ་བཟའ་དང་མང་(མོང་)བཟའ་ཁྲི་ལྕམ་བསྒྲངས་དགོས་ལ། གུང་བཙན་གྱི་རྒྱལ་སྲིད་ལོ་གཉིས་སྲོང་བཙན་གྱི་རྒྱལ་སྲིད་ལོ་ཁོངས་སུ་མ་བསྡུས་པ་རུང་ཡང་སྲོང་བཙན་གྱིས་རྒྱལ་སྲིད་མཛད་པའི་བརྒྱད་ཅུ་སྐུ་ཚེའི་ཚད་དུ་བྱས་པ་ནི་མི་ལེགས་པ་དང་། གོང་དུ་གུང་སྲོང་གི་ལུང་བསྟན་ཧོར་ཁོངས་སུ་བཞག་ནས་ཕ་རོལ་གནོན་མུ་ནེ་བཙན་པོར་འཛིན་པ་ཡང་མི་འཐད་དེ། ཕ་རོལ་གནོན་ཁྲི་སྲོང་ལྡེ་བཙན་དང་། རྐང་པའི་འགྲོས་ནི་ཁྲི་སྲོང་གི་སྲས་རྣམས་ཀྱིས་རྒྱལ་སྲིད་རིམ་པས་མཛད་པ་ལ་དགོངས་པར་བདག་གི་རྣམ་རྟོག་སྟེ། དོན་དུ་ཡང་དེར་ངེས་ལ། འཆར་རྒྱལ་ངོས་འཛིན་ཡང་དཔྱད་བྱར་སྣང་ངོ་། །དེ་ལྟར་འཇིག་རྟེན་དབང་ཕྱུག་བོད་རྗེའི་མི་ཡི་ལྷ་སྲོང་བཙན་སྒམ་པོའི་ཞབས་ལྕགས་ཁྱི་ལ་སྤྲུལ་པ་བསྡུས་པའི་སྐབས་མང་སྲོང་ས་ཁྱི་ལོ་པ་བཅུ་གསུམ་བཞེས་ཤིང་། དེ་ནས་རྒྱལ་སྲིད་ལོ་ཉེར་དྲུག་བཟུང་། མེ་བྱི་ལ་གཤེགས། ཡབ་གཤེགས་ནས་ཞག་བདུན་ལོན་པ་ན་སྲས་འདུས་སྲོང་མང་པོ་རྗེ་བལྟམས་ཞེས་ལོ་རྒྱུས་མང་ཞིག་ཏུ་འབྱུང་ཡང་། ཐང་གི་ཡིག་ཚང་སོགས་ཁ་ཅིག་ཏུ་མེས་གཤེགས་པའི་ལྕགས་ཁྱི་ནས་ལོ་སུམ་ཅུ་བར་རྒྱལ་སྲིད་མཛད་ནས་ས་ཡོས་ལོར་གཤེགས། ལོ་དེ་ལ་མང་སྲོང་ཁྲིར་འཁོད་སྨྲས་པ་འཐད་པར་སེམས་ལ། འདུས་སྲོང་འཁྲུངས་ལོ་བྱི་བ་ཡིན་ཞེས་གཏན་ཚིགས་ཕལ་ཆེར་འགྲིགས་པས་དེ་ཚེ་དགུང་ལོ་བཞི་ལོན་པའི་སྐབས་སུ་ཞེས་སོ། །འདུས་སྲོང་མང་པོ་རྗེས་རྒྱལ་སྲིད་ལོ་སོ་བརྒྱད་མཛད་པའི་འབྲུག་ལོའི་དཔྱིད་སྲས་ཁྲི་ལྡེ་གཙུག་བརྟན་བལྟམས། དགུན་དེར་ཡབ་གཤེགས་ནས་ལོ་ཕྱི་མར་ཁྲི་ལྡེ་གཙུག་བརྟན་རྒྱལ་པོར་མངའ་གསོལ་ཟེར་བ་ཡི་གེ་མང་བས་དེ་ཚེ་མེས་ཀྱི་དགུང་རྟ་(རྟགས་)མེ་འབྲུག་ཏུ་སོང་། དེས་རྒྱལ་སྲིད་ལོ་དོན་བཞི་བྱས་པ་དང་། རེ་བརྒྱད་དང་རེ་གསུམ་དང་ང་ལྔ་དང་ང་གཅིག་བྱས་པ་སོགས་དུ་མ་མཐོང་ཞིང་མང་(པོ་)ཞིག་ཡབ་གཤེགས་སྐབས་སུ་སྲས་ཁྲི་སྲོང་ལྡེའུ་བཙན་དགུང་ལོ་བཅུ་གསུམ་ལོན་པར་འདོད་པ་ཐང་ཡིག་སོགས་དང་མཐུན་རུང་། རྒྱལ་རབས་ཁ་ཅིག་ཏུ་ཡབ་གཤེགས་ནས་སྲས་ལོ་བདུན་པའམ་བརྒྱད་པར་ཁྲི་ལ་འཁོད་ཅེས་བྱུང་བ་བློན་པོ་གདུག་པ་རྣམས་ཀྱིས་ཁྲིམས་བུ་ཆུང་བཅའ་ཚུལ་ལ་དཔག་(ན་)སྐུ་ཚ་ཕྲ་མོར་ཡབ་གཤེགས་པར་འཐད་པས་༼དེ་ནི་རྒྱལ་ཐབས་ཇི་བཞིན་རང་ཉིད་ཀྱིས་སྐྱོང་ནུས་པའི་དུས་བརྙེས་པའི་ཐོག་མ་ལ་དགོངས་པར་འདོན་(འདོད་)ལ། ཆོས་དབང་ཞབས་ཀྱིས་གནམ་སྐས་ཀྱི་གཏེར་ལོ་ལྔ་བརྒྱ་རྩ་གསུམ་ན་འདོད་པར་གསུངས་པ་ཡང་རྒྱ་དཀར་དུ་རྒྱལ་པོ་ད་ལྟ་བའི་ལོ་བརྩི་བའི་ལོ་ལུགས་སྲོལ་ལྟར་བཅུ་གསུམ་ལྕགས་རྟ་ནས་བསྒྲངས་པ་གསལ་(དཔལ་)གྱི་བསམ་ཡས་ཀྱི་རྨང་བཏིང་བའི་དུས་དེ་ལས་ལོ་བརྒྱད་ཀྱི་འཕྱི་བ་ས་སྟག་ལ་ཡིན་ཟེར་ཡང་གནམ་སྐས་ཀྱི་གཏེར་སྦ་བའི་དུས་རགས་རྩིས་སུ་འགལ་བ་མེད་ལ། འོན་ཀྱང་འདི་ལ་ཞིབ་མོར་བྱ་དགོས་པས་འདིར་བྲི་མི་ལོང་བས་གཞན་དུ་སྤྲོའོ།༽དེའི་ན་མེས་ཀྱིས་མེ་སྦྲུལ་ནས་རྒྱལ་སྲིད་ལོ་རེ་བདུན་བྱས་པའི་ཆུ་ཕག་དགོངས་༼དགུང་༽ལོ་རེ་བརྒྱད་པར་སྐུ་གཤེགས། དེ་ཚེ་སྲས་ཁྲི་སྲོང་ལྡེའུ་བཙན་ས་རྟ་ལོ་པ་དགུང་ལོ་དྲུག་བཞེས་ཤིང་། བདུན་པ་ཤིང་བྱི་ལོར་ཁྲིར་འཁོད་པའོ། །གཞན་ཐང་གི་ཡིག་ཚང་ལྟར་ན་མང་སྲོང་གི་རྒྱལ་སྲིད་ལོ་སུམ་ཅུ། འདུས་སྲོང་གིས་རྒྱལ་སྲིད་ལོ་ཉེར་དྲུག མེས་ཨག་ཚོམ་ཅན་གྱིས་ང་གཅིག་བྱས་པ་ཚལ་པའི་དེབ་དམར་དུ་བྲིས་པས། དེ་ཚེ་སྲོང་བཙན་གཤེགས་པའི་ལྕགས་ཁྱི་ནག་མེས་ཨག་ཚོམ་ཅན་གཤེགས་པའི་ཤིང་ལུག་བར་ལོ་བརྒྱ་དང་ཉག་དྲུག་སོང་། འདིར་བསྟན་ཆུ་ཕག་ལས་ལོ་ཉེར་བརྒྱད་ཀྱི་ཉུང་བ་ཙམ་སྟེ། ལོ་འདི་ལ་ལྷག་ཆད་ཡོད་པར་མངོན་པས་སླར་རྒྱ་ནག་གི་ཡིག་ཚང་ཞིབ་མོ་གཞན་དུ་དཔྱད་ནས་བགྱིད་ཀྱང་འདོད་དོ། །འདིར་ཁྲི་སྲོང་ལྡེའུ་བཙན་དགུང་ལོ་བདུན་ལ་ཁྲིར་བཞུགས། རྒྱལ་སྲིད་ལོ་ཞེ་དགུ་བྱས། ལྔ་བཅུ་ཆུ་གླང་ལོར་ལྷ་སྲས་མུ་ནེ་བཙན་པོར་རྒྱལ་སྲིད་གཏད། རྒྱ་ཡི་ཚིག་ཚང་ལྟར་ན་ཆུ་གླང་དེ་ནས་བརྒྱད་ལོན་པ་རེ་གསུམ་ལྕགས་སྤྲེལ་ལ་གཤེགས་ཞེས་དང་། སྔགས་རྙིང་མའི་ལོ་རྒྱུས་མང་པོ་ཞིག་དང་། བུ་སྟོན་ཞབས་ནས་རེ་དགུ་མེ་སྟག་ལ་སྐུ་གཤེགས་པར་བཞེད་ལ་གཏེར་ལུང་ཁ་ཅིག་པར་རེ་བརྒྱད་གླང་ལོ་འབྲུག་ཟླའི་ཉ་ལ་གཤེགས་པར་གསུངས་ཏེ། དེ་གསུམ་ལས་རེ་ཞིག་ཕྱི་མ་བཟུང་ན་སྲས་ལ་རྒྱལ་སྲིད་གཏད་ནས་ལོ་བཅུ་གཉིས་འདས་ཤིང་། ལོ་ངོ་བཅུ་གསུམ་པ་ཤིང་གླང་ལོར་སྐུ་གཤེགས། འཕགས་པ་མཆོག་སྲོང་བཙན་སྒམ་པོ་ལྕགས་ཁྱི་ལོར་གཤེགས་ནས་ལོ་བརྒྱ་དང་ཉེར་བརྒྱད་འདས་པའི་ས་རྟ་ལོར་ཁྲི་སྲོང་ལྡེའུ་བཙན་འཁྲུངས། དེ་ཤིང་གླང་ལ་གཤེགས་ཚེ་མེས་གཤེགས་ནས་བརྒྱ་གོ་ལྔ་འདས་སོ། །དེ་རྗེས་སྲས་མུ་ནེ་བཙན་པོས་རྒྱལ་སྲིད་ལོ་གཅིག་དང་ཟླ་དགུའམ་བདུན་ནམ་གསུམ་བཟུང་ཞེས་དང་། ཡབ་གཤེགས་ནས་ཟླ་བ་དྲུག་ནས་སྐུ་གཤེགས་ཞེས་ཀྱང་ཡོད་ལ། དེ་ནས་མུ་རུག་བཙད་པོ་རྒྱལ་སྲིད་དུ་བཞུགས་པར་བརྩམས་ཀྱང་མི་རིངས་བར་ཆིབས་ཀྱིས་བརྡབས་ཏེ་གྲོངས་ཞེས་མང་པོ་ཞིག་མཐུན་ཡང་མུ་རུག་གཤེགས་པའི་བང་སོ་རྒྱལ་པོ་ཁྲི་རབས་ཀྱི་གནས་སུ་ཡོད་པས་ཡུན་རིང་ཐུང་ལས་རྒྱལ་སྲིད་ཀྱི་ཁྲིར་བཞུགས་པར་བྱས་པ་ཉིད་འཐད་དོ། །ཡང་ཁ་ཅིག་ནས་མུ་རུག་དང་མུ་ཏིག་གཅིག་པར་འདོད་པ་ནི་མི་ལེགས་སོ། །དེ་ནས་མུ་ཁྲི་དང་མུ་ཏིག་ཐ་དད་ཀྱིས་རྒྱལ་སྲིད་རིམ་པར་བྱས་ཞེས་དང་། མུ་ཁྲི་དང་མུ་ཏིག་གཅིག་པར་འདོད་པའི་ལུགས་གཉིས་ལས་འདོད་པ་ཕྱི་མ་རང་གི་བློ་ལ་རན་པས་སླར་དཔྱད་དགོས་དང་། རེ་ཞིག་འདིར་སྔ་མ་ཉིད་བཞེད་པ་པོ་མང་བས་དེ་དང་ཕྱོགས་མཐུན་དུ་བཀོད་ན་མུ་ཁྲི་བཙན་པོ་ཡབ་གཤེགས་པའི་སྐབས་སུ་དགུང་ལོ་ཉེར་གཉིས་ཏེ། དེ་ནས་ལོ་གསུམ་འདས་པ་རང་ལོ་ཉེར་ལྔ་ས་འབྲུག་ལ་ཁྲིར་བྱོན། དེ་ནས་ལོ་དྲུག་པ་ཆུ་བྱ་ལ་གུ་རུ་རིན་པོ་ཆེ་སྲིན་པོ་འདུལ་དུ་གཤེགས། མུ་ཁྲིས་རྒྱལ་སྲིད་ལོ་བརྒྱད་མཛད་ནས་སོ་གཉིས་ཤིང་ཕག་ལ་གཤེགས། དེའི་ཚེ་གཅུང་ཁྲི་ལྡེ་སྲོང་བཙན་ནམ་མཚན་གྱི་རྣམ་གྲངས་མུ་ཏིག་བཙད་པོ་སྟེ་ཤིང་སྟག་ལོ་པ་དགུང་ལོ་བཞི་པའི་སྐབས་ཉམས་སད་པའི་ཕྱིར་ཁྲིར་བཀོད་ནས་ཡབ་ཀྱིས་ནོར་བུའི་ཅོད་པཎ་བཅིངས་པས་བཀྲ་ཤིས་པའི་ལྟས་མང་དུ་བྱུང་ཞིང་། དབུ་རྒྱན་ནོར་བུའི་ལྗིད་ཀྱིས་དབུ་ཅུང་ཟད་ཡོ་བས་སད་ན་ལེགས་འཇིང་ཡོན་ཏུ་མཚན་གསོལ་བ་དེ་བཅུ་གཉིས་པར་ཡབ་ཁྲི་སྲོང་ལྡེའུ་བཙན་གཤེགས། ཉེར་གཉིས་ལ་གཅེན་གཤེགས་པས་སེང་གེའི་ཁྲིར་མངའ་གསོལ། རྒྱལ་སྲིད་ལོ་ངོ་སྔ་ཕྱི་གཉིས་བསྡོམས་པའི་ཉེར་གཅིག་མཛད། སྐར་ཆུང་རྡོ་རྗེ་དབྱིངས་ཀྱི་གཙུག་ལག་ཁང་བཞེངས། ཞེ་གཉིས་ཤིང་ལུག་ལོར་གཤེགས། མུ་ཁྲི་དང་སད་ན་ལེགས་གཉིས་ཀའི་རྒྱལ་སྲིད་ཀྱི་ལོ་གང་པོ་ནི་ཉེར་བདུན་ཏེ། ཁྲི་སྲོང་ལྡེའུ་བཙན་གཤེགས་ནས་སུམ་ཅུ་ཐམ་པ་འགྲོ། ཁ་ཅིག་མུ་ཏིག་གི་སྲས་ཁྲི་ལྡེ་སྲོང་བཙན་ནམ་སད་ན་ལེགས་ཡིན་པར་སེམས་པ་ནི་སྐར་ཆུང་རྡོ་རིང་གི་ཡི་གེ་དང་དངོས་སུ་འགལ་བས་སད་ན་ལེགས་ཁྲི་སྲོང་ལྡེའུ་བཙན་ཉིད་ཀྱི་སྲས་སུ་ངེས་པར་ཡང་དག་པར་བཟུང་བར་བྱའོ། །ལྷ་སྲས་ཁྲི་རལ་ཡབ་སད་ན་ལེགས་ཀྱི་ཉེར་དགུ་ཆུ་རྟ་ལོར་འཁྲུངས། བཅུ་བཞི་ལ་ཡབ་གཤེགས། ལོར་དེར་ཁྲི་ལ་བཞུགས། སྐྱིད་རྟག་ལོ་དང་པོར་མིང་བཏགས། རྒྱལ་སྲིད་རྒྱ་ནག་གི་ཡིག་ཚང་ལྟར་ན་ལོ་ཉེར་གཉིས་བྱས། མེ་འབྲུག་ལ་གཤེགས་ཟེར་ཡང་བོད་སྤྱི་ཡི་ལྕགས་བྱ་ལ་གཤེགས་པ་མཐུན་པས་དེ་ཚེ་རྒྱལ་སྲིད་ལོ་ཉེར་བདུན་བྱས་པའོ། །ལྷ་རལ་པ་ཅན་འདི་ནི་ཆོས་རྒྱལ་ཁྲི་སྲོང་ལྡེའུ་བཙན་གྱི་སྐྱེ་བར་ཉང་དང་ཆོས་དབང་གཉིས་ཀའི་ལུང་སྐྱེ་འཕྲེང་དུ་གསུངས་ཏེ། དེ་ཡང་ཁྲི་སྲོང་ལྡེའུ་བཙན་སྐུ་གཤེགས་པའི་དེ་མ་ཐག་སུམ་ཅུ་རྩ་གསུམ་དབང་པོ་བརྒྱ་བྱིན་གྱི་སྲས་ལྷ་དབང་འོད་མཐའ་ཞེས་སུ་འཁྲུངས་ནས་མི་ལོ་བཅུ་དྲུག་འདས་པ་ན་སངས་རྒྱས་ཀྱི་བསྟན་པ་རིན་པོ་ཆེར་སྲི་ཞུ་མཆོག་ཏུ་བགྱིས་པའི་སླད། སླར་ཡང་རང་གི་རིགས་སྲས་ཀྱི་རྒྱུད་དུ་བལྟམས་པར་བྱེད་དགོས་པས་དེ་རྩ་གསུམ་པའི་ཆུ་ཚོད་གཅིག་གི་ཡུན་འདས་པར་འཕོ་ཚུལ་བསྟན་པ་ཤེས་སོ། །གནོད་སྦྱིན་དར་མ་འུ་དུམ་བཙན་ཤིང་ལུག་ལོ་པ་སྐྱེས་ནས་ཟླ་བགཉིས་ནས་ཡབ་གཤེགས། ནར་སོན་པ་ན་གཅེན་གྱིས་འུ་ཤངས་རྡོ་ཡི་གཙུག་ལག་ཁང་བཞེངས་པ་ན་གྲོགས་སྟོབས་ཀྱི་དར་མས་ཀྱང་འབྲི་ཡི་གཙུག་ལག་ཁང་སོགས་བཞེངས། ཉེར་བདུན་ལྕགས་བྱ་ལ་རྒྱལ་སྲིད་ཐོབ་ནས་ལོ་གཅིག་འཇིག་རྟེན་ཕལ་སྤྱོད་རྣལ་མ་དང་། དེ་ནས་སྡིག་པའི་གྲོགས་པོས་བསྐྱོད་ཅིང་ནག་ཕྱོགས་གདོན་གྱིས་བསྐུལ་ནས་ཚུལ་ངན་ལ་སྤྱོད་པ་ཟླ་བ་དྲུག་དང་། དེ་ནས་སངས་རྒྱས་ཀྱི་བསྟན་པ་རིན་པོ་ཆེ་ལ་འཚེ་བ་ཁོ་ནར་ལྷུར་ལེན་པ་ཟླ་བ་ཕྱེད་བདུན་བཅས་བྱས་ནས། ལོ་ངོ་གསུམ་སོང་བའི་ཆུ་ཕག་ལོར་ཤཱཀྱའི་དགེ་སློང་རྡོ་རྗེ་འཛིན་པ་ལྷས་ལུང་དཔལ་གྱི་རྡོ་རྗེས་ཉག་ཕྲན་འཁྲུལ་འཁོར་གྱིས་ལྔ་པའི་ལམ་དུ་བརྫངས། རྒྱལ་པོ་བེའུ་དར་མ་ལྔ་ལམ་དུ་བཏང་བའི་ལོ་གཏན་ཚིགས་ཁ་ཅིག་ཏུ་ལྕགས་བྱ་དང་ཆུ་ཁྱི་དང་ཡང་ཤིང་གླང་དང་མེ་སྟག་བྱས་པ་ཡོད་ཀྱང་སྔ་མ་གཉིས་མི་འཐད་ལ་ཕྱི་མ་དག་རུང་། ཡང་དཀྱུས་སུ་བསྟན་པ་ཉིད་ཁུངས་སུ་ཆེའོ། །ལྷས་ལུང་དཔལ་གྱི་རྡོ་རྗེ་འདི་ནི་ཛྙཱ་ན་ཀུ་མཱ་རའི་སློབ་མ་དཔལ་གྱི་མིང་ཅན་བརྒྱད་ཀྱི་ཡ་གྱལ་ཡིན་པར་ཡོངས་གྲགས་དང་། ལོ་བཅུ་བདུན་པར་སྤ་གྲོ་སྟག་ཚངས་སུ་གུ་རུ་པདྨའི་ཞལ་མཇལ་ཞིང་། མཁའ་འགྲོ་ཡེ་ཤེས་མཚོ་རྒྱལ་གྱིས་རྗེས་སུ་བཟུང་། ཡི་དམ་ལྷ་དང་བླ་མས་བདུད་འདུལ་དཔའ་བོར་ལུང་བསྟན་པར་ལྷས་ལུང་དུ་གྲགས། ལྷ་སྲས་མ་རུབ་སྐུ་གཤེགས་མ་ཐག་ཏུ་སྐྱེ་བའི་ཉིན་ཉིང་མཚམས་སྦྱར་བ་ཡིན་ཞེས་བླ་མ་དགོངས་འདུས་ཀྱི་ལུང་བསྟན་བཀའ་རྒྱ་མར་གསལ་བར་གསུངས་པས། དེ་ཚེ་མེ་སྟག་གམ་མེ་ཡོས་གང་རིགས་སུ་འཁྲུངས་དགོས་ལ། རྒྱལ་པོ་སྡིག་ཅན་སྒྲོལ་དུས་དགུང་ལོ་ང་བརྒྱད་ཙམ་དུ་ཕེབས་པ་དང་། ཁམས་སུ་བླ་ཆེན་དགེ་བ་དགོངས་པ་རབ་གསལ་གྱི་བསྙེན་པར་རྫོགས་པའི་ཁ་སྐོངས་ཀྱི་དགེ་སློང་རྒྱ་ནག་ནས་ཧ་ཤང་གཉིས་འབད་པས་བཙལ་བའི་གྲོགས་ཀྱང་མཛད་ཅིང་། དུས་ཕྱིས་གནམ་ལྡེ་འོད་སྲུང་ལ་སྨན་བླ་བདེ་གཤེགས་བརྒྱད་ཀྱི་མདོ་ཆོག་གི་ལུང་བྱིན་པ་ཡང་བཤད་པས་སྐུ་ཚེ་བརྒྱད་ཅུ་ལྷག་ངེས་ཤིག་བཞུགས་པར་སྣང་ངོ་། །གངས་ཅན་འདིར་རྒྱལ་བསྟན་རིན་པོ་ཆེར་བྱ་བ་བླ་ལྷག་ཏུ་མཛད་པ་པོ་ཁྱད་པར་འཕགས་པ་གཅིག་སྟེ། བཀའ་དྲིན་རྣམ་པ་ཀུན་ཏུ་དྲན་ནས་རྟག་ཏུ་ཕྱག་བྱ་བའི་གནས་སོ། །ས་གནས་འཕགས་ཆེན་རྣམས་ཀྱི་སྤྲུལ་པའི་སྐུ། །ས་སྐྱོང་མཐོ་རིས་མཛེས་རྒྱན་མི་ཡི་ལྷ། །རྒྱལ་བའི་ལུང་བསྟན་རྒྱལ་བསྟན་འདྲེན་པ་པོ། །རྒྱལ་སྲས་རྒྱལ་བློན་རྣམས་ལ་རྟག་ཕྱག་འཚལ། །དམ་ཆོས་ཡུན་རིངས་གནས་པར་བྱ་བའི་ཕྱིར། །དམ་པའི་རྣམ་ཐར་འཛིན་ལ་ཆེས་བརྩོན་པ། །དཔལ་གྱི་རྡོ་རྗེ་ལ་སོགས་འཇིགས་མེད་ལྷ། །དཔལ་ཆེན་རྣམས་ལ་གུས་པ་ཅིས་མི་བསྐྱེད། །ཅེས་སོ། །བོད་རྗེ་ལྷ་བཙད་པོའི་རིགས་དྲི་མ་མེད་པ་བེའུ་དར་མ་ལ་སླས་ཀྱི་བཙུན་མོ་གཉིས་མངའ་བའི་ཆུན་མ་ཚེ་སྤོང་བཟའ་བཙད་མོ་འཕེན་ལ་ལྕགས་བྱ་ལོར་མངལ་དུ་ཆགས་ནས་ཆུ་ཁྱི་འཆར་བ་ན་ཁྱེའུ་མཚན་དང་ལྡན་པ་ཞིག་བཙས་པ་ཆེན་མས་འཕྲོག་གམ་བསད་པར་དོགས་ནས་མེལ་ཚེ་དང་མཚན་མོ་མར་མེའི་ཕྲེང་བས་བསྐོར་ནས་བསྲུངས་བས་མཚན་ཡང་འོད་སྲུང་དུ་ཆགས། འདི་སྤྱོད་ལམ་ལེགས་ཤིང་ངང་ཚུལ་བཟང་བས་དེ་སྐབས་བློན་འགའ་ཁྲི་རལ་གྱི་སྲས་ཡིན་པར་ཡང་བྱས་སྐད། འོད་སྲུང་བལྟམས་པའི་ལོ་ཕྱི་མ་རྒྱལ་པོ་བེའུ་གཤེགས་སྐབས་སྣ་ནམ་བཟའ་ལ་ཁྱེའུ་ཞིག་བྱུང་བ་བློན་པོ་རྣམས་ལ་བསྟན་པས་སྐྱེ་མ་ཐག་སོ་ཡོད་པ་ཐེ་ཚོམ་ཡང་ཡུམ་གྱི་བཀའ་བཙན་པས་བརྟན་དུ་ཆུགས་སྨྲས་པས་མཚན་ཡང་ཡུམ་བརྟན་དུ་ཆགས། ནག་ཕྱོགས་ཀྱི་རྣམ་པར་འཕྲུལ་པའི་སྡིག་བློན་རྣམས་ཀྱིས་རྒྱལ་པོ་བེའུ་གཤེགས་རྗེས་ཀྱང་བསྟན་ལ་འཚེ་བ་བརྩམས་རུང་རྒྱལ་པོའི་སྐབས་ལྟར་ངག་མི་བཙན་ཞིང་མི་རིངས་བར་ལུས་ཚལ་པ་དུ་མར་མངོན་དུ་ཞིག་ནས་ཚེའི་དུས་བྱས་པ་སོགས་བཟོད་དཀའ་མི་སྲིད་བཟད་འཇིགས་རུང་གིས་ཕལ་ཆེར་ཁ་དག་པས་མི་རྣམས་ཞིང་དངངས་ཤིང་། ཆོས་ལ་དཀར་བའི་བློན་པོ་རྣམས་ཀྱིས་ཀྱང་བསྐུལ་བས། ཤིང་གླང་ལོ་མཐར་ཆོས་ལ་འཚེ་བའི་འཕྲོ་ཆད། ཤིང་གླང་འདི་ཆོས་རྒྱལ་ཁྲི་སྲོང་ལྡེའུ་བཙན་གཤེགས་ལོ་དྲུག་ཅུ་སྐོར་གཅིག་འདས་ནས་ཡང་ཤིང་གླང་ཤར་བ་དེ་ཡིན། མེ་སྟག་ལ་འོད་སྲུང་དང་ཡུམ་བརྟན་ཡང་རྟེན་གྱི་སྤྱན་སྔར་སྐྱབས་འགྲོ་བླངས་ནས་དཀོན་མཆོག་རྟེན་ལ་མཆོད་པ་བྱས། རྒྱལ་བུ་དེ་ཉིད་ནར་སོན་ནས་གནམ་ལྡེ་འོད་སྲུང་གི་བུས་གཡོར་རུ་བཟུང་། སྨན་བླའི་མདོ་ཆོག་ལ་ཡི་དམ་སྙིང་པོ་མཛད་ཅིང་། དཀོན་མཆོག་གསུམ་ལ་གུས་པ་ཆེན་པོ་བྱས། དགུང་ལོ་རེ་གསུམ་དང་ཞེ་དགུ་དང་སོ་དགུ་བྱས་པ་མཐོང་ཡང་ཕྱི་མ་འཐད་པར་སེམས། དེ་ཡི་བཙུན་མོ་ལྕོག་རོ་བཟའ་རྒྱལ་མོ་ལ་ཡབ་ཀྱི་ཉེར་བཞི་ཤིང་བྱ་ལོར་སྲས་དཔལ་འཁོར་བཙན་འཁྲུངས། ཡབ་གཤེགས་པའི་ཕྱི་ལོ་ལྕགས་གླང་ལ་རྒྱལ་སར་འཁོད། བློན་པོ་འབྲོ་གཙུག་དགྲ་ལྷ་སྣང་དང་ཅང་འ་ཕོ་གཉིས་ཀྱིས་བྱས། གཙུག་ལག་ཁང་བརྒྱད་བཞེངས། གབ་རྩེ་མཁན་བསམ་རྒྱལ་གྱིས་ལུག་ལ་གཤེགས་ཟེར་བས་དགུང་ལོ་སོ་ལྔའོ། །གླིང་རྗེ་གེ་སར་དུ་གྲགས་པ་ཡང་གནམ་ལྡེ་འོད་སྲུང་ནས་འདི་ཡབ་སྲས་ཀྱི་རིངས་ལ་བྱུང་བར་མངོན་ནོ། །རླངས་ཀྱི་ཨ་མེས་བྱང་ཆུབ་འདྲེ་བཀོལ་གྱི་སྦྱིན་བདག་གེ་སར་གྱིས་བྱས་ཤིང་། བྱང་ཆུབ་འདྲེ་བཀོལ་རང་ཉིད་གུ་རུ་པདྨའི་སྤྲུལ་པ་དང་། གེ་སར་ཁྲི་སྲོང་ལྡེའུ་བཙན་གྱི་སྤྲུལ་པར་ཁས་བླངས་ཤིང་། གེ་སར་གྱ་བརྒྱད་ཐུབ་པའི་ལུང་བསྟན་མཛད་ཚུལ་རླངས་ཀྱི་པོ་ཏི་བསེ་རུར་ཡོད་པས་གེ་སར་ནམ་བྱུང་གི་དུས་དེས་ཤེས་པས་དེ་ལས་དུས་སྔ་བ་དང་ཕྱི་བར་མ་སེམས་ཤིག རྙིང་མ་ཁ་ཅིག་གིས་གེ་སེར་མངའ་བདག་སྤྲུལ་པར་འདོད་པ་རླངས་ཀྱི་ཚིག་རིས་དང་མཐུན་རུང་བདག་གི་རྩ་བའི་བླ་མས་གེ་སར་སྐྱེས་བུ་རྡོ་རྗེ་ལེགས་པའི་རྣམ་འཕྲུལ་དུ་གསུང་བ་དོན་ལ་གནས་པར་ངེས་ཤིང་། དེ་བོད་ཁམས་བདེ་བའི་ཕྱིར་མངའ་བདག་ཁྲི་སྲོང་གི་བཀའ་ལུང་ངམ་སྨོན་ལམ་གྱི་མཐུས་རྡོར་ལེགས་ཀྱིས་མི་ཡི་སྲིད་པ་བཟུང་བར་བྱས་ན་འགལ་བ་ཅན་ཡང་མ་ཡིན་ནོ། །ཕྱིས་བྱུང་ལོ་རྒྱུས་འཆད་པ་པོ་མང་པོ་ཞིག་གིས་ཨ་མེས་བྱང་ཆུབ་འདྲེ་བཀོད་འདི། གུ་རུ་པདྨ་བོད་དུ་བཞུགས་དུས་ཀྱི་དངོས་སློབ་ཡིན་ཞེས་གསུངས་ཀྱང་། གུ་རུ་པདྨས་རླངས་དཔལ་གྱི་སེང་གེར་ལུང་བསྟན་པ། ཁྱོད་རླངས་ཀྱི་མི་རྒྱུད་སྐལ་ལྡན་ལ། །ང་ཡི་ཐུགས་རྗེས་ཁྱབ་པར་བྱེད། །ཁྱོད་ནི་སྐྱེས་བུ་སྐལ་ལྡན་ཡིན། །ཁྱོད་ལྷ་རིགས་རླངས་ཀྱི་མི་རྒྱུད་ལ། །བྱང་དང་ཆུབ་ཅེས་བྱ་བ་ཡི། །མིའུ་ཁྱད་པར་འཕགས་པར་ཡོང་། །དེ་ནི་ང་ཡི་ཐུགས་ཀྱི་སྲས། །ཞེས་ལུང་བསྟན་ཅིང་། བྱང་ཆུབ་འདྲེ་བཀོལ་གྱིས་གུ་རུ་པདྨས་སྦས་པའི་ཆོས་རྙེད་པར་ཡང་བཤད་པས་གདུལ་བྱ་སྤྱིར་བཏང་ངོར་བོད་དུ་བཞུགས་དུས་ཀྱི་དངོས་སློབ་ནི་མ་ཡིན་པར་གོ་ལ། བྱང་ཆུབ་འདྲེ་བཀོལ་ལོ་བརྒྱ་དང་བརྒྱད་མེ་འབྲུག་ཟླ་བ་བཅུ་གཅིག་པའི་ཚེས་བཅུར་གཤེགས་ཟེར་ལ། དེ་ལ་སྲས་བཞི་ཡི་གཉིས་པ་གཉན་ཐོག་ཨ་ཁྲོམ་(ཀྲོང་)སྟེ། དེ་ནས་མི་རབས་དྲུག་པ་ཡོན་ཆེན་རྒྱལ་བ་སྐྱབས། ྿དེ་ཡི་སྲས་རླངས་ལྷ་གཟིགས་ཀྱི་ཕག་གྲུ་བཟུང་བའི་ཐོག་མར་྿རྗེ་སྤྱན་སྔ་ནི་ཕག་གྲུ་གཤེགས་ནས་ལོ་དྲུག་པ་ཤིང་ལུག་ལོར་འཁྲུངས་ནས་དགུང་ལོ་སོ་བཞི་ས་འབྲུག་ལོ་ཕག་གྲུ་གདན་ས་མཐིལ་གྱི་ཁྲིར་ཕེབས་ལོ་ཉེར་བདུན་བཞུགས། དེ་རྗེས་ཤིང་ལུག་ལོར་སྤྱན་སྔའི་གདུང་དབོན་རྒྱལ་བ་ཐོག་རྡུག་ཁྲིར་ཕེབས། དེ་ནས་རིམ་པ་བཞིན་དབོན་རྒྱུད་རྒྱལ་པོ་སྣེའུ་གདོང་པར་གྲགས་པའི་ཞབས་དྲུང་ནོར་བུ་ཞེས་པའི་བར་རིམ་གྱིས་བྱུང་ནས་དེང་དུས་གདུང་རྫོགས་ཏེ་རབ་བྱུང་བཅུ་གཉིས་པའི་ནང་དུའོ། །ཞེས་ཞོར་དུ་འཕྲོས་ལ། ད་ནི་དཀྱུས་སུ་འཇུག་སྟེ། མངའ་བདག་དཔའ་འཁོར་བཙན་གྱི་ཁབ་ཏུ་བཙུན་མོ་ཆེ་ཆུང་གཉིས་ལ་སྲས་རེ་རེ་བྱུང་སྟེ་ཆུན་མ་འཆིམས་(མཆིམས་)བཟའ་བཙུན་ནེ་ལ་གཅེན་ཁྲི་བཀྲ་ཤིས་བརྩེགས་པ་དཔལ་དང་། ཆེན་མ་སྣ་ནམ་བཟའ་ལེགས་བཙུན་ལ་གཅུང་སྐྱིད་ལྡེ་ཉི་མ་མགོན་བལྟམས། གཅེན་གྱིས་གཙང་ཉང་(མྱང་)སྟོད་རྒྱལ་མཁར་རྩེ་བཟུང་། དེ་ཡི་བཙུན་མོ་གཅོག་(ལྕོག་)རོ་བཟའ་མགོན་དཔལ་ལ་སྲས་དཔལ་ལྡེ་འོད་ལྡེ་སྐྱིད་ལྡེ་གསུམ་བྱུང་། དེ་ལ་སྨད་ཀྱི་ལྡེ་གསུམ་དུ་གྲགས། གཅེན་དཔལ་ལྡེས་གཅོག་(ལྕོག་)རོ་བཟའ་འབའ་རེ་ཁབ་ཏུ་བཞེས་པ་ལ་གཅེན་འོད་དཔལ་ལྡེ་དང་གཅུང་དྷརྨ་ཙཀྲ་གཉིས་ཡིན། འོད་དཔལ་ལྡེ་གུང་ཐང་དུ་ཕེབས་པ་གུང་སྟོན་དཔལ་མཛེས་ཀྱིས་བྱས་པའི་ཡི་གེར་ཡོད་ཟེར། གཞན་མང་པོ་ཞིག་གིས་ནི་དཔལ་ལྡེ་གུང་ཐང་དུ་ཕེབས་ཟེར་ཡང་མི་འཐད་པར་མངོན། གུང་ཐང་མངའ་བདག་ནོར་བུ་ལྡེས་མཛད་པའི་རྒྱལ་རབས་སུ་དཔལ་ལྡེའི་སྲས་དམར་པོ་བཙན་དུ་གསུང་བས་དེ་ནི་འོད་དཔལ་ལྡེའི་མཚན་གྱི་རྣམ་གྲངས་སུ་བྱེད་དགོས། དེ་ནས་གུང་ཐང་རྒྱལ་པོའི་རབས་རིངས་ཤིག་ཏུ་བྱུང་བ་རྣམ་གྲངས་མདོར་བྱས་ནས་འདིར་སྨྲས་པ། འོད་དཔལ་གུང་ཐང་ཕེབས་སྲས་འོད་ཟེར་ལྡེ། དེ་ནས་རིམ་བཞིན་བདེ་སྤྱོད་ལྡེ་དབང་ལྡེ། བཙན་ལྡེ་དེ་སྲས་གསུམ་མངའ་གཅེན་འོད་ལྡེ། །འདི་དང་མི་ལའི་སྐུ་ཚེ་སྨད་དུས་མཚུངས། །དེ་སྲས་རིམ་པས་དབང་ཕྱུག་ལྡེ་སྐྱོབས་ལྡེ། །མགོན་ལྡེ་བཙུན་ལྡེ་དེ་ཡི་བཙུན་མོ་རུ། །ཆོས་རྒྱལ་འཕགས་པའི་གཅེན་མོ་ཉི་འབུམ་སྟེ། །དེ་ལ་ཆོས་རྒྱལ་འབུམ་ལྡེ་མགོན་ཞེས་བལྟམས། །དེ་སྲས་གསུམ་གྱི་བར་མ་རིན་ཆེན་བཟང་། །དེ་སྲས་ཆོས་སྐྱོང་ལྡེ་སྟེ་གུང་ཐང་དུ། །ཆགས་པའི་གདུང་རབས་བཅུ་གསུམ་དུས་ཡིན་ཞེས། །གུ་རུའི་ལུང་དང་འདི་ཉིད་མཐུན་པར་འགྲིག །ཆོས་སྐྱོང་ལྡེ་སྲས་བཀྲ་ཤིས་ལྡེ་ཞེས་པ། །གཏེར་སྟོན་རྒོད་ལྡེའི་ཆོས་བདག་ཉིད་མཚུངས་ཡིན། །དེ་ནས་ཕུན་ཚོགས་ལྡེ་དང་བསོད་ནམས་ལྡེ། །ལྷ་དབང་རྒྱལ་མཚན་མངའ་བདག་རྣམ་རྒྱལ་ལྡེ། །བསམ་ལྡེ་ཀུན་དགའ་བློ་གྲོས་ཀུན་དགའ་གྲགས། །བསམ་ལྡེ་ཕྱི་མ་དེ་སྲས་བསོད་དབང་ལྡེ། །དེ་ལྟར་མཆེད་དང་ཁྲི་རབས་མ་བསྒྲང་བར། །ཡབ་སྲས་རྐྱང་བསྒྲངས་རྒྱལ་རབས་ཉེར་གསུམ་མཐར། །རབ་བྱུང་བཅུ་པའི་ལྕགས་པོ་སྤྲེལ་ལོ་ལ། །གཙང་པ་རྒྱལ་པོའི་དཔུང་གིས་གུང་ཐང་བླངས། །གུ་རུས་བསྔགས་པ་གུང་ཐང་རྒྱལ་པོའི་གདུང་། །གངས་ཅན་བསོད་ནམས་བགོ་སྐལ་དེ་ཙམ་གྱུར། །དེ་ནས་ཉེར་གཅིག་ལོ་འདས་ལྕགས་སྦྲུལ་ལ། །ཨོ་རོད་དཔུང་གིས་གཙང་པའི་རྒྱལ་སྲིད་བླངས། །ལྕགས་སྦྲུལ་དེ་ནས་ད་ལྟའི་ཤིང་གླང་བར། །མི་ལོ་བརྒྱ་དང་ཉི་ཤུ་རྩ་ལྔ་སོང་། །ཞེས་དང་། མངའ་རི་(རིས་)པཎ་ཆེན་སྐུ་མཆེད་ཀྱི་རྣམ་ཐར་ལོ་རྒྱུས་སུ་གུང་ཐང་རྒྱལ་པོའི་གདུང་རིགས་ལས་འཁྲུངས་པར་བཞེད་ཅིང་། དེ་ཡང་མངའ་བདག་རྣམ་རྒྱལ་ལྡེ་ལ་སྲས་མང་དུ་བྱུང་བའི་ཐུ་བོ་དམ་པ་ནོར་བུ་ལྡེ་གློ་བོར་ཡུན་རིང་བཞུགས་དགོས་བྱུང་སྐབས་ཀྱི་སྲས་འཇམ་དབྱངས་རིན་ཆེན་རྒྱལ་མཚན་ཡིན་ཞེས་གསུངས་ཤིང་། དེ་ལ་སྲས་བདུན་བྱུང་བའི་གཅེན་མངའ་རིས་པཎ་ཆེན་ནི་རྩོད་མེད་ཀྱི་གཏེར་སྟོན་ཆེན་པོ་སྟེ། སྐུ་ཚེ་རིལ་པོ་དགེ་སློང་གི་བཅས་པ་ལྷུར་བླངས་ཤིང་། གཅུང་ལེགས་ལྡན་ཞེས་མངའ་རིས་རིག་འཛིན་དུ་གྲགས་པ་ཡང་གཏེར་སྟོན་ཡིན་ལ། སྲས་པདྨ་རྒྱལ་པོ་ཞེས་པ་བྱོན་རུང་དེ་ནས་གདུང་རྒྱུད་མ་འཕེལ། སྐུ་མཆེད་བར་པ་ཁ་ཅིག་གི་རྒྱུད་ད་ལྟ་གློ་བོ་མ་ཐང་གི་དབོན་རྒྱུད་རྒྱུན་ཕྲ་མོར་གནས་པ་འདི་རྣམས་ཡིན་ཟེར་བས་དེ་ཚོ་གུང་ཐང་རྒྱལ་པོའི་གདུང་རིགས་སུ་གཏོགས་དགོས་སོ། །དཔལ་ལྡེའི་སྲས་གཅུང་དྷརྨ་ཙཀྲའི་རྒྱུད་ལྷ་རྩེ་བ་གླ་ལུང་རྩ་གོར་བ་ཀླུ་རྒྱལ་བ་སྤྱི་པ་རྣམས་ཡིན་པར་གྲགས། ལྡེ་གསུམ་གྱི་འབྲིང་བ་འོད་ལྡེ་ལ་སྲས་བཞི་བྱུང་ཞིང་།དེ་ཡི་རྒྱུད་གཙང་རོང་དང་། ཡར་ལུང་དང་། ཁམས་ཀྱི་གཙང་ཁར་ཡང་ཡོད་སྐད། ཆུང་བ་སྐྱིད་ལྡེ་འཛད་རྟ་ནག་ཏུ་ཕོག་ཕེབས། སྲས་དྲུག་བྱུང་བའི་རྒྱུད་སོགས་ལྡེ་གསུམ་གྱི་གདུང་རིགས་དེ་སྐབས་ཆེས་མང་བ་འཕེལ་ཏེ་ཡོད་ཅེས་སྨྲས་སོ། །ཡང་མངའ་བདག་དཔལ་འཁོར་བཙན་གྱི་སྲས་ཆུང་བ་སྐྱིད་ལྡེ་ཉི་མ་མགོན་མངའ་རིས་ཕྱོགས་སུ་ཕེབས། པུ་རོང་(སྤུ་རང་)དུ་སྐུ་མཁར་ཉི་མ་གཟུངས་བརྩིགས། དེ་གྲུབ་པའི་ཞལ་སྤྲོ་མངའ་གསོལ་གྱི་སྐབས་སུ་ནམ་མཁའ་ནས་ལུང་བསྟན་པའི་སྒྲ་འདི་སྐད་དུ། སེམས་ཅན་སྤྱི་མཐུན་ལས་ལ་ལེགས་གྲུབ་པ། །ཉི་མ་ཞེས་བྱ་དེ་ཡི་གྲོགས་སུ་ནི། །སྤུ་རང་ཞེས་བྱར་བོད་ཀྱི་རྒྱལ་ཁབ་བྱུང་། །སངས་རྒྱས་བསྟན་པའི་ཉི་མ་དེང་འདིར་ཤར། །ཞེས་ཀུན་གྱིས་ཐོས་པར་གྲགས་པ་དང་། གཞན་ཡང་བཀྲ་ཤིས་པའི་ལྟས་ངོ་མཚར་ཅན་མང་དུ་བྱུང་། དེ་ལ་སྲས་སྟོད་ཀྱི་མགོན་གསུམ་དུ་གྲགས་པ་བྱུང་སྟེ། རིག་པ་མགོན། བཀྲ་ཤིས་མགོན། ལྡེ་གཙུག་མགོན། ཆེ་བ་རིག་པ་མགོན་གྱིས་མར་ཡུལ་འབྲུ་ཤའི་བར་དང་། འབྲིང་བ་བཀྲ་ཤིས་མགོན་གྱིས་ཞང་ཞུང་ཡ་རྩེ་དང་བཅས་པ། ཆུང་བ་ལྡེ་གཙུག་མགོན་གྱིས་པི་ཏི་ཅོག་འང་ཟངས་དཀར་སྒོ་གསུམ་བཅས་བཟུང་ཞེས་འདི་ནི་རིག་ཅིང་འཐད་ལ་ཁུངས་དང་ལྡན་པ་སྟེ། གཞན་གུ་གེ་དང་སྤུ་རང་གཉིས་སུ་མགོན་གཉིས་ཕོག་(ཕེབས་)པ་དེ་ནི་མ་ཡིན་ནོ། །བཀྲ་ཤིས་མགོན་གྱི་སྲས་སྲོང་ངེ་དང་འཁོར་རེ་གཉིས། སྲོང་ངེས་གུ་གེ་དང་། འཁོར་རེས་སྤུ་རང་བཟུང་། སྲོང་ངེ་དང་འཁོར་རེའི་མིང་དངོས་གཞི་དྲང་སྲོང་ལྡེ་དང་། འཁོར་ལོ་ལྡེ་ཡིན་ཞེས་མངའ་རིས་གུང་ཐང་དུ་དཔེ་ཧྲུལ་ཀ་ནི་(ཀཀྞི་)ཀ་རྙིང་པར་བརྫངས་བ་ཞིག་ཏུ་འདུག་པ་འཐད་ངེས་སུ་སྣང་། དྲང་སྲོང་ལྡེ་ཡི་སྲས་ནཱ་ག་རཱ་ཛ་དང་། དེ་ཝ་རཱ་ཛར་གྲགས། ཁོང་གིས་པཎྜི་ཏ་ཁ་ཤས་སྤྱན་དྲངས། ལོ་ཆེན་རིན་བཟང་སོགས་རྒྱ་དཀར་དུ་བརྫངས་པས་བསྟན་པ་ལ་ཆེས་ཕན། འོན་ཀྱང་དེང་སང་ལོ་རྒྱུས་ཐམས་ཅད་དུ་དེ་ལྟར་གྲགས་མོད། དེ་ཚེ་ལྷ་བླ་མ་དེ་ལོ་བརྒྱའམ་བརྒྱ་ལ་ཉེ་བ་ཞིག་བཞུགས་དགོས་ཏེ། ཇོ་བོ་བོད་དུ་ཕེབས་སྐབས་ལོ་ཆེན་བརྒྱད་ཅུ་རྩ་ལྔ་བཞེས་པས། ལྷ་བླ་མ་དེ་བས་བསྒྲེས་(བགྲེས་)པ་ཞིག་ངེས་པར་དགོས་པས་སོ། །ལྷ་བླ་མ་ལུག་ལོ་པ་དགུང་ལོ་དོན་བརྒྱད་བཞུགས་ཞེས་མངའ་རིས་གུང་ཐང་ལོ་རྒྱུས་སུ་དྲངས་པས། དེ་ཚེ་ལྷ་བླ་མ་དང་ལོ་ཆེན་ལོ་ཁྱད་གཅིག་ལས་མ་བྱུང་ཞིང་། ལོ་རྒྱུས་དེར་ནཱ་ག་རཱ་ཛ་དང་། དེ་ཝ་རཱ་ཛ་རབ་ཏུ་བྱུང་བས་བྱང་ཆུབ་འོད་དང་ཞི་བ་འོད་ཡིན་ཟེར་བ་སོགས་ལོ་རྒྱུས་ཁུངས་མ་ད་དུང་བཙལ་དགོས་པར་སྣང་། སྐུ་ཚེ་སྨད་རང་གི་རྒྱལ་སྲིད་གཅུང་འཁོར་རེར་གཏད་དེ། ཡབ་སྲས་གསུམ་ཀ་རབ་ཏུ་བྱུང་། ཡབ་ལ་ལྷ་བླ་མ་ཡེ་ཤེས་འོད་དུ་གྲགས། འཁོར་རེའི་སྲས་ལྷ་ལྡེ། དེ་ལ་སྲས་གསུམ། ད་ལྟའི་ལོ་རྒྱུས་སྤྱིར་བར་པ་བྱང་ཆུབ་འོད་ཡིན་སྨྲས་ལ། དེས་ཇོ་བོ་རྗེ་བོད་དུ་སྤྱན་དྲངས་པ་སོགས་བསྟན་པ་ལ་བཀའ་དྲིན་ཤིན་ཏུ་ཆེ། གཅུང་འོད་ལྡེས་ཀྱང་པཎྜི་ཏ་ཛྙཱ་ན་ཤྲི་སོགས་སྤྱན་དྲངས། འོད་ལྡེའི་སྲས་རྩེ་ལྡེས་རྔོག་ལོ་རྒྱ་དཀར་དུ་བརྫངས་པ་སོགས་བསྟན་པ་ལ་ཕན་པར་མཛད། དེ་ཡི་སྲས་རབས་ལྔ་པའི་སྐབས་གདུང་ཞིག་ཡ་རྩེར་བྱོན། རྒྱལ་རབས་བརྒྱད་ལྷག་ཅིག་བྱོན་ནས་སངས་རྒྱས་བསྟན་པ་གུས་པས་མཆོད་པ་བྱུང་། དེ་ནས་གདུང་རྫོགས་ཏེ་མོན་གྱི་བློན་པོ་བ་ལི་ར་ཛ་བྱ་བར་རྒྱལ་སྲིད་ཐོབ་པ་ད་ལྟ་ཛུམ་ལིར་གྲགས་པ་འདི་ཡིན། སྤུ་རང་དུ་གདུང་རབས་རིང་དུ་བྱུང་ཞིང་མཐར་རབ་བྱུང་བཅུ་གཅིག་པའི་ནང་དུ་གདུང་རིགས་ཀྱི་རྒྱུད་རྫོགས་པ་ཡིན་ཞེས་ཟེར། ཞང་ཞུང་གི་མཐིལ་གུ་གེར་གདུང་རབས་རིམ་ཅན་བྱུང་བཅུ་གཅིག་པའི་མེ་འབྲུག་ལོ་ལ་འཁྲུངས། རེ་བརྒྱད་པ་རབ་བྱུང་བཅུ་གཉིས་པའི་མཐའ་ལ་ཉེ་བ་ཆུ་ཕག་ལོར་སྦོ་(དབོ་)ཟླ་བའི་ཚེས་ལ་གཤེགས་པའི་དགོངས་རྫོགས་བསྔོ་རྟེན་བླ་མ་ཁག་ལ་ཕུལ་བ་ངེད་ཀྱི་སྐལ་བ་རྐོང་ཡུལ་ཀོང་ཡུལ་གཙང་པོ་མགོ་དགུར་སྡོད་སྐབས་སྡེ་པ་གཞུང་བརྒྱུད་དེ་བྱུང་། དེ་ནས་གུ་གེ་གདུང་རྒྱུད་ཆད་དེ་སྲས་མོ་གཉིས་ཀྱི་ཐ་ཆུང་མར་ཡུལ་ལ་དྭགས་རྒྱལ་པོའི་ཁབ་ཏུ་བཟུང་བར་སྲས་གཉིས་མངའོ། །མར་ཡུལ་བདག་པོ་རིག་པ་མགོན་ལ་སྲས་མང་དུ་བྱུང་བའི་རྒྱུད་ལ་དྭགས་རྒྱལ་པོ་ཡང་ཡིན་ཟེར་ལ་རྩོད་པ་མེད་པ་ནི་མངའ་བདག་སྟག་ཤམས་ཅན་དེ་ཡི་རིགས་རྒྱུད་ད་ལྟ་སྟོབས་འབྱོར་ཤིན་ཏུ་དབུལ་ཡང་འབྲས་ལྗོངས་ནུབ་རི་གྲོ་ཤོད་སོགས་སུ་ཐོར་བུ་ཡོད་པ་རྣམས་སོ། །ལྷ་རིགས་ཆོས་སྐྱོང་རྒྱལ་པོའི་གདུང་། །ཇི་སྙེད་བྱུང་བ་མདོ་ཙམ་དུ། །ཡིད་ཆེས་དེབ་ཐེར་མང་པོ་དང་། །བསྟུན་ནས་བྱུང་བ་འདི་ན་ཀྭ །ཞེས་སོ། །མངའ་བདག་ཁྲི་ཡུམ་བརྟན་གྱི་སྲས་ཁྲི་ལྡེ་མགོན། དེ་སྲས་རིག་པ་མགོན། དེ་སྲས་རྡོ་རྗེ་འབར། དེ་ལ་སྲས་གཉིས། གཅེན་ཁྲི་དབང་ཕྱུག་བཙན། གཅུང་ཁྲི་པ། གཅེན་གྱི་སྲས་ལྷ་བཙན་པོ་ལོ་ཙཱ་བ་ཡེ་ཤེས་རྒྱལ་མཚན་ཏེ་ལེགས་སྦྱར་ལ་ཤིན་ཏུ་བྱང་བས་ཁ་རག་གཉོས་ཀྱི་ལོ་ཙཱ་ཡང་ཁོང་གི་སློབ་མ་ཡིན། ཇོ་བོ་མ་ཕེབས་གོང་ལོ་ཉི་ཤུའི་སྐབས་ཙམ་ལ་པཎྜི་ཏ་པདྨ་གསང་བ་བྱོན་པ་ན། ཞབས་ལུགས་གྲོལ་ཏིག་སོགས་བསྒྱུར་བའི་ལོ་ཙཱ་མཛད། ཁྲི་དབང་ཕྱུག་བཙན་དང་ཁོང་ཡབ་སྲས་ཀྱི་སྐུ་རིང་དུ་ཁམས་ནས་དབུས་གཙང་མི་ལྔའམ་བཅུས་སྡོམ་རྒྱུད་བླངས་ནས་བསྟན་པ་ཕྱི་དར་དབུ་ཚུགས་པས་བཀའ་དྲིན་ཡང་ཆེ་བ་ཡིན། གཅུང་ཁྲི་པར་སྲས་བཞིའི་ཆུང་ཐ་བྷོ་དྷེ་རཱ་ཛ་ཡིན། ཇོ་བོ་བསམ་ཡས་སུ་ཕེབས་སྐབས་དང་ཁོང་དུས་མཚུངས། དེ་ཡི་རྒྱུད་བླ་དག་ཏུ་ད་ལྟ་ལྷ་བཙན་སྔོན་མོ་ཞེས་མཚན་དངོས་ལྷ་དབང་རྒྱ་མཚོའི་བློ་གྲོས་ཏེ་བསམ་ཡས་དབུ་རྩེ་ནས་འཆི་བདག་སྲོག་འཁོར་གཏེར་ནས་འདོན་པ་(པོ་)དེ་དང་། ལྷ་འབྲི་སྒང་པ་སོགས་མང་དུ་བྱུང་བ་སྣང་། འདིར་བཤད་(པ་)ནི་ལོ་རྒྱུས་ཁུངས་ལྡན་ལས་དྲངས་པ་སྟེ། ཡེ་ཤེས་རྒྱལ་མཚན་གྱིས་སྲས་ཁྲི་པ་བྱས་པ་སོགས་(ལ་)མགོ་རྨོངས་པར་མི་བྱའོ། །ཡུམ་བརྟན་གྱི་རྒྱུད་བསམ་ཡས་དང་། རྡོ་དང་། འོན་སོགས་དང་། ཁམས་ཕྱོགས་སུ་ཡང་མང་དུ་ཡོད་པར་གྲགས་པ་དང་། རྐོང་(ཀོང་)པོ་རྐྱེན་རྒྱལ་པོ་ཡང་ཡུམ་བརྟན་གྱི་རྒྱུད་ཡིན། དྭགས་པོ་ཨེ་ལྷ་རྒྱ་རི་བ་ཁ་ཅིག་གིས་འོད་སྲུང་གི་རྒྱུད་པར་མཛད་ཀྱང་གཞན་མང་(པོ་)ཞིག་ལྷ་འབྲི་སྒང་བའི་རྒྱུད་པར་སྨྲའོ། །སྤྱིར་གནམ་ལྡེ་འོད་སྲུང་དང་། ཁྲི་ལྡེ་ཡུམ་བརྟན་གྱི་རྒྱུད་པ་མང་དུ་བྱུང་བར་གྲགས་ཀྱང་། མངའ་རིས་དབུས་གཙང་རྣམས་སུ་ད་ལྟ་ཇི་བཞིན་ངོས་ཟིན་པ་ནི་ཐོར་བུ་འདིར་སྨོས་པ་ཙམ་ལས་མི་སྣང་སྟེ་ཉུང་ངུར་ཟད་དོ། །བར་ཁམས་ངོམ་ཤོད་ཨ་ནུ་ཞེས་མང་དུ་ཡོད་པ་རྣམས་མངའ་བདག་གི་རིགས་སུ་གནས་མོད། དགེ་སློང་ཀརྨ་ཆགས་མེད་ཀྱིས་མཛད་པའི་ཡུལ་ཕྱོགས་དེ་ཡི་ཡིག་ཚང་ངམ་ངག་རྒྱུན་ཉིད་ལ་བརྟག་འོས་དང་། མདོ་ཁམས་སྨད་བཙད་པོ་ཨུར་གྱི་རིགས་ནི་མངའ་བདག་སད་ན་ལེགས་ཀྱི་སྲས་ཟུར་བྱུང་ཞིག་གི་རྒྱུད་ཡིན་ཞེས་གྲུབ་ཐོབ་ཆེན་པོ་ཀརྨ་པཀྴིའི་གསུངས་སུ་ངེས་པའོ། །ཀྭ་ཡེ་སྔོན་རབས་བཟང་པོའི་གཏམ་ཉིད་དང་། །དམ་པའི་ལུགས་སྲོལ་འཕགས་པའི་ནོར་བཟང་པོ། །ཡ་རབས་དྲ་མའི་གདུང་རིགས་དྲི་མེད་རྣམས། །སྟོན་གཞུག་མེ་ཏོག་བཞིན་དུ་གྱུར་འདིས་སྐྱོ། །གངས་རི་ར་བས་བསྐོར་བའི་ལྗོངས་འདི་རུ། །སྐལ་བཟང་རྫོགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས། །ཐུབ་དབང་ཉི་མའི་རིང་ལུགས་ཇི་བཞིན་པ། །འདྲེན་མཛད་ཆོས་རྒྱལ་རྣམས་ལ་ཅིས་མི་བསྔགས། །གང་གི་གདུང་རིགས་རིན་ཆེན་གསེར་གྱི་ཕྲེང་། །རིམ་བྱོན་རྒྱལ་བའི་བསྟན་ལ་ལྷག་བསམ་ཐུགས། །ཞུམ་མེད་འཆང་བར་གྱུར་པ་མིའི་སེང་གེ །དམ་པ་རྣམས་ལ་བདག་བློ་ཅིས་མི་འཇུག །དེ་བས་དེ་དག་རྣམས་ལ་གུས་པའི་བློས། །སྙིང་ནས་རྟག་ཏུ་བསྔགས་པ་བརྗོད་པའི་གཏམ། །སྨྲས་པ་འདི་ཡང་དོན་མེད་མ་ཡིན་ཏེ། །སངས་རྒྱས་བསྟན་པ་སྤེལ་ལ་བསྔགས་པ་ཡིན། །ཞེས་སོ། །བོད་འདིར་བསྟན་པ་ཕྱི་དར་དུ་གྲགས་པ་དགེ་འདུན་འདུལ་བའི་སྡེ་སྣོད་བྱུང་བ་ཡང་གྲུབ་ཐོབ་ཨོ་རྒྱན་པས་ཕག་གྲུ་ཡི་རྒད་པོ་ཞིག་གི་ངག་རྒྱུན་ལ་བརྟེན་(ནས་)བསྟན་པ་སྔ་དར་ཉམས་ནས་ཕྱི་དར་བར་ལོ་ཉེར་ལྔའམ་སུམ་ཅུ་ཙམ་མཛད་པ་དང་། རྗེ་གཙུག་ལག་འཕྲེང་བས་ཆུ་གླང་ལོ་ལ་དབུས་གཙང་གི་མི་བཅུ་ལས་ཀླུ་མེས་ཚུལ་ཁྲིམས་ཤེས་རབ། མཁན་བུ་གྲུ་མེར་དང་བཅས་པ་མོན་མཁར་འབྲས་བུར་ཕེབས་པ་འདི་ཕྱི་དར་གྱི་ཐོག་མར་ཀླུ་མེས་རྣམས་འདོད་གསུངས་ཤིང་། མཁན་ཆེན་དྷརྨ་ཤྲི་ཡང་ཉིན་སྣང་དུ་ཕྱི་དར་འདས་ལོ་འདི་དང་མཐུན་པར་བྱས་ཏེ། ལྕགས་བྱ་ནས་ལོ་ང་གཉིས་འདས་པའི་ཆུ་གླང་ཡིན་ནོ། །བུ་སྟོན་ཆེན་པོས་དབུས་ཀྱི་རྒན་མོ་ཞིག་གི་ངག་རྒྱུན་ལ་བརྟེན་(ནས་)ལྕགས་བྱ་ནས་ཕྱི་དར་གྱི་བར་བདུན་ཅུའམ་དོན་གསུམ་དང་དག་ཏུ་བཞེད་པས། ཕྱི་མ་ལྟར་ན་ཆུ་བྱ་དང་སྔ་མ་བྱས་ཚེ་ལྕགས་རྟ་ཡིན་དགོས་སོ། །འབྲོམ་སྟོན་རྒྱལ་བའི་འབྱུང་གནས་ཀྱིས་ལྕགས་བྱ་ནས་བར་སྟོང་བདུན་ཅུ་དོན་བདུན་ས་སྟག་ལ་བསྟན་པ་ཕྱི་དར་གྱི་དབུ་ཡིན་པར་བཞེད་པ་དང་། ས་སྐྱའི་བླ་མ་དམ་པས་ནི། རྒྱལ་པོ་བཀའ་ཆེམས་ལས། དཔལ་ཞེས་བྱ་བའི་དགེ་སློང་གིས། །སྡིག་ཅན་རྒྱལ་པོ་སྒྲོལ་བར་འགྱུར། །དེ་ནས་ལོ་སྐོར་བརྒྱད་ཀྱི་བར། །སངས་རྒྱས་བསྟན་པ་མེད་པར་འགྱུར། །ཞེས་གསུངས་པ་ལ་དགོངས་ཏེ། ལྕགས་བྱ་ནས་བསྟན་པ་བར་སྟོང་ལོ་སྐོར་བརྒྱད་བྱུང་བས། དེ་ལ་ལོ་རྒན་གཅིག་དང་ལོ་རྐྱང་པ་བརྒྱད་དེ། ཁྱོན་དགུ་བཅུ་གོ་བརྒྱད་ཡིན་ལ། ས་ཁྱི་ལ་ཕྱི་དར་བྱུང་བ་བཞེད། ནེལ་པ་པཎ་ཆེན་སྨོན་ལམ་ཚུལ་ཁྲིམས་ཀྱིས་ལྕགས་བྱ་ནས་ལོ་བརྒྱ་དང་བརྒྱད་ཀྱི་བར་དུ་འདུལ་བསྟན་མ་བྱུང་བས། ཕྱི་དར་ཐོག་མ་ས་བྱ་ཡིན་པར་བཤད་དོ། །དེ་ལྟར་འདུལ་བསྟན་དགེ་འདུན་གྱི་སྡེ་ཕྱི་དར་གྱི་ལོ་གྲངས་འདོད་ཚུལ་རིམ་པ་ལྔ་ལས། སྔ་མ་ནི་གྲུབ་ཐོབ་ཨོ་རྒྱན་ས་ལུག་ལོར་ཡར་ལུང་དུ་བྱོན་སྐབས་རལ་པ་ཅན་མཐོང་ནས་དེ་ཡི་བར་ལོ་ཉིས་བརྒྱ་དང་བཅུ་བདུན་སོང་བར་དགོངས་པའི་ལུག་ལོ་འདི་ནི་ཀརྨ་པཀྴི་གཤེགས་པའི་ཆུ་ལུག་དེ་ཡིན་པར་སྣང་བས་ཆུ་ལུག་དེ་ནས་ཡར་ལ་བསྒྲངས་བས་རྗེ་སྤྱན་སྔ་འཁྲུངས་པའི་ཤིང་ལུག་བར་བརྒྱ་དང་དགུ། དེ་ནས་ཡར་ཕག་གྲུ་འཁྲུངས་པའི་ལྕགས་སྟག་བར་རེ་ལྔ། དེ་ནས་ཇོ་བོ་རྗེ་བོད་དུ་ཕེབས་པའི་ཆུ་རྟ་བར་རེ་བརྒྱད། དེ་རྣམས་དྲིལ་བའི་ལོ་མངོན་སུམ་པས་དཔྱད་མི་བཟོད་ཀྱང་འོན་ཏེ་ལྕགས་བྱ་ནས་ཉེར་ལྔའམ་སུམ་ཅུ་ལྷག་ཙམ་ན་ཕྱི་དར་ཚུགས་ཚེ་ཤིང་བྱའམ་ཆུ་འབྲུག་བར་འདོད་དགོས་པས། དེར་བླ་ཆེན་པོ་རང་ཉིད་རབ་ཏུ་བྱོན་པའམ་(བྱུང་བའམ།) དེས་མཁན་བུ་སྐྱོང་བའི་དུས་ལྟ་བུར་བཟུང་ནས་འདུལ་བསྟན་དབུ་བརྙེས་པར་སོང་བས་རུང་བར་སེམས་སོ། །གཉིས་པ་ནི། ཀླུ་མེས་ཀྱི་དངོས་སློབ་བམ་དེ་ནས་ཡུན་རིང་མ་སོང་བའི་ཡི་གེར་གསལ་ན་ཁུངས་ཆེ་ཞིང་། དབུས་གཙང་གི་མི་ལྔའམ་བཅུས་བླ་ཆེན་པོ་རང་ཉིད་ལ་སྡོམ་པ་བླང་བར་བྱས་ཚེ་དུས་སྔ་ཕྱི་འགྲིག་རུང་དེ་ལྟ་མིན་ན་འདོད་པ་གསུམ་པར་དཔྱད་བཞིན་ནོ། །གསུམ་པ་ནི། ཁ་ཅིག་གིས་ལོ་སྟོན་རྡོ་རྗེ་དབང་ཕྱུག་དང་། ཚོངས་བཙུན་ཤེས་རབ་སེང་གེས་དགེ་འདུན་གྱི་སྡེ་གནས་གཞི་ཚུགས་པ་ལ་དགོངས་སྐད་ཀྱང་ཀླུ་མེས་ཀྱིས་བླ་ཆེན་པོའི་སློབ་མ་མཚུར་ཤེས་རབ་མཆོག་ལས་སྡོམ་པ་བླང་བ་ཀླུ་མེས་ཀྱི་དངོས་སློབ་བ་ཤི་གནས་བརྟན་གྱིས་སྨྲས་པ་དང་། གཞན་ཡང་ཀླུ་མེས་དང་སུམ་པ་ནི་དུས་མཚུངས་པར་བ་ཤི་གནས་བརྟན་གྱིས་འདི་སྐད་དུ། བདག་གི་དགེ་བའི་བཤེས་གཉེན་ཆེན་པོ་ཀླུ་མེས་ཤེས་རབ་ཚུལ་ཁྲིམས་དང་། སུམ་པ་ཡེ་ཤེས་བློ་གྲོས་གཉིས་ཀྱིས་དང་པོ་ཁོ་ནར་ཀླུང་ཤོད་འབྱིམ་པའི་ལུང་དུ་གནས་བཙུག་པས་མ་ཚུགས། དེ་ནས་བྱ་ཡི་ལོ་ལ་མོ་ར་སྒྱེལ་བཙུག་ཅེས་བྲིས་ཡོད་པར་སྣང་ཞིང་། འབྲོམ་སྟོན་གྱིས་དབུས་ཀྱི་དགེ་བའི་བཤེས་གཉེན་རྣམས་ལ་ཇོ་བོ་བསུ་བར་བསྐུལ་བའི་ཡི་གེར། དང་པོའི་དགེ་སློང་ལུགས་འབྱིན་དཔོན། བཙུན་ཆེན་ཡེ་ཤེས་བློ་གྲོས་དང་། ཞེས་གསུངས་པས་སྔ་དར་ཆུ་གླང་ལོར་བྱས་ཚེ་འདི་སྐབས་ཇོ་བོ་བོད་དུ་ཆུ་རྟ་ལོར་ཕེབས་སྐབས་ལོ་དགུ་བཅུ་ལོན་ཅིང་དེ་གོང་དགེ་སློང་སྒྲུབ་པའི་ལོ་ཚིགས་ཀྱང་ལོན་དགོས་པར་བསྒྲངས་ན་བརྒྱ་དང་བཅུ་ལྷག་ཏུ་ངེས་པར་འགྱུར་བས། ཀླུ་མེས་ཀྱང་ཚེ་ཡུན་རིང་བཞུགས་པར་གྲགས་པས་སུམ་པ་ཡང་དེ་མཐུན་སྐུ་ཚེ་ཡུན་རིང་བཞུགས་པར་གྲགས་པས་སུམ་པ་ཡང་དེ་མཐུན་སྐུ་ཚེ་ཡུན་རིང་བཞུགས་ན་ལས་(དེ་མིན་)འགྲིག་དཀའ་བར་ཤེས་ཤིང་། གོང་གི་མཁན་རབས་ཉིད་དང་། ལོ་གྲངས་སྤྱི་བཏང་གི་དཔྱད་ན་(ལ་དཔྱད་ཚེ་སྤྱིར་བཏང་བྱས་ན་)ཕྱི་དར་དབུ་ས་སྟག་ཉིད་དུ་མི་འགལ་ཏེ། དེ་ཡང་བླ་ཆེན་པོའི་དངོས་སློབ་ཀྱི་མཁན་བུ་ཁ་ཤས་གཙུག་ལག་ཁང་བརྩིགས་པའི་ནུས་པ་མེད་ཀྱང་ཆུ་གླང་ལོར་ཕེབས། དེ་ནས་ལོ་ཉེར་ལྔ་ལོན་པའི་ས་སྟག་ལོར་བྱང་ཆུབ་སེམས་དཔའ་སྨོན་ལམ་གྱི་མཐུ་ཆེན་པོ་མངའ་བ་ཀླུ་མེས་དང་སུམ་པ་སོགས་བྱོན་ནས་དགེ་སློང་གི་དགེ་འདུན་སྡེ་འཕེལ་ཞིང་གཙུག་ལག་ཁང་རྒྱ་ཆེར་བརྩིགས་པར་བྱས་ན་འཐད་པར་རིགས་སོ། །བཞི་པ་ནི། རེ་ཞིག་ལྷ་སར་དགེ་འདུན་འདུས་པའི་སྡེ་མ་ཚུགས་པ་ལ་དགོངས་ཟེར། ལྔ་པ་ཀླུ་མེས་ཀྱི་ས་བྱ་ལོ་ལ་མོ་ར་སྒྱེལ་གྱི་གནས་གཞི་བརྩིགས་པ་ལ་བསྟན་པ་ཕྱི་དར་གྱི་ལོ་མགོར་འཁྲུལ་བ་ཡིན་ཞེས་གསུངས་སོ། །དེ་ལྟར་བསྟན་པ་ཕྱི་དར་གྱི་དབུ་ཆུ་གླང་གི་ལོ་ཡིན་ན་ལོ་ཆེན་རིན་བཟང་རབ་ཏུ་མ་བྱུང་བའི་ལོ་བཅུ་བདུན་གྱི་གོང་དང་། ས་སྟག་ཡིན་ན་རབ་ཏུ་བྱུང་ནས་ལོ་བརྒྱད་འདས་ཏེ་ལོ་ཆེན་གྱི་རྣམ་ཐར་ཁྲི་ཐང་ཛྙཱ་ནས་བྲིས་པར་ས་རྟ་ལ་འཁྲུངས་ནས་བཅུ་གསུམ་ལྕགས་རྟ་ལ་རབ་ཏུ་བྱུང་བར་བཤད་པས་སོ། །གང་ལྟར་འབྲོམ་གྱིས་ཕྱི་དར་དུ་བཞེད་པའི་ས་སྟག་དེ་ནས་ལོ་དྲུག་ཅུ་རྩ་བཞི་འདས་པའི་ཆུ་རྟ་ལ་ཇོ་བོ་རྗེ་མངའ་རིར་ཕེབས། སྐར་རྩིས་པ་རྣམས་ཀྱིས་རབ་བྱུང་དང་པོ་ཚུགས་ནས་ལོ་བཅོ་ལྔ་སོང་བར་ཤེས་ལ། རབ་བྱུང་དང་པོ་མེ་ཡོས་འདི་འཆར་བའི་ཚེ་འཕགས་མཆོག་སྲོང་བཙན་སྒམ་པོ་བལྟམས་ནས་བཞི་བརྒྱ་བདུན་ཅུ་ཐམ་པ་དང་། གཤེགས་ནས་སུམ་བརྒྱ་དོན་བདུན་འདས་ཤིང་། རྗེ་ཁྲི་སྲོང་འཁྲུངས་ནས་ཉིས་བརྒྱ་ཞེ་དགུ། གཤེགས་ནས་བརྒྱ་དང་གྱ་གཉིས་ཡིན་ལ། དམ་པའི་ཆོས་ལ་སྡིག་ཅན་གླང་རྒྱལ་བློན་གྱི་འཚེ་བ་དེ་ཆད་ནས་ལོ་བརྒྱ་དང་ཉེར་གཅིག་ལོན་པ་སྟེ། དེ་ཕྱིན་གྱི་ལོ་རབ་བྱུང་དང་པོ་སོགས་ནས་བསྣན་འོས་རིམ་པར་བསྟན་པས་རྩིས་མགོ་མི་འཁྲུལ་ཞིང་བདེ་བར་སྤྱོད་པ་ཡིན་ནོ། །རབ་བྱུང་དང་པོ་བརྩམས་པའི་རྩིས་གཞི་བྱེད་པའི་ལོ་དག་མེ་མཁའ་རྒྱ་མཚོ་ཞེས་རྒྱུད་ནས་གསུངས་པ་དེ་ཡི་ཐོག་མ་ཉི་སྒྲོལ་བྱེད་ཅིང་སྦྲེལ་ནས་བརྩམས་པ་སྟེ། ལོ་ཚིགས་དེ་ལ་ཉི་སྒྲོལ་དྲུག་ཅུ་སྐོར་ལོངས་པ་དྲུག་དང་མ་ལོངས་པ་གཅིག་བཅས་བདུན་ཡོད་པའི་དང་པོ་ནི། འཕགས་མཆོག་སྲོང་བཙན་ཞབས་ཀྱི་དགུང་ལོ་རེ་བརྒྱད་བཞེས་སྐབས་དང་། གཉིས་པ་འདུས་སྲོང་མང་རྗེ་དང་། གསུམ་པ་མེས་ཨག་ཚོམ་ཅན་གྱི་དུས་དང་། བཞི་པ་ཁ་ཅིག་གིས་གུ་རུ་པདྨ་ཀ་ར་སྲིན་ཡུལ་འདུལ་དུ་གཤེགས་པའི་ལོ་ཤིང་སྤྲེལ་ཡིན་ཟེར་བས་དེ་ཚེ་དེར་བཟུང་དགོས་ལ། ལྔ་པ་གནམ་ལྡེ་འོད་སྲུང་གི་དུས་དང་། དྲུག་པ་ལོ་ཙཱ་བ་རིན་ཆེན་བཟང་པོ་དགུང་ལོ་ཉེར་བདུན་དང་སྨད་འདུལ་དར་ནས་ལོ་བདུན་པའི་སྟེང་ཡིན་ལ། བདུན་པ་དྲུག་ཅུ་སྐོར་མ་ལོངས་པའི་ཤིང་སྤྲེལ་དེར། དཔལ་ལྡན་ཇོ་བོ་རྗེ་དགུང་ལོ་བཞི་པའི་སྟེང་སྟེ། ཤིང་སྤྲེལ་དེ་ནས་ཞེ་གསུམ་འདས་པ་ན་རབ་བྱུང་དང་པོ་ཤར། དེ་ཚེ་ཇོ་བོ་རྗེའི་དགུང་ལོ་ཞེ་དྲུག་སྟེང་ཡིན་ནོ། །རྩིས་ལོ་དོན་དུ་གཉེར་ན་བདེ་བླག་ཕྱོ་(ཡོང་)བ་(བའི་)ཕྱིར་སྐབས་འདིར་ཅུང་ཟད་སྤྲོས་པའོ། །ད་ནི་དཀྱུས་ཀྱི་དོན་ནི། གོང་ལྟར་ཤིང་སྤྲེལ་དེ་ནས་ལོ་གཉིས་ལོན་པ་ན་མེ་མཁའ་རྒྱ་མཚོ་ལ་ལག་དོ་ཟླ་བས་སྦྱངས་ལྷག་ལོ་ཉིས་བརྒྱ་ཉེར་གཅིག་གི་མགོ་མེ་ཁྱི་ཤར་བ་དེ་ཡིན་ནོ། །གོང་གི་འཕྲོ་ཤིང་སྤྲེལ། དེ་ཡང་ཕྱི་དར་ལ་འདུལ་བའི་སྡོམ་རྒྱུན་གསུམ་བྱུང་བ་སྡེ་པ་གཞི་ཡོད་སྨྲ་འབའ་ཞིག་པ་སྣང་ཞིང་། དེ་ལས་སྟོད་འདུལ་ནི་ཧ་ཅང་འཕེལ་བ་མ་བྱུང་བར་མངོན། སྨད་འདུལ་དུ་གྲགས་པའི་མཁན་པོ་ཞི་བ་འཚོ་ནས་བརྒྱུད་པ་འདི་ཉིད་གོང་དུ་བཤད་པའི་ཆུ་གླང་གི་ལོ་ལ་དབུ་བརྙེས། ས་སྟག་ནས་ད་བར་གྱུར་ཏེ་རབ་བྱུང་གསུམ་པའི་ཤིང་བྱ་བར་མི་ལོ་ཉིས་བརྒྱ་དང་དོན་གཉིས་རིང་དགེ་བསྙེན་དང་རབ་བྱུང་དགེ་ཚུལ་དགེ་སློང་རྣམས་སྡོམ་རྒྱུན་འདི་ཁོ་ནར་བརྟེན་པ་ཤས་ཆེ་ཞིང་། བཀའ་གདམས་ཀྱི་དགེ་བསྙེན་འབྲོམ་དང་། དགེ་སློང་ཁུ་རྔོག་གཉིས། སྐུ་མཆེད་གསུམ། གླང་རི་ཐང་པ། ཤ་ར་བ། སྣར་ཐང་བ་སོགས་མཐའ་ཡས་པ་དང་། བཀའ་བརྒྱུད་ཀྱི་འབྱུང་ཁུངས་ཆེན་པོ་དྭགས་པོ་ལྷ་རྗེ་དང་། ཁམས་པ་མི་གསུམ། འབྲི་སྟག་འབྲུག་པ་སོགས་ཀྱིས་མཚོན་བསྒྲངས་བར་དཀའ་དང་། རྙིང་མ་ཡི་ཟུར་ཆེན་འཛམ་འགྲོ་བའི་མགོན་པོ། ཀཿདམ་པ་བདེ་གཤེགས་སོགས་འབྱམས་ཀླས་པ་དང་། གཞན་དུ་མཁས་གྲུབ་ཁྱུང་པོ་རྣལ་འབྱོར་ཡང་རྡོ་རྗེ་གདན་པས་ལུང་བསྟན་པ་ལ་བརྟེན་གླང་རི་ཐང་པ་ལ་བསྙེན་པར་རྫོགས་པར་མཛད་པ་དང་། བཀའ་གདམས་གསར་པར་གྲགས་པ་གངས་རིའི་ཁྲོད་འདིར་འདུལ་འཛིན་རྣམས་ཀྱི་གཙུག་ནོར་མཁན་ཆེན་ཞི་བ་འཚོ་ཡི་གདུང་འཚོབ་ཤར་ཙོང་ཁ་པ་ཆེན་པོ་ཡང་སྨད་འདུལ་གྱི་སྡོམ་རྒྱུན་འཛིན་པར་གྲགས་པས་མཚོན་ཡུན་རིང་དུ་ཆོས་དར་བར་གྱུར་ཞིང་། ད་ལྟ་ཡང་སྡོམ་རྒྱུན་མ་ཆད་པར་གནས་པ་འདི་ནི་རྒྱལ་བས་མཐའ་འཁོབ་བོད་ཡུལ་འདུལ་བར་ཐུགས་རྗེས་སྤྲུལ་པའི་སྐུ་ཨུ་པཱ་དྷྱ་ཡ་བོ་དྷི་ས་ཏྭ་ཡི་སྨོན་ལམ་གྱི་མཐུས་རྒྱུན་ལྡན་དུ་བྱིན་གྱིས་བརླབས་པར་ངེས་པས་སྙིང་ནས་གུས་པ་ཆེན་པོས་རྟག་ཏུ་ཕྱག་བྱ་བའི་ཡུལ་ལོ། །འདིར་འཕྲོས་པ་སྔོན་དུས་ཀྱི་སྐྱེ་བོ་སྐལ་བཟང་ཤེས་རབ་དང་། བརྩོན་འགྲུས་མཆོག་དང་ལྡན་པ་མང་ཞིང་། ཆོས་འདུལ་བ་ལ་ཤིན་ཏུ་མཁས་པར་སྦྱངས་བ། འདུལ་བའི་མཁན་པོ་ཆེན་པོ་ཁ་སྐོང་དད་པའི་དགེ་སློང་ཡང་བླང་དོར་གྱི་དོན་གསལ་བར་བྱས་ཏེ། འབད་པས་རྒྱ་ནག་ནས་ཧ་ཤང་དག་འགུག་པར་མཛད་པ་སོགས་དྲི་མ་མེད་པའི་ལུགས་སྲོལ་ལྷུར་ལེན་པ་དེ་ཡི་སློབ་ཚོགས་ཆོས་འདུལ་བ་ལ་མཁས་པ་སྤྱི་དང་བྱེ་བྲག་དབུས་གཙང་མི་བཅུ་སོགས་བཞུགས་བཞིན་པའི་མདུན་སར་ཤིན་ཏུ་རྨོངས་པའི་ངང་ཚུལ་གྱི་྿ཆུ་གཏོར་མ་དང་དར་བས་མས་྿སྡོམ་རྒྱུན་དུ་འདོད་པ་ཡང་མི་ནུས་ཏེ། དེ་ལྟར་བྱས་པར་གྲགས་པ་འ་འབྲེ་གཉིས་ཀྱང་སྐྱེས་བུ་དམ་པ་ཡིན་པར་སྣང་བས་དེང་སྐབས་ཀྱི་མཁན་པོ་ནང་ཕན་ཚུན་ཕྱོགས་ཀྱིས་བསླད་པའི་གཏམ་རྒྱུན་ཆགས་པ་ཞིག་ཏུ་ཟད་ཀྱི་ལོག་རྟོག་སྲུང་བ་དེ་དག་ལ་ཡང་དག་པའི་སྣང་བ་སྦྱངས་པར་འདོད་ཅེས་སོ། །བར་འདུལ་དུ་གྲགས་པ་ནི་བསྐལ་བཟང་སངས་རྒྱས་བདུན་པ་རབ་གསལ་གྱི་རྣམ་འཕྲུལ་པཎྜི་ཏ་ཤཱཀྱ་ཤྲི་རབ་བྱུང་གསུམ་པའི་ནང་ཤིང་བྱི་ལ་བོད་དུ་ཕེབས་ནས་ལོ་བཅུ་བཞུགས་པའི་རིང་བདག་ཉིད་ཆེན་པོ་ས་སྐྱ་པཎྜི་ཏ་སོགས་བསྙེན་པར་རྫོགས་པའི་དགེ་སློང་ཇི་སྙེད་པ་ཞིག་བྱུང་། དེ་ལས་སྟན་གཅིག་གི་བརྟུལ་ཞུགས་འཛིན་པ་རྡོ་རྗེ་དཔལ་དང་བྱང་ཆུབ་དཔལ་གཉིས་ལས་དགེ་འདུན་ཚོགས་སྡེ་བཞི་འཕེལ་བ་ལ་བརྟེན་འཇིག་རྟེན་མགོན་པོ་ཇོ་ནང་པ་མཁས་མཆོག་བུ་སྟོན་སོགས་ཕྱིས་བྱུང་གི་དམ་པ་མང་པོ་ཞིག་གི་སྡོམ་རྒྱུན་དེ་ལ་བརྟེན་པར་མཛད་པས་རབ་ཏུ་དད་པས་འདུད་པར་བྱའོ། །ཕྱི་དར་བསྟན་ཞེས་འདུལ་བསྟན་ནུབ་པ་སླར། །སོས་ཏེ་དགེ་འདུན་ཚོགས་གྱུར་བྱུང་བ་ལས། །གོས་ཧྲུལ་ནང་དུ་གསེར་གྱི་སྐུ་བརྙན་བཞིན། །སྔགས་བསྟན་མ་ནུབ་གནུབས་སོ་ཟུར་གྱིས་མཚོན། །དོན་བསྒོམ་སྙིང་པོ་ཨ་རོའི་རིངས་ལུགས་ལ། །དཔལ་ལྡན་ཇོ་བོས་བསྔགས་པ་ཡང་ཡང་མཛད། །ཅེས་སོ། །ཇོ་བོ་རྗེ་བོད་དུ་བྱོན་པའི་སྐབས་སྙིང་པོ་དོན་བརྒྱུད་ཀྱི་བསྟན་པ་བྱང་ཆུབ་སེམས་ཀྱི་མན་ངག་འཛིན་པ་མང་ཡང་གྲགས་ཆེ་བ་ཨ་རོ་ཡེ་ཤེས་འབྱུང་གནས་ཡིན་ལ་དེ་ཡི་བསྟན་བཅོས་ཐེག་པ་ཆེན་པོའི་རྣལ་འབྱོར་ལ་ཚིག་སྙན་དོན་བཟང་ཞེས་མཆོག་ཏུ་དགྱེས་ཤིང་། ཨ་རོའི་སློབ་མ་ཟངས་དཀར་མཛོད་ཁུར་ལ་ཡང་གུས་པས་ཕྱག་མཛད་པ་དང་། ཨ་རོའི་ཡང་སློབ་སྦ་བསྒོམ་ལ་ཀུན་རྫོབ་བྱང་ཆུབ་སེམས་ཀྱི་བོགས་བཏོན་ནས་དོན་དམ་བྱང་ཆུབ་སེམས་ཀྱི་བོགས་འཇམ་དཔལ་དང་བྱམས་པས་འདོན་པར་དབུགས་དབྱུང་དང་། དགེ་བའི་བཤེས་གཉེན་པུ་(པོ་)ཏོ་བ་ཆེན་པོས་སྦ་སྒོམ་ལ་སེམས་ཕྱོགས་ཀྱི་མན་ངག་ལེགས་པར་གསན་ཅིང་དུས་ཕྱིས་དགེ་བའི་བཤེས་གཉེན་ཆེན་པོ་གྱུར་པ་ན་དེ་དམ་པའི་ཆོས་རྣམས་དག་ཉིད་དུ་དགོངས་ཏེ་ཡི་དམ་དུ་མཛད་པ་སོགས་སྔགས་ཀྱི་བསྟན་པ་རྣམ་དག་མ་ནུབ་པ་རྒྱུ་མཚན་དུ་མ་དང་བཅས་ཤིང་། འོན་ཀྱང་སོ་སྐྱེ་ཁ་ཅིག་བདུད་ཀྱི་བྱིན་གྱིས་བརླངས་པར་སྤྱོད་པ་རེ་ཟུང་བྱུང་བ་ཇོ་བོ་བྱོན་པ་ནས་ཞི་བ་དེའི་བཀའ་དྲིན་གྱིས་ཁྱབ་པ་ཡིན་ནོ། །ཞེས་པ་ཡང་འདིར་འཕྲོས་པའོ། །དེ་སྐད་ཆོས་ཀྱི་རྒྱལ་པོ་བཙད་པོའི་རབས། །བསྟན་པ་ཕྱི་དར་དུས་ཀྱི་ངང་ཚུལ་བཅས། །རང་བཟོའི་སྐྱོན་མེད་གཞུང་མང་མཐོང་ལས་བཏུས། །འོན་ཀྱང་སྐྱོན་མཆིས་སྤྱན་ལྡན་མཆོག་ལ་བཤགས། །དགེ་མཆིས་འགྲོ་ལ་ཡོངས་སུ་བསྔོ་བའི་མཐུས། །ཆོས་རྒྱལ་ལོ་པཎ་བཀའ་དྲིན་རབ་དྲན་ནས། །དེ་ཡི་དགོངས་པ་བསྐངས་ཕྱིར་དམ་ཆོས་ལ། །ལེགས་སྤྱོད་འཇིག་རྟེན་མགོན་པོ་མྱུར་འགྲུབ་ཤོག །ཅེས་ལྷ་བཙད་པོའི་གདུང་རབས་དམ་པའི་ཆོས་ཇི་ལྟར་བྱུང་བའི་རིམ་པ་མདོ་ཙམ་སྨོས་པ་འདི་ཡང་རིག་པ་འཛིན་པ་རྒྱལ་ཁམས་པ་དཔལ་ཚེ་དབང་ནོར་བུས་རབ་བྱུང་བཅུ་གཉིས་རྫོགས་པར་ཉེ་བར་ཀྲོ་དྷ་ཞེས་ཤིང་མོ་གླང་གི་ལོ་སྨིན་དྲུག་ཟླ་བའི་དཀར་ཕྱོགས་དགའ་བ་གསུམ་པར་ཤར་ཕྱོགས་ཤིང་ལོའི་ཚལ་ཀོང་ཡུལ་ཉང་ཁ་ལྗོན་པ་ཀླུང་བསམ་གཏན་གྱི་ཁང་བུར་སྣང་གསལ་གྱི་མདངས་སུ་བཀོད་པའོ། །འདི་ནི་རང་སྟོབས་རིག་པ་ཁོ་ནའི་སྤྱོད་ཡུལ་མ་ཡིན་པར་གཏན་ཚིགས་ཁོ་ན་ལ་རག་ལས་པའི་ཕྱིར། སླར་ཡང་དེབ་ཐེར་ཁུངས་བཙན་ཁུལ་ཁ་ཤས་མཐོང་བ་ལ་བརྟེན་ནས་དཔལ་གདོང་ཆུ་བྱ་ལོར་སྟོད་མངའ་རིས་མང་ཡུལ་ཝཾ་ལེར་སྡོད་སྐབས་ཚིག་སྣ་བསྲིང་ཞིང་ཞུས་དག་ཅུང་ཟད་བགྱིས་པ་སྟེ་འདི་ལ་ད་དུང་རྒྱ་ནག་ཐང་གི་དེབ་ཐེར་འགྱུར་དག་པ་ཞིག་མཐོང་ན་དཔྱད་པར་འོས་པ་ནི་ཡོད་ལ། བོད་ཀྱི་ལོ་རྒྱུས་སྔར་གྲགས་ཆུང་བའི་དཔེ་རྙིང་ཁུངས་མ་འདྲ་རྙེད་ན་མ་གཏོགས་ད་ལྟ་ཡོངས་གྲགས་ལ་ནི་གོང་དུ་དཔྱད་བྱར་བྱས་པ་དེ་རྣམས་ལས་གཞན་འགའ་ཡང་མེད་པར་སེམས་པའོ། །དགེའོ། །དགེའོ། །དགེའོ། །</p>",
    "ContentChinese": "<p class=\"chinese-text\">嗡娑帝<br>嗡 瑪呢貝美 吽<br>斯則據聞雪山疆域人主聖尊化身世間自在松贊干布火牛年(617)生，土牛年歲十三掌朝(629)，陽金犬年(710)歲九十又四身化光團入聖尊意，是時太子共松歲十七末登基，十九長殤，執政三年，嗣且稚幼父為攝政，後太子薨，父重掌王政，如是九十又四祀刪減十二，太子執政凡二載不數則親政八十年，子政之年若納之八十有二焉。《遺教》曰：“八十二年為王歲，允臻其祀天子崩。”蓋其事矣。《文殊根本續》授記執掌王政八十載，亦與此相符。<br>後世若干賢者言生於土牛年，若以生於土牛、金犬仙逝論之，則悖乎諸史所載火牛降生，二說不可並立。以雅桑法主教言而論，《青史》中引述其授記：<br>吾人五百末世代，四百二十五年祀。<br>南方天竺王土內，金牛之年中誕生，<br>稱名達瑪巴爾尼，先王陳述如是言，<br>開演等正妙法。<br>如是說云，誠口述筆書矣。方且王於金牛年崩逝，爾後四百二十五年必適木虎或木兔，雅桑之生年土牛不可與相合竟悖之，雅桑法主之《托朗瑪(遺教冊錄)》所述與青史內載年代不符，如是曰：<br>諦聽！噶爾所領七臣輔，吾當陽金犬年歿亡矣，<br>一二算數五百二十祀，繇波國土冰雪山巒間。<br>比丘稱名達瑪巴爾尼，巨牛金年人身降世已，<br>爾所統領內臣七人等，生為其子仍復會晤也。<br>覽觀往古經言眾說弗同實則年代共一，五百二十乃金犬至土牛間吻合，與此列年代自然相符奇哉！依《青史》等若干文獻之見解，顯當添以六十年一周期焉。不論如何，雅桑言生於土牛，莫為王生於土牛之確證，《文殊根本續》所預言乃掌政之期，非身壽之量，“八十年間擁王政”如斯言明示，是以區別生歲與執掌王政之年至要哉！於此之說與昔所有實據舊文同聲共言火牛年(617)生，毋須臆度，金犬歿誠然也，合理可信之述矣。<br>如是聖者觀世音自在化為藏王併窮其朝代于文殊根本續中以是言授記焉：“善逝如來此教言，種種形相行事業，依于嚮北之方位，彼時機中當出世，名曰拉丹(神境)地方之，雪國山區內安居，稱名人中之天王，離車毘等種姓生，其人修持密咒法，將具資財與高壽，聰慧受用富裕如，世人之主亦當之，掌持王政八十載，彼能遣除盜賊寇，國王命終壽盡已，速疾成就密咒兮，止息增益清涼者，所謂世間救度母，佛母白衣天女與，皎白天女勤利生，恆常意弗倦厭兮，斯等述及繁多位，同理眾多國王乃，各種諸多形相等，各樣色澤各樣貌，雪鄉疆域蠻荒王，亦乃導師當獻供，軼群並與軼群賢，地明且與地明賢，同理威勝制鎮敵，足行等等作示現，地護且與牛犢子，具光王乃列乎後，末後旭日之王儀，蠻荒王相眾各種，爾後朝綱法制崩，外道眾輩相狎昵。”如是授記焉。此與藏地諸多賢哲一致，且郭譯師循努白嘗言：“北方與雪鄉咸著稱，拉丹即拉薩，掌政八十載乃八二有焉，其間共松共贊亦稍攝王政，度母、白衣母、皎白天女乃三賢妃即文成公主、拜木薩、卓薩妥噶，離車毘(Licchavi, Lecchavi)之種姓生即羊八井地區，蠻荒王乃統掌西方大食地方，同理眾王於後出世，軼群即芒松芒贊，軼群賢即隆南，地明即美髯公(美阿匆；赤德祖丹)，地明賢即赤松德贊，威制敵即牟尼贊普，足行即赤德松贊，地護即熱巴堅(赤祖德贊)，牛犢子即朗達瑪，具光王即光護，具與護關聯阿哇底，末後旭日之王，有者以為統掌日出方位至藏土之蒙古王焉，於此或依夏卡之預言，亦可為拜寇贊王也，其後無統治全藏之王，是以宗規敗衰矣。”如是言。他說雖無不當，然論后妃時，當算入漢公主、拜木薩、蒙薩赤姜，共贊之王政二年可不納入松贊之國政年疇，然松贊之掌政八十載作為身壽之量非善也，前述共松之預言置於蒙古地區，制敵者為牟尼贊普亦非妥哉，制敵者乃赤松德贊、足行乃赤松諸子，循次掌持王政焉，此乃吾意，實情亦必然，旭日之王尚待考證。<br>如是世間自在藏王人主松贊干布尊足於金犬年化身攝融之際，芒松生於土犬，滿歲十三，爾後執持王政廿六年，火鼠年逝，父崩七日始生其子杜松芒波杰，出乎諸史，然唐史等若干文獻以金犬祖歿迄三十年間掌政，土兔年逝，云該年芒松坐床忖合理，杜松生年為鼠之論證大抵相符，是年歲四才。杜松芒波杰掌政卅八祀，龍年春子赤德祖丹生，是年冬父崩，翌年赤德祖丹繼位，文獻多載。方其時祖父終壽火龍年，其掌王政七十四載，亦有六八、六三、五五、五一等說法甚多。多數紀載父崩時子赤松德贊齡將十三，與唐史一致，若干王統朝史載父逝而子於七、八歲蒞祚，此乃奸臣佞黨扶立幼主，推知年幼父崩，合也。｛然以能親政之始為準，確旺尊者言天梯伏藏於五百零三年，按今天竺王統年法，由十三金馬年起算，吉祥桑耶奠基，較此晚八載，是為土虎年，與天梯伏藏埋藏時機概估無悖逆哉，此仍當詳考，茲不贅述，另論。｝若爾，先帝火蛇年始而掌政六十七祀，水亥年歲六八崩，該時，赤松德贊太子土馬年生歲六才，七歲木鼠年踐祚。餘諸史料載芒松掌政三十年，杜松掌政廿六年，美阿匆掌政五一年，見述於采巴《紅史》。方是時，松贊歿之金犬年迄至美阿匆逝之木羊年間，歷時一百廿六祀，此說較水亥尚少廿八年許，於年代顯然有增闕，復欲細考漢地史料焉，茲赤松德贊七歲踐祚，掌理王政四十九年，第五十祀水牛年王政禪讓與太子牟尼贊普，依漢史料則水牛後歷八年，六三金猴年崩，寧瑪諸史併布敦大師主張於六九歲火虎年身逝，若干伏藏預言亡於六八歲牛年辰月望。於此三說，有取後者，則王政付予太子後十二載，第十三載木牛年壽終。聖尊松贊干布金犬年歿而後歷百廿八年，土馬年赤松德贊生，其於木牛年逝時，先王歿百九十五年矣。其後子牟尼贊普統政一年又九月或年七月或年三月，乃至父崩後六月逝世，眾說皆有。爾後牟如贊普始坐掌王政然未久長，落馬而殞，諸史共載，牟如崩殂之墓列入歷代皇陵，無論在位短長，確住皇座矣。又有承許牟如與牟底同人實不妥矣，復有承許牟赤與牟底殊而先後掌政，與牟赤與牟底同人二說，後者較合我心，然仍待察。持前者眾，姑從此說，言之則牟赤於父歿時歲廿二，歷三載自齡廿五土龍年即位，往後六年水雞年蓮師詣降伏羅剎矣。牟赤掌政八年已於卅二木亥年逝，方是時弟赤德松贊亦名牟底贊普，木虎年生，四歲之時，為試其志立其為王，父授寶冠累現禎祥，頂飾寶沉首稍偏曲，故號薩納勒金勇(曲項王)，彼歲十二，父赤松德贊崩、廿二祀兄逝而於獅座登基，前後二期，執政凡廿一載，築噶炯(嘎爾瓊，2013)多吉英寺，四十二歲木羊年歿，牟赤與薩納勒二人掌持王政合廿七載，赤松德贊崩已歷三十祀，或曰牟底之子為赤德松贊亦言薩納勒，然逕與噶炯碑文悖哉，薩納勒實乃赤松德贊之子，當信其真。天子赤熱巴堅生於父薩納勒歲廿九水馬年，十四歲父崩，該年踐祚，彝泰初年立號，其掌持王政按漢史料紀載，凡二十有二年，火龍年崩，然藏地舊史咸稱歿於金雞年，若爾是時統朝廿七祀矣。此天子熱巴堅，於娘氏與確旺二師之生世譜系預言中說為赤松德贊之轉世。又赤松德贊壽終旋生為三十三天王帝釋之子天王光無邊，歷人壽十六載，為侍奉佛教珍寶故，復降生為自宗嗣，蓋示遷化之相，其住世僅半時辰耳。藥叉達瑪烏冬贊生於木羊年，甫二月而父崩，及長，兄築烏香多伽藍，佐之，達瑪亦建芝儀寺等，歲廿七金雞年獲取王政，初年尚循世俗常規，爾後奸朋煽動邪魔蠱惑六月行惡，後專損佛教珍寶，歷七月有半，越三載水亥年，釋迦比丘持金剛喇隆貝吉多傑暗矢殛之，送入黃泉，朗達瑪伏誅之歲，或曰金雞、水犬、木牛、火虎年，然前二說非是，後二說尚可，然正典所載，方為的據。<br>此喇隆貝吉多傑乃迦納咕瑪拉(智童)弟子，公許為八賢之一。歲十七於巴卓虎穴謁咕如蓮師尊顏，為空行伊喜措迦攝受，上師與本尊天授記為降魔勇士故名喇隆，《上師意集之秘密預言》云：“天子牟如甫歿，旋生是日。”是時當生於火虎或火兔年，誅滅罪王時，歲將五八，後於康區，助喇欽貢巴饒色補足近圓戒，覓漢地二和尚為之證盟，又聞其晚年授南德光護王《藥師八佛經儀》口傳，世壽當逾八十，於斯雪域佛教珍寶功德超卓，當憶眾恩為恆禮處。<br>聖地疇宇大士應化身，地護善趣莊嚴人之主，<br>佛陀授記勝教指導師，天子王臣眾前恆頂禮。<br>但為正法長住遠流故，奉持聖賢傳記彌精進，<br>貝吉多傑等無畏諸尊，眾位大德景仰胡不生。<br>如是云。<br>藏王哈贊普無垢裔朗達瑪擁二妃，妾蔡邦薩贊姆媻於金雞年有娠，水犬年初誕一子，具足相好，恐妻奪弒，夜巡宵防列燈繞環，取名光護，此人雍容爾雅秉性賢良，是時若干臣子亦言為前王之嗣，光護生已，翌年朗達瑪王歿時，納南薩生一嬰示與眾臣，始生有齒群臣疑之，然婦脅迫堅稱，遂名雍丹(母堅王)，朗王殂逝，奸佞之流敗官惡吏猶欲傷教害法，然威令不行，未幾，其黨多有慘喪，難忍可怖，多有證實眾且危懼哉，信法諸賢臣亦從中勸諭。木牛年末，毀佛綏定，此木牛年，距赤松德贊崩殂之木牛，恰六十載一甲子矣。<br>火虎年光護與雍丹亦於佛前受皈依，供養三寶，王子既長，是為南德光護，其子嗣據有約茹之地，以《藥師經儀》為本尊心咒，恭虔三寶至篤哉，世壽或曰六三、四九、三九，以後說為是，其妃鳩若薩王后於王廿四歲木雞年生子貝寇贊，父崩翌年金牛年乃踐祚，以卓‧楚克札囊、張阿頗二臣輔政，築八伽藍，桑迦卜師預言王將殂於羊年，歲卅五也。<br>岭‧格薩爾王亦於南德光護此父子年間應世而出，朗氏先祖蔣秋哲郭以格薩爾為施主焉，蔣秋哲郭言為咕如蓮師化身、格薩爾為赤松德贊化現，於《朗經首函》中有載格薩住壽八十八之授記，據此可知格薩出現之時，故毋慮度其先後(先生時并後歿時)，寧瑪若干認許格薩爾為王化身，與朗氏說合。然吾根本上師言：格薩爾乃金剛善之化身，情亦必然，若言為利藏土，應赤松王之囑託或願力，金剛善受生人間，亦無相悖之處。後世史家，多曰此先祖蔣秋哲郭蓋咕如蓮師住於藏地時之親授弟子，然咕如蓮師於朗貝吉僧給預言云：“爾等朗氏具緣者，吾之悲意將普覆，爾乃具緣士夫也，於爾天族苗裔中，當出蔣秋二字者，殊越後代當來儀，彼乃吾之心子哉。”又言蔣秋哲郭嘗取蓮師伏藏，故知非蓮師駐藏之親授弟子也，據云蔣秋哲郭歲一百零八火龍年十一月初十示寂，其四子中，次子即年托阿憧，六代傳至雲欽格哇迦。其子朗哈斯，為帕摩竹巴基業之始護。堅阿尊者生於帕竹歿後六年木羊年，歲卅四土龍年登帕竹祖庭寶座，住廿七載，其後木牛年堅阿之宗侄嘉瓦托篤繼位，爾後此脈由侄輩傳承，至聞名於世之乃東王，次第傳至諾布間，今時宗嗣已絕，時第十二遶迥年中。茲旁述焉。<br>今言正文。貝寇贊有二妃，各生一子，幼妃晴薩尊涅生長子赤札西澤巴貝，長妃那南薩列尊生次子吉德尼瑪貢，兄掌臧娘堆江卡澤，其妻鳩若薩貢貝生貝德、沃德、吉德三子，世稱下部三德，兄貝德迎娶鳩若薩巴瑞，生兄沃巴德與弟達瑪雜扎二人，貢敦貝吉所造文獻有載：沃巴德往詣貢塘。眾說或言，貝德赴貢塘，然不確，貢塘王諾布德所造朝代史云貝德之子乃瑪波贊，斯則當為沃巴德別號焉。自此貢塘王統綿延，撮其要者：<br>沃德赴貢生子沃瑟德，爾後依序蝶究德旺德，<br>贊德其有三子兄沃德，此與密勒身壽暮年同，<br>其子依序旺秋德鳩德，貢德尊德其之后妃中。<br>帕巴法王之姊尼本也，其生子嗣本德貢法王，<br>其三子之次子仁欽桑，桑子確炯德即貢塘處。<br>安住第十三代時期也，此說蓮師預言同一致，<br>確炯德子言為札西德，即同取藏咕滇巴法主。<br>爾後彭措德與索南德，哈旺堅參國王南迦德，<br>桑德根嘎羅珠根嘎札，桑德後者其子索旺德。<br>如是未算兄弟王統支，單計父子廿三王代末，<br>第十遶迥陽金猴年時，臧巴國王興兵取貢塘。<br>蓮師稱頌貢塘之鼎祚，雪域福緣德份止於此，<br>爾後逾廿一載金蛇年，厄魯和碩特奪臧巴政，<br>金蛇乃至方今木牛間，歷時人壽百又廿五祀。<br>以及，阿里班禪昆仲史傳中，承許生於貢塘王族，又南迦德王多子，長兄諾布德長居珞隅，其子蔣揚仁欽堅參生七子，兄阿里班禪乃無諍大取藏師，終生嚴持比丘淨戒，弟列滇公認為阿里持明，亦取藏師，生子貝瑪迦波，爾後氏族委靡，兄弟數人之裔，今存珞隅瑪塘，支系單薄，皆屬貢塘王族焉。<br>據聞貝德之子達瑪雜扎，其裔為拉孜巴、喇隆孜戈巴、魯嘉巴、奇巴等族，皆知名於世。三德之中，沃德生四子，其裔分布臧絨、雅礱乃至康區之臧喀，幼弟吉德遷雜達那，有六子，其族繁衍。是故三德之世，宗支蕃盛，廣布四方。又貝寇贊王之次子吉德尼瑪貢往赴阿里，築普蘭尼瑪松宮堡，建成慶宴之時，虛空傳響授記之言曰：<br>有情共同事業善圓成，稱曰尼瑪是為善友伴。<br>普蘭之地藏土王舍興，佛陀教法之日今初升。<br>眾咸普聞，稀有禎祥紛現焉。其生三子，世稱上部三貢：日巴貢、札西貢、德祖貢。長子日巴貢據瑪隅至珠夏之間，次子札西貢據祥雄及雅澤，幼子德祖貢據彼堤、鳩、桑嘎三地。此說有據，他說谷格與普蘭分屬二貢，非也。札西貢之二子，松伊與寇熱，松伊領谷格、寇熱領普蘭，松伊與寇熱本名實為張松德與寇洛德，此說見於阿里貢塘古卷，考之甚確。張松德之子，名那伽羅闍、德瓦羅闍，其延請若干班智達，並遣仁欽桑布大譯師等赴天竺習法，於釋教廣利哉，然今諸史咸稱此事為其後之拉喇嘛所為，若果如此，則拉喇嘛住世須近百齡，阿底峽入藏時，大譯師稱歲八五故，拉喇嘛必愈老耄。《阿里貢塘史》載：拉喇嘛屬羊，住壽七十八。是則拉喇嘛與大譯師只差一歲，該史又載：那伽羅闍與德瓦羅闍出家為僧，法名蔣秋沃、寂哇沃。此事源流，似仍待考。暮年王位付弟寇熱，父子三人出家為僧，父稱拉喇嘛也謝沃，寇熱之子拉德，其有三子，今史同稱次子蔣秋沃，其迎請阿底峽入藏等，於法教浩德隆恩，弟沃德亦迎請迦那室利班智達等，沃德之子澤德，遣鄂譯師赴天竺等饒益教法。其後五代，有族輩遷雅澤，歷八代餘，虔供佛教，爾後宗氏絕，門隅臣巴利羅闍取獲王政，今稱朱木利者是也，於普蘭宗代脩遠，至第十一遶迥年間，世系衰沒。祥雄腹地谷格，王統相承，末代之主生於第十一遶迥火龍年，壽六十有八，近第十二遶迥末，水亥年翼宿月某日逝，殯禮進獻諸喇嘛，余所得份，駐貢隅江源時官府遞之。自此谷格王統斷絕，遺二女，幼女嫁與瑪隅拉達克王，生二子。瑪隅王日巴貢其繁旺宗嗣，即拉達王統。然莫爭史實乃達香王之宗嗣，今雖貧弱，於錫金、努比、卓堆等地，尚存零散耳。<br>天族護法王宗族，生衍各代概略要，<br>堪信浩卷眾史籍，循依而述紀於此。<br>如是矣。<br>赤雍丹王之子赤德貢，其子日巴貢，其子多傑巴，其有二子：兄赤旺秋贊、弟赤巴，兄之子喇贊普耶謝堅參譯師，精通梵文，喀惹紐譯師亦為其徒，阿底峽未蒞藏土約二十年前，班智達貝瑪桑哇蒞之，其為《句義結合解脫疏》等之譯者，赤旺秋贊彼父子在位期間，有康區至衛藏五或十人取受戒律師承，啟法教後弘期，恩德恢偉，弟赤巴有四子，幼者菩提羅闍也，與阿底峽蒞桑耶寺同期，其宗嗣於拉達克，今號喇贊元莫者，本名喇旺嘉措羅珠，於桑耶烏孜殿取出伏藏《死主命輪》，又有拉直貢巴等人，後輩繁出。此說乃憑史據而述哉，至於耶謝堅參之子為赤巴之說，莫混淆焉。<br>雍丹之嗣佈於桑耶、多、溫，康區亦多，工布堅嘉波亦雍丹後嗣焉，達波耶哈迦日哇，或曰光護後嗣，然多曰為喇智崗哇之嗣矣。總之，南德光護與赤德雍丹之後嗣雖蕃衍而今於阿里、前後藏等地能明確指認者，但此文所述零散耳，不復見之，鮮寡終亡矣。康區中部昂雪阿努氏族，人數眾多，亦屬王室，然仍考之於比丘噶瑪恰美所撰地方志文獻或口耳相傳之說，又大成就者噶瑪巴希之言：多康下部贊普鄔爾氏族乃薩納勒王旁支脈統。蓋確然哉！<br>於戲！前朝懿代之言說，善正流風聖者妙寶財，<br>雅士善妙清淨諸種姓，宛若晚秋英華茲悲兮。<br>雪山皓嶺環繞此域中，善緣圓滿佛陀薄伽梵，<br>能仁王日流統遵照循，眾位導引法王盍歎哉。<br>其之宗氏珍寶黃金鬘，歷世於佛教法秉丹忱，<br>具無畏者人中之獅子，眾位聖者余意曷欣哉。<br>是以於彼諸位意恪虔，衷內恆常稱歎述言詞，<br>發陳此亦非為無實義，光昌釋教佛法歎吟兮。<br>如是矣。<br>藏地法教，後弘期僧伽律藏之緣起，據鄔金巴成就者依於某帕摩竹巴耆老之言：前弘衰微後弘發軔，歷廿五或三十年。傑‧祖喇陳瓦以為：“水牛年，衛藏十人中，祿墨‧楚臣喜饒與堪烏竹瑁行抵門卡哲布，祿墨等人以為斯乃後弘之始。”堪欽達瑪師利《日光論》中所認後弘之年亦同乎此，金雞年逾五十二祀之水牛年焉。布敦大師依循衛藏老嫗之言，主張金雞年迄後弘之間，約莫七十或七三等年載。依後說為水雞、循前說為金馬。種敦‧迦崴炯內主張金雞後，歷七十七載空法期，土虎年為後弘之始。<br>又薩迦‧喇嘛丹巴按《國王遺教》：<br>稱名吉祥之比丘，將能度脫戴罪王，<br>爾後滿八干支周，佛陀教法將沒亡。<br>如是云。金雞至空法期歷八輪年數，並始末二年，凡九十八祀，至土犬年後弘始。聶巴班禪門朗楚臣以為金雞迄百八年間未生律法，故後弘之始乃土雞年。<br>如是，律教僧伽部後弘年代，有此五說。<br>前者鄔金巴成就者於土羊年行抵雅礱時，會晤熱巴堅，其間歷二百一十七年，此羊年顯即噶瑪巴希仙逝之水羊年，是水羊年前推至傑‧京俄瓦出世之木羊年間，凡百又九祀。復上推至帕摩竹巴出世之金虎年間，合六五年。又迄阿底峽尊者抵藏之水馬年間，凡六八載。斯等總和年數難考，然金雞年起廿五或三十餘年立後弘期，應為木雞或水龍年間，因念以喇欽波本身出家或育徒之時為律教始，可也。<br>其二乃，若有祿墨親傳弟子或稍後文獻明載，爰可信哉。衛藏五或十人從喇欽波受戒，時間前後相應則可，非則當察其三承許焉。<br>其三乃，或曰洛敦‧多傑旺秋、聰尊‧喜饒僧給立僧伽部時，然祿墨之親授弟子拔希涅丹言：“祿墨由喇欽之徒楚喜饒秋取受律儀。”此外，祿墨與僧巴乃同期，拔希涅丹云：“吾大善知識祿墨‧楚臣喜饒、僧巴‧伊喜羅珠二人初據隆穴金貝谷立業未功，後於雞年建摩熱傑寺。”見有如是載述。<br>種敦巴勸請前藏諸善知識迎迓阿底峽尊者之書信中亦述：“最初復興比丘制度師，尊欽‧伊喜羅珠等……。”若後弘為水牛年，此際阿底峽水馬年入藏時，松巴已屆九十，與前尚有受比丘戒之歲數，算來必百又十餘祀焉，聞祿墨壽考，若僧巴亦同高壽，尚可說通，否則難以契合。前述堪布傳承與一般年代推算，後弘始元土虎年相不悖哉，又大師之親授弟子雖乏造經堂之力，然已於水牛年詣此，往後廿五載屆土虎年，具菩薩恢弘願力者祿墨與僧巴等人來儀，比丘僧團昌盛，伽藍廣興，當應乎理。<br>其四乃，許暫且拉薩未立僧團。<br>其五乃，祿墨土雞年啟建摩熱傑寺為法教後弘之始謬哉。<br>如是法教後弘期之始若為水牛年，則於仁桑大譯師出家十七年前；若為土虎年則為僧已逾八年，赤唐迦納所著大譯師傳載：“土馬年生，歲十三金馬年剃度。”<br>總之，種敦巴所許後弘土虎年後六四祀，水馬年阿底峽尊者行抵阿里。星象師立遶迥已逾十五年。第一遶迥火兔年始時，距聖尊松贊干布出世已四百七十載，距其示寂三百七十七年；距赤松王生歷二百四十九年，歿而百有八二也；距罪朗王臣危斷正法，爾來百有廿一年矣。此後初勝生周等，依次相加，則綱目不謬，是易行歟！<br>首創遶迥之推算所基，乃續典所載火空海(四零三)之年也。其法，則以此期之始，與日度相繫而起算。<br>此年間，有日度之期，盈一甲子者六，未盈者一，合為七。其一、聖尊松贊王歲六八時；其二、杜松芒王之世；其三、美阿匆時；其四、或云咕如貝瑪嘎啦往羅剎國調伏之木猴年，當以此定；其五、南德光護之世；其六、仁欽桑波大譯師歲廿七且東律興已七載時也；其七、六十週未足之木猴年，方具德阿底峽歲四才，木猴已逾四三載始第一遶迥，是時阿底峽歲四六也。易於曆算，於此略陳。<br>今言正義，如前述木猴後滿二年，火空海以閏月調整，餘二百二十一祀之初，逢火犬年是也。木猴年，後弘期律教三統，皆根本說一切有部，分出西律未見其昌。<br>堪布寂護所傳東律，發軔乎前述水牛年間，土虎迄第三遶迥之木雞年間，凡二百七十二載，優婆賽、沙彌、比丘等多依是律，分支龐博：噶當之種居士、比丘二庫鄂、三同門、朗日塘巴、夏惹瓦、納唐巴等無數人；噶舉之要源塔波拉傑、康巴三人、智達竹巴等難計其名；寧瑪之大宿、臧卓崴貢波、噶當巴德夏等無數人，其他如成就者瓊波瑜伽士，亦依金剛座授記，從朗日塘巴受具足戒。新噶當派雪域律藏頂嚴堪欽寂護之紹繼宗喀巴大師亦持東律戒統，表斯遠長昌隆，今仍戒統不斷長住，茲勝者調伏遐荒藏區悲意化身鄔巴達雅菩提薩埵之祈願力流存加持故，是必衷虔常禮之境歟。<br>於此插言：夙善緣士，多具妙慧精進，於戒律之學，研修至深，補足傳戒之比丘數者，亦明辨取捨，乃至勤延漢地和尚，凡此諸行，擔負無垢宗統，其徒眾通達律儀，如若前後藏十人，尚住於世，凡夫庸庶水施巾拭，妄稱戒脈者不能立。如是阿、哲二人顯亦大德，當代學者之說，蓋宗派偏見之流言。吾欲為此等邪見者，開示正見之光明。<br>曰中律者乃賢劫七佛通明玄化班智達釋迦室利於第三遶迥年間歲木鼠入藏安居十年，邃生至尊薩迦班智達等所有受具足戒比丘，其中，由持一座齋之多傑白與蔣秋白二人，四部僧伽眾會遂昌，世間怙主覺囊巴(篤布巴)、賢哲布敦大師等諸多後聖亦承此戒統，是以當恪虔恭禮矣。<br>後弘教律衰復興，僧團重聚法再隆，<br>襤褸中藏金像般，咒乘未崩努梭宿，<br>主要精髓阿若宗，阿底峽尊屢稱歎。<br>如是焉。<br>阿底峽尊者入藏之機，持有精要傳承教法菩提心口訣者眾，其赫赫名者蓋阿若耶謝炯內。尊者悅其造論《大乘瑜伽》，曰：“善旨麗言。”亦屈禮於阿若之徒藏噶庫；復為其徒孫拔貢，授世俗菩提心，並授記曰：“勝義心要，當承於文殊、彌勒二尊。”大善知識博多瓦，亦從拔貢盡聆心法口訣。及至大成，猶奉為心要。由是密教法脈，未嘗中絕，其理昭然。然亦有末學為魔所攝，行止乖僻者，及尊者西來，其風乃息，皆慈恩之所被也。於茲補述。<br>其言法王贊普之朝代，兼敘教法後弘期況景，<br>離私作失覽群經彙擷，然若有過慧識前懺悔。<br>德善迴向普盡蒼生力，憶念法王譯師智者恩，<br>圓其密意善修持正法，世間怙主速捷成就兮。<br>茲哈贊普朝代正法流布次第之概言，乃持明游方士吉祥才旺諾布於第十二遶迥臻圓之卓達木牛年昴宿月上弦第三喜日(十月十一日)，東方林葉苑工布娘卡俊巴隆禪房，書於燈火之下。斯非僅憑己智，乃依正理，重以鑒若干信史而於瑞顏水雞年上區阿里芒隅旺列府居時，補詞拓篇稍略校正，此仍應考漢地唐代準譯諸史，除非能得往昔藏史罕見古本，否則於今流傳者，除上文所研外量無他矣。善哉！善哉！善哉！</p>",
    "status": "published",
    "meta": { "words": "N/A", "pages": "N/A", "readTime": "N/A", "preview": "N/A" },
     "availableLanguages": ["bo", "zh", "en"],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "aspiration_002",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": ["迴向"],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": { "words": "N/A", "pages": "N/A", "readTime": "N/A", "preview": "N/A" },
     "availableLanguages": ["bo", "zh", "en"],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "aspiration_002",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": ["迴向"],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": { "words": "N/A", "pages": "N/A", "readTime": "N/A", "preview": "N/A" },
     "availableLanguages": ["bo", "zh", "en"],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "aspiration_002",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": ["迴向"],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": { "words": "N/A", "pages": "N/A", "readTime": "N/A", "preview": "N/A" },
     "availableLanguages": ["bo", "zh", "en"],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
    {
    "id": "history_005",
    "tibetanTitle": "༄༅། །བུ་སྟོན་ཁ་ཆེས་མཛད་པའི་ཆོས་འབྱུང་རིན་པོ་ཆེའི་མཛོད་ལས། ག་པ་འཛིན་པ་ཚེ་དབང་ནོར་བུས་ཉེ་བར་བཏུས་པ་བཞུགས་སོ། །",
    "chineseTitle": "布敦大師所撰佛法源流寶藏錄之持明才旺諾布節錄文",
    "englishTitle": "From the Treasury of Religious History by Buton Rinchen Drub Compiled by the Vidyādhara Tsewang Norbu", 
    "author": "才旺諾布",
    "category": "歷史",
    "tags": ["佛法源流", "布敦大師", "Buton"],
    "ContentTibetan": "<p class=\"tibetan-text\">༈ ཨོཾ་སྭཱསྟི། རྒྱལ་བའི་བསྟན་པ་ལ་མཁས་པའི་ཁྱུ་མཆོག་བུ་སྟོན་རིན་ཆེན་གྲུབ་ཀྱི་ཞལ་སྔ་ནས་བོད་ཀྱི་རྒྱལ་རབས་ཇི་ལྟར་བཞེད་ནི་དེས་མཛད་པའི་ཆོས་འབྱུང་གསུང་རབ་རིན་པོ་ཆེའི་མཛོད་ལས་འབྱུང་བ། མདོར་བསྡུ་ན། རྒྱ་གར་གྱི་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོའམ་གསལ་རྒྱལ་འཆར་བྱེད་གང་རིམ་ཞིག་གི་སྲས་མཚན་དང་ལྡན་པ་ཞིག་བོད་ཡུལ་ལྷ་རིའི་ཡོལ་བའི་ཁར་བྱུང་སྟེ་བཙན་ཐང་སྒོ་བཞིར་བྱོན་པ་བོད་ཀྱི་རྒྱལ་པོ་གཉན་ཁྲི་བཙན་པོར་གྱུར་ལ། དེ་ནས་རིམ་པར་གནམ་ལ་ཁྲི་བདུན་གྲགས་པ་བྱུང་ཞིང་། ཁྲི་བདུན་གྱི་ཐ་མ་སྲིབ་གྲི་བཙན་པོའི་སྐབས་གདོན་བོན་གཤེན་ཚ་མི་བོ་ཆེ་ཞེས་པ་བྱུང་། དེ་ནས་བར་གྱི་ལྟང་ཅིག་པ་ཡི་ལེགས་དྲུག དེ་ནས་ལྡེ་བརྒྱད་དང་བཙན་བཞི་སྟེ་དེ་རྣམས་ཀྱི་གཉའ་ཁྲི་བཙན་པོ་ནས་རྒྱལ་རབས་ཉི་ཤུ་རྩ་དྲུག་སོང་བ་ལས་རྒྱལ་པོ་ཉི་ཤུའི་རང་ཆབ་སྲིད་བོན་གྱིས་སྐྱོང་བར་གྲགས་སོ། །དེའི་མཐར་གསང་བའི་བདག་པོས་བྱིན་གྱིས་བརླབ་པའི་རྒྱལ་པོ་ཐོ་ཐོ་རི་གཉན་བཙན་བྱོན། དེ་ཡི་དགོང་ལོ་དྲུག་ཅུ་བར་ཕོ་བྲང་ཡུམ་བུ་བླ་སྒང་གི་རྩེ་ན་བཞུགས་པར་ནམ་མཁའ་ནས་ཟ་མ་ཏོག་བཀོད་པ་དང་སྤང་ཀོང་ཕྱག་རྒྱའི་གླེགས་བམ་གསེར་གྱི་མཆོད་རྟེན་རྣམས་བབས་པས་དམ་པའི་ཆོས་ཀྱི་དབུ་དེ་ནས་བརྙེས། དེ་ལ་རྒྱལ་པོས་གཉན་པོ་གསང་བར་བཏགས་ཤིང་མཆོད་པའི་བྱིན་རླབས་ཀྱིས་དགུང་ལོ་བརྒྱ་དང་ཉི་ཤུ་ཐུབ། དེ་ནས་རྒྱལ་རབས་བཞི་པ་གནམ་རི་སྲོང་བཙན་དང་དེ་ཡི་བཙུན་མོ་འབྲི་བཟའ་ཐོད་དཀར་ལ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྤྲུལ་པའི་སྐུ་དབུ་ལ་འོད་དཔག་མེད་པ་མངོན་སུམ་དུ་བཞུགས་པའི་རྒྱལ་བུ་གཅིག་མེ་མོ་གླང་གི་ལོ་ལ་འཁྲུངས་ཏེ་མཚན་ལ། ཁྲི་སྲོང་བཙན་བཏགས་དགུང་ལོ་བཅུ་གཉིས་སར་རྒྱལ་ཐབས་མཛད་དེ་མཐའ་ཡི་རྒྱལ་ཕྲན་ཐམས་ཅད་དབང་དུ་འདུས་པས་སྐྱེས་འབུལ་གྱི་འཕྲིན་ཡིག་བཀླགས། དེས་བོད་ལ་ཡི་གེ་དགོས་པར་གཟིགས་ཏེ་ཐོན་མི་སཾ་བྷོ་ཊ་རྒྱ་གར་དུ་བཏང་ནས་པཎྜི་ཏ་ལྷ་རིག་སེང་གེ་ལ་སྒྲ་བསླབ་སྟེ་བོད་ཀྱི་སྐད་དང་བསྟུན་པའི་དབྱངས་གསལ་སུམ་ཅུ་གཟུགས་ཁ་ཆེའི་ཡི་གེ་ལ་དཔེ་བླངས་ཏེ་ལྷ་སའི་སྐུ་མཁར་དམར་རུར་བཀོད་ཅིང་དེ་ཡི་ཆ་རྐྱེན་སྒྲ་ཡི་བསྟན་བཅོས་བརྒྱད་མཛད། དེར་རྒྱལ་པོས་ཀྱང་ལོ་བཞི་ཡི་བར་མཚམས་བཅད་དེ་སྒྲ་ལ་སྦྱངས་བའི་ཚུལ་མཛད་དེ་མདོ་ཟ་མ་ཏོག་དང་དཀོན་མཆོག་སྤྲིན་རྣམས་བོད་སྐད་དུ་བསྒྱུར། དེ་ཚེ་བོད་འབངས་རྣམས་ཀྱིས་རྒྱལ་པོ་ལ་གཤེ་བ་གསན་ནས་མི་དགེ་བ་ལས་ལྡོག་པའི་དགེ་བཅུའི་ཁྲིམས་བཅོས་པས་མཚན་ལ། སྲོང་བཙན་སྒམ་པོར་གྲགས། <br>དེ་ནས་རྒྱ་གར་ཤར་ཕྱོགས་ནས་ཙནྡན་སྦྲུལ་གྱི་སྙིང་པོ་ལས་རང་བྱུང་དུ་བྱོན་པའི་སྤྱན་རས་གཟིགས་བཅུ་གཅིག་ཞལ་སྤྲུལ་པས་སྤྱན་དྲངས་བལ་པོའི་རྒྱལ་པོ་འོད་ཟེར་གོ་ཆའི་སྲས་མོ་ཁབ་ཏུ་བཞེས་པས་དེས་ལྷ་མི་བསྐྱོད་རྡོ་རྗེ། བྱམས་པ། ཙན་དན་གྱི་སྒྲོལ་མ་རྣམས་སྤྱན་དྲངས། རྒྱ་ཡི་རྒྱལ་པོ་སེང་གེ་བཙན་པོ་ཞེས་ཐང་གི་རྒྱལ་རབས་གཉིས་པའི་སྲས་མོ་ཀོང་ཇོ་ཁབ་ཏུ་བཞེས་ཏེ་དེས་འཕྲུལ་སྣང་གི་ཇོ་བོ་གདན་དྲངས་སོ། །དེ་ནས་ཁྲི་བཙུན་གྱི་གཙུག་ལག་ཁང་བཞེངས་འདོད་ཀྱང་བཞེངས་སུ་མ་བཏུབ་པར་བོད་ཀྱི་ས་གཞི་སྲིན་མོ་གན་རྐྱལ་དུ་འགྱེལ་བ་འདི་གནས་དགོས་པར་གཟིགས་ནས་དཔུང་པ་གཡས་པ་ཀ་ཚལ། གཡོན་པ་ཁྲ་འབྲུག ཀོང་པ་གཡས་པ་གཙང་འབྲམ། གཡོན་པ་གྲཾ་པ་རྒྱང་སྟེ་གཙུག་ལག་ཁང་བཞི། གྲུ་མོ་གཡས་ལ་ཀོང་པོ་བུ་ཆུ། གཡོན་ལ་ལྷོ་བྲག་ཁོ་མཐིང་། སྤུས་མོ་གཡས་ལ་ཀ་བྲག གཡོན་ལ་པྲ་བདུན་རྩེ་སྟེ་མཐའ་འདུལ་བཞི། ལག་མཐིལ་གཡས་ལ་བྱང་འཚལ་གྱི་རླུང་གནོན། གཡོན་ལ་ཁམས་ཀྱི་འདན་ཀློང་ཐང་སྒྲོན་མ། རྐང་མཐིལ་གཡས་ལ་མང་ཡུལ་བྱམས་སྤྲིན། གཡོན་ལ་མོན་ཡུལ་བུམ་ཐང་། སྤ་གྲོ་སྐྱེར་ཆུ་ལ་སོགས་པ་གཙུག་ལག་ཁང་མང་པོ་བཞེང་ནས་གདོད་འོ་ཐང་མཚོ་ལ་རྡོ་མཁར་རྩིགས། ཤིང་གིས་ཕུབ། ཀླུའི་འདམ་པས་ཞ་ལ་བྱས་ཏེ་ར་ལ་ས་བཀལ་ནས་བཏབ་སྟེ་ལྷ་སའི་གཙུག་ལག་ཁང་ར་ས་འཕྲུལ་སྣང་བཞེངས། བློ་འབུར་བྱང་མར་བཟོ་རྒྱུ་སྤུང་བ་ལ་རང་བྱོན་དུ་བྱུང་བའི་ངོ་བོ་ཐུགས་རྗེ་ཆེན་པོ་བཅུ་གཅིག་ཞལ་བཞུགས་གསུངས་སོ། །དེ་ནས་རྒྱལ་པོས་རྒྱ་ནག་རི་བོ་རྩེ་ལྔ། བྱོན་ནས་ལྷ་ཁང་བརྒྱ་རྩ་བརྒྱད་བཞེངས་སོ། །རྒྱ་མོ་ཀོང་ཇོས་ར་མོ་ཆེའི་གཙུག་ལག་ཁང་བཞེངས། དེའི་ཚེ་རྒྱ་གར་གྱི་སློབ་དཔོན་ཀུ་མ་ར་དང་། བྲམ་ཟེ་ཤམ་ཀ་ར་དང་། བལ་པོ་སློབ་དཔོན་ཤཱི་ལ་མཉྫུ་དང་། རྒྱ་ནག་གི་སློབ་དཔོན་ཧ་ཤང་མ་ཧཱ་དེ་ཚེ་དང་། ལོ་ཙཱ་བ་ཐོན་མོ་སཾ་བྷོ་ཊ་དང་། དེའི་མཆན་བུའི་དྷརྨ་ཀོ་ཤ་དང་། ལྷ་ལུང་རྡོ་རྗེ་དཔལ་རྣམས་ཀྱི་ཆོས་ཅི་རིགས་བསྒྱུར་ཅིང་གཏན་ལ་ཕབ་བོ། །རྒྱལ་པོ་དེས་ཐུགས་རྗེ་ཆེན་པོའི་སྤྲུལ་པར་གྲགས་ཤིང་ལིའི་བཙུན་པ་གཉིས་ཀྱི་ལོ་རྒྱུས་ཀྱང་ཡོད་དོ། །རྒྱལ་པོ་དེས་ལོ་དྲུག་ཅུ་རྩ་དགུ་རྒྱལ་སྲིད་བཟུང་སྟེ་བརྒྱད་ཅུ་རྩ་གཉིས་ལ་གཤེགས་སོ། །<br>དེ་དང་མཉམ་དུ་ཀོང་ཇོའི་ཞལ་ནས་ཤཱཀྱ་མུ་ནེ་ར་མོ་ཆེ་ནས་གདན་དྲོངས་ལ་འཕྲུལ་སྣང་གི་བློ་འབུར་དུ་སྦོས་སྒོ་ལ་ཞ་ལ་གྱིས་ལ་འཇམ་དབྱངས་བྲིས་ཤིག་གསུངས་ཏེ་ཁྲི་བཙུན་དང་མཉམ་དུ་གསུམ་ཀ་ཐུགས་རྗེ་ཆེན་པོ་ལ་ཐིམ་པའམ་འདས་སོ། །བློན་པོ་རྣམས་ཀྱིས་ཀྱང་ལྷ་གཉིས་བརྗེས་ཏེ་ཞལ་ཆེམས་ལྟར་བྱས་སོ། །རྒྱལ་པོ་དེའི་སྲས་མང་སྲོང་མང་བཙན། དེའི་སྲས་གུང་སྲོང་གུང་བཙན། དེའི་སྲས་འདུས་སྲོང་མང་པོ་རྗེ་དེའི་སྲས་རླུང་ནམ་འཕྲུལ་གྱི་རྒྱལ་པོ། དེ་ཡི་སྲས་ཁྲི་ལྡེ་བཙུག་བརྟན་ཏེ་དེ་ལྷ་ས་མཁར་བྲག་སོགས་བཙུག་ལག་ཁང་བརྒྱད་བཞེངས། བྲན་ཀ་མུ་ལ་ཀོ་ཎ། མྱག་ཛྙཱ་ན་ཀུ་མ་ལ་རས་མདོ་སྡེ་ལས་བརྒྱ་པ་དང་གསེར་འོད་དམ་པ་བསྒྱུར། རྩིས་དང་སྨན་དཔྱད་ཅི་རིགས་ཡང་དར་བར་བྱས། དེའི་སྲས་འཇང་ཚ་ལྷ་དབོན་ལ་རྒྱ་ཡི་རྒྱལ་པོའི་སྲས་མོ་གྱིམ་ཤང་ཀོང་ཇོ་བླང་བར་རྒྱལ་པོའི་སྲས་གཤེགས་པས་མེས་དང་ལྷག་ཏུ་འདུས་པ་ལས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་རྣམ་འཕྲུལ་ཁྲི་སྲོང་ལྡེ་བཙན་ས་ཕོ་རྟ་ལ་བལྟམས། དེ་ཆུང་ངུའི་དུས་སུ་རྒྱ་ཡི་ཡུལ་དུ་སང་ཤིང་སོགས་མི་བཞི་ཆོས་ཚོལ་བར་བཏང་བས་ཆོས་དང་ཧ་ཤང་གཅིག་བཅས་བོད་ཡུལ་དུ་སླེབས་ཀྱང་ཤུལ་དུ་རྒྱལ་པོ་གཤེགས་ཤིང་རྒྱལ་བུ་ནར་མ་སོན་པས་བོན་བློན་རྣམས་ཀྱིས་ཆོས་བྱེད་དུ་མི་སྟེར་བའི་ཁྲིམས་བུ་ཆུང་བཅས་པས་སང་ཤིའི་ཆོས་རྣམས་རེ་ཞིག་བྲག་ལ་སྦས། སླར་རྒྱལ་བུའི་ན་ཆུང་ཟད་སོན་ཏེ་རྒྱལ་སྲིད་མཛད་པའི་སྐབས་སང་ཤིའི་རྒྱལ་བུའི་སྙན་དུ་ཆོས་གསོལ་བར་དགྱེས། དེ་དང་མཐུན་པར་རྦ་གསལ་སྣང་མང་ཡུལ་གྱི་སོ་ཁར་ཡོད་པ་ཡང་འཁོར་ཏེ་རྒྱལ་པོ་ལ་ཆོས་བགྱིད་པར་གསོལ་བའི་འགོས་ཀྱི་བློ་གྲོས་ཀྱི་མ་ཞང་མཆད་དུ་ལོ་གསུམ་བཅུག་སྟེ་དེའི་རིང་གསལ་སྣང་ཨ་ཙཱརྱ་བོ་དྷེ་ས་ཏྭ་སྤྱན་འདྲེན་བཏང་ནས་མང་ཡུལ་དུ་ཕེབས་པ་ན་བློན་པོ་གསུམ་བསུ་བར་བརྫངས་ནས་རིམ་པས་བོད་དུ་བྱོན། ཕོ་བྲང་བྲག་དམར་དུ་རྒྱལ་པོ་མཇལ་འཕྲད་མཛད། ཕོ་བྲང་རླུང་འཚུབ་དུ་ཟླ་བ་བཞི་ཡི་བར་མཁན་པོས་ཆོས་བཤད་པས་བོད་ཀྱི་ནག་ཕྱོགས་ལྷ་འདྲེའི་ཆོ་འཕྲུལ་དང་བློན་པོ་བོན་ལ་དགའ་བ་རྣམས་ཀྱིས་ཆོས་བཤད་དུ་མ་སྟེར་བས་རེ་ཞིག་མཁན་པོ་བལ་ཡུལ་དུ་བསྐྱལ། <br>དེ་ནས་རི་ས་ཤིག་ལོན་པ་ན་གསལ་སྣང་རྒྱ་ཡི་ཡུལ་ཆོས་འཚོལ་བ་དང་། སང་ཤིང་མཁན་པོ་སྤྱན་དྲངས་བར་བརྫངས་ཤིང་། སླར་ཡང་གསལ་སྣང་རྒྱ་ནས་འཁོར་ཏེ་མཁན་པོ་སྤྱན་འདྲེན་ཆེད་དུ་བསྐྱར་དུ་བརྫངས་པས་མཁན་པོ་བོད་དུ་ཕེབས། བསམ་ཡས་ཀྱི་ས་འདུལ་མཛད་པས་ལ་ཉེ་རྟེན་འབྲེལ་ཤིན་ཏུ་ལེགས། འོན་ཀྱང་བོད་ཡུལ་གྱི་ལྷ་འདྲེ་གདུག་པ་ཆེ་བས་དེ་དག་ཇི་བཞིན་འདུལ་བར་མ་བཟོད་པས་ཨོ་རྒྱན་གྱི་མཁན་པོ་པདྨ་སཾ་བྷ་ཝ་སྤྱན་དྲོངས་ཤིག་པར་ལུང་བསྟན་རྒྱལ་པོས་དེ་སྤྱན་འདྲེན་པར་ཕོ་ཉ་བདུན་བཏང་ནས་སློབ་དཔོན་གྱིས་མཁྱེན་ཏེ། མང་ཡུལ་དུ་བྱོན་པ་དང་མཇལ་ནས་རིམ་པས་ལྷ་སྲིན་དམ་ལ་བཏགས་ཀྱིན་བསམ་ཡས་སུ་ཕེབས། སློབ་དཔོན་གྱི་ས་ཕྱོགས་སུ་མཁན་པོས་ས་བཅད་མཛད་ཨོ་ཏནྟ་པུ་རིའི་གཙུག་ལག་ཁང་ལ་དཔེ་མཛད་དེ་མེ་མོ་ཡོས་བུའི་ལོ་ལ་རྨང་བཏིང་སྔོན་དུ་ཨཱརྱ་པཱ་ལོ་བཞེངས། ས་མོ་ཡོས་ཀྱི་ལོ་ལ་ཚར་ཞེས་གསུང་ཀྱང་མཁས་མཆོག་བུ་ལྟ་བུ་ལ་འཁྲུལ་པ་རགས་པ་འདི་ལྟ་བུ་གང་ལ་མང་། དེ་ནི་ཡིག་མཁན་གྱི་ལོ་ཁམས་ནོར་བར་མངོན། བསམ་ཡས་ལ་པདྨ་སམ་བྷ་ཝ་དང་བོ་དྷེ་ས་ཏྭ་གཉིས་ཀས་རབ་ཏུ་གནས་པ་མཛད། ལོ་དེའི་ཕྱི་མ་སད་མི་བདུན་རབ་ཏུ་བྱུང་། དེ་ནས་སློབ་དཔོན་ཆེན་པོ་ཡི་མངོན་པར་ཤེས་པའི་མཐུ་དང་རྫུ་འཕྲུལ་གྱིས་བློན་པོ་རྣམས་གུ་དོག་པས་རྒྱལ་པོ་ལ་ནན་གྱིས་ཞུས་ཏེ་རྒྱ་གར་དུ་བརྫངས། གཞན་རྒྱ་གར་གྱི་སློབ་དཔོན་བི་མ་ལ་མི་ཏྲ། བྷཱུདྡྷ་གུ་ཧྱ། ཤིནྟཾ་གཪྦྷ། བི་ཤཱུདྡྷ་སིངྷ། ཡོ་ག་མཁན་དྷརྨ་ཀིརྟི་སོགས་སྤྱན་དྲངས། སད་མི་བདུན་སོགས་ལོ་ཙཱ་རྣམས་ཀྱིས་ཆོས་རྒྱ་ཆེར་བསྒྱུར། འབྲུག་ལོ་ཕོ་བྲང་གདན་དཀར་དུ་བཞུགས་པའི་སྐབས་བོད་དུ་འགྱུར་བའི་ཆོས་རྣམས་དཀར་ཆག་གིས་གཏན་ལ་ཕབ། <br>དེ་ནས་མི་རིང་བར་མཁན་པོ་བོ་དྷེ་ས་ཏྭ་ཡང་ཞི་བར་གཤེགས། དཔལ་དབྱངས་སློབ་དཔོན་དུ་བསྐོས་ནས་སྦ་ཡེ་ཤེས་དབང་པོ་ལྷོ་བྲག་ཏུ་བསྒོམ་པར་གཤེགས། དེའི་འོག་ཏུ་ཧ་ཤང་དང་ཆོས་ཀྱི་རྩོད་པ་བྱུང་བར་མཁན་པོའི་སློབ་མ་ཀ་མ་ལ་ཤཱི་ལས་ཧ་ཤང་བཏུལ་ནས་རྒྱ་ནག་ཏུ་བརྫངས། ཡེ་ཤེས་དབང་པོ་ཁམས་ཀྱི་ཟས་སྤང་སྟེ་གཤེགས། མངའ་བདག་ཡང་དགུང་ལོ་དྲུག་ཅུ་རྩ་དགུ་པ་གཤེགས་པར་གསུངས་ཏེ་ས་རྟ་ལ་འཁྲུངས་གཤིས་མེ་སྟག་ལ་གཤེགས་པར་མངོན། དེ་ནས་སྲས་མུ་ནེ་བཙན་པོས་ཆུ་སྟག་ལ་རྒྱལ་སྲིད་བཟུང་། བསམ་ཡས་སུ་མཆོད་པ་ཆེན་པོ་བཞི་བཙུགས། བོད་འབངས་ཀྱི་ལྟོག་ཕྱུག་ལན་གསུམ་སྙོམས། ཆབ་སྲིད་ལོ་གཅིག་དང་ཟླ་བདུན་གྱི་མཐར་ཡུམ་གྱིས་དུག་བཏང་ནས་གཤེགས། དེ་ནས་གཅུང་ཁྲི་ལྡེ་བཙན་པོ་ལོ་བཞི་པ་རྒྱལ་སྲིད་གཏད་པས་སད་ན་ལེགས་གྲགས། དེས་སྐར་ཆུང་རྒྱལ་སྡེའི་གཙུག་ལག་ཁང་བཞེངས། ཆོས་ཀྱི་སྲོལ་ཆེར་མཛད། དེ་ལ་སྲས་ལྔ། ཁྲི་རལ། གཙང་མ། ཁྲི་དར་མ། ལྷ་རྗེ་ལྷུན་གྲུབ། ཁྲི་ཆེན། དེ་ལས་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོའི་སྤྲུལ་པ་རལ་པ་ཅན་དགུང་ལོ་བཅོ་བརྒྱད་པར་ཆབ་སྲིད་བཟུང་། ཕོ་བྲང་འོ་འཇང་དོ་བཞེངས། རྒྱ་ལ་དམག་དྲངས་ཏེ་བཅོམ་ཞིང་སླར་རྒྱ་དང་དུམ་བྱས་ནས་ལྷ་སར་རྡོ་རིང་བཙུགས། དེ་ནས་དགུང་ལོ་སོ་དྲུག་པ་ལྕགས་མོ་བྱ་ལ་བློན་པོས་བཀྲོངས་ཏེ་རྒྱལ་སྲིད་ལ་གླང་དར་མ་བཞག དེ་ནར་སོན་པ་དང་སངས་རྒྱས་ཀྱི་བསྟན་པ་ལ་གནོད་པ་ཆེར་བྱས། དེ་ནས་རིངས་ཤིག་ན་ལྷ་ལུང་དཔལ་གྱི་རྡོ་རྗེས་རྒྱལ་པོ་སྡིག་ཏོ་ཅན་དེ་ལྷ་སའི་རྡོ་རིང་གི་ཡི་གེ་ཀློགས་པར་ཡོད་པས་དེར་བསྒྲལ། རྒྱལ་པོ་དེ་ཡི་བཙུན་མོ་ཆུང་མ་ལ་སྲས་གཅིག་བྱུང་བ་མཚན་མོ་མར་མེའི་འོད་ཀྱིས་བསྲུང་བས་འོད་བསྲུང་དུ་གྲགས། ཆེན་མ་ལ་ཁྱེའུ་སྐྱེས་མ་ཐག་སོ་ཅན་ཞིག་བྱུང་བ་ཡུམ་བརྟན་གྲགས། གནམ་ལྡེ་འོད་བསྲུང་ལོ་དྲུག་ཅུ་རྩ་གསུམ་པར་གཤེགས་ཤིང་། དེ་ཡི་མ་སྲས་ཉིས་ཁྲི་བཀྲ་ཤིས་བརྩེགས་དང་། ཁྲི་ཉི་མ་མགོན་ཡིན་ལ། ཉི་མ་མགོན་མངའ་རིས་སུ་གཤེགས་ཏེ། དེ་ལ་སྲས་གསུམ། ཆེ་བ་རིག་པ་མགོན་མར་ཡུལ་གྱི་བདག་པོ་དང་། འབྲིང་བ་བཀྲ་ཤིས་མགོན་སྤུ་རོང་གི་བདག་པོ། ཆུང་བ་ལྡེ་གཙུག་མགོན་ཞང་ཞུང་གི་བདག་པོར་གྱུར། <br>ཆུང་བ་ལ་སྲས་དྲང་སྲོང་དང་འཁོར་ལོ་ལྡེ་གཉིས་སྟེ་མགྱོགས་མིང་དུ་སྲོང་ཁོ་རེར་གྲགས་སོང་ངེ་རབ་ཏུ་བྱུང་བ་ལ། མཚན་ཡེ་ཤེས་འོད་དེ། དེ་ཡི་ཁྱིའུ་བློ་རྣོ་བ་ཉི་ཤུ་རྩ་གཅིག་རྒྱ་གར་དུ་བཏང་བ་ལ་བཅོ་བརྒྱད་ཚད་པས་ཤི་ཞིང་གཉིས་བོད་དུ་ལོག་པ་ལ་ལོ་ཆེན་རིན་ཆེན་བཟང་པོ་དང་ལོ་ཆུང་ལེགས་པའི་ཤེས་རབ་སྟེ་བསྟན་པ་ལ་ཤིན་ཏུ་ཕན་པར་བྱུང་། གཞན་ཡང་པཎྜི་ཏ་མང་དུ་སྤྱན་དྲངས་ཤིང་། མདོ་སྔགས་ཅི་རིགས་པ་བསྒྱུར། ཁྱད་པར་ཡོ་ག་དང་གསང་འདུས་རྩལ་དུ་བཏོན། པཎྜི་ཏ་སྨྲྀ་ཏི་ཡང་བལ་པོ་བརྒྱུད་བོད་ནས་མདོ་ཁམས་སུ་གཤེགས་པ་འདི་སྐབས་ཡིན་པར་སྣང་། གཅུང་ཁོ་རེའི་སྲས་ལྷ་ལྡེ། དེ་ལ་སྲས་གསུམ་འོད་ལྡེ་དང་། ཕོ་བྲང་ཞི་བ་འོད། བཙུན་པ་བྱང་ཆུབ་འོད་སྟེ་བྱང་ཆུབ་འོད་ཀྱི་འབད་པས་ཇོ་བོ་རྗེ་བོད་དུ་སྤྱན་དྲངས་པས་བཀའ་དྲིན་ཤིན་ཏུ་ཆེ། བསྟན་པ་ཕྱི་དར་མདོ་ཁམས་ནས་བྱུང་བ་ནི་སྔར་གླང་དར་གྱིས་བསྟན་པ་བསྣུབ་པའི་སྐབས་སུ་གཙང་གཡོ་རྨ་གསུམ་གྱིས་གླེགས་བམ་ཇི་སྙེད་པ་བསྣམས་ཏེ་ཁམས་སུ་བྲོས་ཏེ་བཞུགས་པ་ལ་མོས་པས་སྤྱོད་པའི་ས་པ་དམུ་ཟི་རབ་གསལ་ཞེས་རབ་ཏུ་བྱུང་བས་མཚན་དགེ་བ་རབ་གསལ་བཏགས། ཤེས་རབ་ཆེ་བས་ཕྱིས་བླ་ཆེན་པོ་དགོངས་པ་རབ་གསལ་དུ་གྲགས། རབ་ཏུ་བྱུང་བའི་ལོ་ཕྱི་མར་སྔར་གྱི་མཁན་སློབ་དང་རྒྱ་ནག་ཧ་ཤང་གིས་ཁ་བསྐང་བྱས་ཏེ་བསྙེན་པར་རྫོགས། བསྙེན་པར་རྫོགས་ནས་ལོ་ལྔ་ལོན་པ་ན་དབུས་གཙང་གི་སྡེ་མི་བཅུ་མདོ་ཁམས་སུ་བྱོན་ནས་གཙང་པ་ལ་བསྙེན་པར་རྫོགས་པའི་བཀའ་དྲིན་ཞུས་པར་བླ་ཆེན་པོར་ཞུས་ཞིག་པ་བསྩལ་བས་ཁོང་རྣམས་བླ་ཆེན་པོ་ལ་དགེ་སློང་གི་དངོས་པོ་བསྒྲུབ། ཁོང་རྣམས་བོད་དུ་ཡོང་ནས་ཀླུ་མེས་སོགས་དབུས་མི་ལྔ་ཡི་དབུས་སུ་གནས་གཞི་ཐ་དད་རྩིགས་ཤིང་། ལ་སྟན་སོགས་གཙང་པ་ལྔ་ཡི་གཙང་དུ་གནས་གཞི་ཐ་དད་བཟུང་སྟེ་རྒྱལ་བ་ཤཱཀྱའི་བསྟན་པ་ལ་རྒྱས་པར་བྱས་སོ། །<br>འོན་ཀྱང་བླ་ཆེན་པོའི་མཁན་བརྒྱུད་དང་དབུས་གཙང་མི་བཅུའི་སྡོམ་པ་བླང་བའི་མཁན་པོ་ལོ་རྒྱུས་མི་མཐུན་པ་ཡོད་འདུག་ལ། དེ་ཡང་འདི་སྐད་ཅེས་འབྱུང་སྟེ་ཁ་ཅིག་ན་རེ་མཁན་པོ་བོ་དྷེ་ས་ཏྭའི་མཁན་བུ་རྦ་རཏྣ། དེས་ལྷ་ལུང་རྣལ་འབྱོར་དབྱངས། དེས་བླ་ཆེན་པོ་དགོངས་གསལ་དེས་ས་གོང་ཡེ་ཤེས་གཡུང་དྲུང་། དེས་གྲུམ་ཡེ་ཤེས་རྒྱལ་མཚན། དེས་ཀླུ་མེ་ལ་སོགས་པའོ་ཞེས་ཟེར་བ་དང་། བཀའ་ཆེམས་ཀྱི་ཡི་གེ་ཁ་ཅིག་ན་རེ། མཁན་པོ་བོ་དྷེ་ས་ཏྭའི་སློབ་མ་ད་ན་ཤི་ལ་དང་། ཛི་ན་མི་ཏྲས་བྱས་ནས་རྦ་རཏྣ་དེས་གཡོག་དགེ་འབྱུང་། དེས་བླ་ཆེན་དགོངས་པ་གསལ། དེས་སྒྲོལ་མཉྫུ་ཤྲཱི། དེས་གྲུམ་ཡེ་ཤེས་རྒྱལ་མཚན། དེའི་ཀླུ་མེས་ཞེས་འབྱུང་བ་དང་། རིག་རལ་ན་རེ། བླ་ཆེན་པོའམ་མཁན་བུ་གྲུམ་ལ་དབུས་གཙང་གི་མི་བཅུའི་སྡོམ་པ་བླང་ཟེར་བ་རྣམས་བརྟག་དགོས་སོ། །ཡང་གཡོ་ལ་སོགས་པ་རྣམས་ཁ་ཅིག་ཛི་ན་མི་ཏྲའི་མཁན་བརྒྱུད་བླང་འདོད་ཁ་ཅིག་ཞི་བ་འཚོའི་མཁན་བརྒྱུད་དུ་འཆད་པས་བརྟག་པར་བྱའོ། །དེ་ལྟར་དབུས་གཙང་དུ་བསྟན་པ་མེད་པ་ལོ་བདུན་ཅུ་བྱུང་ནས་དབུས་གཙང་གི་མི་བཅུས་བསྟན་པ་བཙུགས་པ་ཡིན་ཏེ། མི་བཅུ་དབུས་སུ་བྱོན་ཙ་ན་རྒན་མོ་ཞིག་ན་རེ་ང་ལོ་དྲུག་ལོན་པ་ན་བཙུན་པ་མཐོང་ཟེར། ཅི་ཙམ་ལོན་བྲིས་པས་ལོ་བདུན་ཅུ་དོན་དྲུག་ལོན་ཟེར་བས་སོ་ཞེས་ཟེར་ལ། ཁ་ཅིག་ལོ་བརྒྱ་རྩ་བརྒྱད་སོང་ཟེར། ཞེས་བུ་སྟོན་ཆེན་པོའི་བསྟན་པ་ཕྱི་དར་ཆུ་བྱ་ལོ་ལ་འདོད་ཞེས་པའི་གཏན་ཚིགས་ཡང་གསུང་དེ་ཡིན་ནོ། །དེ་སྐད་བུ་སྟོན་ཁ་ཆེའི་མཛད་པའི་ཆོས་འབྱུང་རིན་པོ་ཆེའི་མཛོད་ལས་རིག་པ་འཛིན་པས་ཉེ་བར་བཏུས་པའོ། །སརྦ་མངྒ་ལཾ།</p>",
    "ContentChinese": "<p class=\"chinese-text\">嗡娑帝<br>竊聞西藏王統之始末，據布敦仁欽竹大師所著《佛法源流寶藏》云：天竺國王色堅心王之子，具相好者，降生於雪域天幕之巔，後至贊塘四門，是為聶赤贊普。其後有天王七代，末代斯日贊普時，有本教師贊米波且者。<br>其後有朗七王，繼有德八王及贊四王。自聶赤贊至是，凡二十有六代。其中二十王以苯教治國。及後，觀世音加持之王托托日年贊即位。其六十歲時，居雍布拉岡宮，天降《華嚴經》及《手印經》并金塔，始得正法。王以為密寶而供奉之，福蔭所及，享年一百二十。<br>後四世為南日松贊，妃阿沙托嘎生一王子，乃觀世音化身，頂有無量光佛現於其身。生於丁丑年，號赤松贊。十二歲即位，諸邦歸附，進貢書信可讀。王見藏地需文字，遣禪米桑布扎赴天竺，從班智達獅子慧學習聲明，依藏語制三十音之文字，取法于闐文。於拉薩紅宮制定，並著八部文法論。王亦閉關四年修習聲明，譯《華嚴經》及《寶雲經》。<br>時藏民非議，王聞之，立十善法禁止惡業，故號松贊干布。後迎東印檀香木所現十一面觀音，納尼泊爾王子光甲女為妃，攜無動佛、彌勒佛、檀香度母等像。復納唐太宗女文成公主，攜來佛陀像。建赤孜寺，為降伏雪域大地如屍臥之羅剎女，建立四大廟、四邊寺及四隅寺，並建立布達拉宮。<br>時有天竺阿闍黎矩摩羅、婆羅門商羯羅、尼泊爾阿闍黎施羅曼殊、漢地和尚摩訶提婆、譯師禪米桑布扎及其弟子達磨戈沙、拉龍多杰巴等譯經立說。是王以觀世音化身聞名，傳有二漢僧之事。在位六十九年，享年八十二而崩。<br>時文成公主謂：“宜遷佛像自大昭寺至布達拉宮之北壁，繪文殊菩薩像。”既而與赤孜並歸寂於觀世音前。羣臣亦依遺命更易二佛之位。<br>其子芒松芒贊，子貢松貢贊，子都松莽布杰，子隆南朱爾之王，子赤德祖贊。赤德祖贊建拉薩殿八座，命班卡木拉戈那、乃若那庫瑪羅譯《百業經》、《金光明經》，復興醫算諸學。<br>其子姜扎拉翁有唐國公主金城公主，然王子先崩。後生一子具文殊菩薩化身之相，生於土馬年，是為赤松德贊。少時遣桑興等四人赴漢求法，攜經像一和尚至藏，然王已崩，太子未立，本教大臣不許行法，立禁童規，桑興藏經於巖。<br>及王子稍長掌國，桑興以法事奏聞，王悅。時惹格薩囊在芒域邊地，亦來朝覲，請弘法事。遣其入昂果智慧之門下三年習法。期間薩囊延請阿闍黎菩提薩埵至芒域，遣三臣迎之，漸至西藏。王於赤岩宮相見，於風宮說法四月。<br>然以藏地鬼神作祟，本教大臣喜奉鬼法，不得宣化，暫送大師還尼泊爾。後薩囊赴漢求法，復迎桑興和尚。薩囊自漢回，再迎大師入藏。於桑耶寺行鎮土法，因緣殊勝。然藏地邪魔難降，當迎鄔金大師蓮華生。王遣七使迎請，大師知之，至芒域相見，漸降諸魔至桑耶寺。<br>大師定基址，阿闍黎定規制，效那爛陀寺為式，己巳年奠基，先建阿里巴羅殿。雖云戊子年竣工，然此說不確，恐為書者之誤。蓮華生、菩提薩埵二師共作開光。是年後有七人出家。後因大師神通廣大，諸臣心生嫉妒，奏請王遣其還印。<br>復迎印師毗摩密多、佛陀笈多、寂藏、淨獅、瑜伽師達磨吉祥等。七士等譯師廣譯經典。辰年王居甘噶殿時，制藏地所譯經典目錄。<br>未幾，阿闍黎菩提薩埵亦入寂。立巴爾揚為師，巴耶謝旺布往洛札修行。其後漢僧與藏僧爭論佛法，請菩提薩埵弟子蓮花戒降伏漢僧，遣其還漢。耶謝旺布絕食而寂。贊普享年六十九歲而崩，生於土馬，卒於火虎。<br>其子穆尼贊普於水虎年即位，設桑耶四大供，三賜藏民財物均貧，治國一年七月，為后所毒而崩。其弟赤德贊年四歲即位，號薩那勒札。建噶瓊桂寺，大興佛法。生五子：赤繞、藏瑪、赤達瑪、拉杰倫珠、赤欽。<br>其中菩薩化身熱巴堅十八歲即位，建烏江多殿，征漢得勝，後與漢和好，立碑於拉薩。三十六歲鐵鳥年為臣所弒，立郎達瑪為王。及其長成，大害佛法。後由拉龍華多杰於拉薩碑前誅此惡王。<br>是王小妃生一子，以燈光護之，號鄔松。大妃生一子，生即有齒，號雍丹。烏松六十三歲崩。其母子系有尼赤扎西則與赤尼瑪袞。尼瑪袞往阿里，生三子：長曰日巴袞為瑪域主，中曰扎西袞為普絨主，幼曰德祖袞為象雄主。<br>幼者生昭松與廓勒德二子，廓勒德出家，號耶謝沃。選二十一聰慧童子赴印，十八人死於暑，二人還藏，為大譯師仁欽桑布與小譯師勒巴謝繞，大益佛法。又迎諸班智達，譯諸經典，尤重瑜伽密部。班智達斯密帝由尼泊爾入藏至多麻，似在此時。廓勒德子拉德，生三子：沃德、寂光沃、僧菩提沃。因菩提沃之請，迎至尊入藏，恩德甚大。<br>佛法後弘自多麻始者，初郎達瑪滅法時，藏瑜瑪三人攜經藏至康地。慕行者竇子繞薩出家，號德繞薩，智慧超群，後號大師功德明。次年以前師弟子及漢僧和尚為助緣受具足戒。受戒五年後，衛藏十人至康地，請藏人傳具足戒恩，稟告大師。彼等以大師為戒師受具足戒。<br>十人歸藏，魯美等五人於衛地各建寺院，拉敦等五人於藏地各立道場，大興釋迦遺教。<br>然大師傳承與衛藏十人受戒之師承，史有異說。或云菩提薩埵傳巴惹那，傳拉龍瑜伽音，傳大師功德明，傳薩貢耶謝雍仲，傳竹耶謝堅贊，傳魯美等。<br>又有遺教文獻云：菩提薩埵弟子達那施羅與智那密多傳巴惹那，傳約德郡，傳大師功德明，傳卓曼殊室利，傳竹耶謝堅贊，傳魯美。<br>智惹云：大師之弟子竹傳衛藏十人戒法云者，當詳考之。又瑜等或願受智那密多傳承，或願受寂護傳承，此亦當考。<br>衛藏無佛法者七十載，後十人立教。十人至衛時，有老嫗云：“吾六歲見僧人。‘問年幾何？’，答曰：‘七十有六。’”或云百有八載。布敦大師定後弘始於水雞年者，據此為證。<br>又據布敦大師所撰《佛法源流寶藏》，持明者輯錄。薩哇 芒嘎朗！。</p>", 
    "ContentEnglish": "<p class=\"chinese-text\"> Oṃ Svāsti!<br>According to the lineage of Tibetan kings as related by that most excellent among the learned in the Buddha's teaching, Buton Rinchen Drub, from his work “Treasury of Sacred Scriptures on Religious History,” briefly summarized:<br>A certain prince of royal lineage from an Indian king named Rūpakāya Snying-po or Gsal-rgyal 'char-byed came forth in the valley of Lha-ri in the land of Tibet and arrived at Btsan-thang sgo-bzhi, becoming the Tibetan king Gnyan-khri btsan-po. From him, the famous Seven Celestial Thrones (gnam-la khri-bdun) appeared in succession, and during the time of the last of these seven, Srib-gri btsan-po, there appeared the demon-taming Bon priest Gshen Tsha-mi bo-che.<br>Thereafter followed the intermediate period of the Six Legs, then the Eight Lde and the Four Btsan. From Gnya'-khri btsan-po onward, twenty-six generations of royal lineage passed, and the realm of the twenty kings was renowned to be governed by Srid-bon priests. <br>At the end of this period came the king blessed by the Secret Lord, Tho-tho-ri gnyan-btsan. When he reached his sixtieth year, whilst dwelling atop the palace of Yum-bu bla-sgang, from the sky fell a golden casket adorned with flowers, the book of Pang-kong phyag-rgya, and golden stupas. Thus was the beginning of the Sacred Dharma obtained. The king reverently guarded these treasures in secret and through the blessings of his devotions, he lived to one hundred and twenty years. <br>Then came the fourth in the royal lineage, Gnam-ri srong-btsan, and his queen 'Bri-bza' thod-dkar. To them was born a prince who was a manifestation of noble Avalokiteśvara, with Amitābha Buddha manifestly present above his head. He was born in the Fire-Ox year and named Khri-srong btsan. At the age of twelve years he assumed the throne, and having brought all the border principalities under his dominion, he received tribute letters. Perceiving that Tibet had need of writing, he sent Thon-mi Sambhoṭa to India, where he studied grammar with the paṇḍita Lha-rig seng-ge. Adapting to the Tibetan language, he created thirty clear vowel and consonant signs, taking the Kashmiri script as his model, and arranged them in the Lhasa palace at Sku-mkhar dmar-ru. He composed eight grammatical treatises to accompany this system. <br>The king himself spent four years in retreat studying grammar, and translated the Ratnamegha-sūtra and Ratnamegha into Tibetan. At that time, the Tibetan subjects, hearing the king's discourse, turned from unwholesome deeds and established laws based on the ten virtues. Thus he became known as Srong-btsan sgam-po. <br>Then from eastern India, he welcomed the eleven-faced Avalokiteśvara that had manifestly appeared from the heart of a sandalwood nāga, and took as queen the daughter of the Nepalese king 'Od-zer go-cha, who brought the images of Akṣobhya, Maitreya, and the sandalwood Tārā. From the Chinese emperor Seng-ge btsan-po, second of the Tang dynasty, he took as queen Kong-jo, who brought the miraculous Jowo statue. <br>When he desired to build the Trulnang temple but found it could not be constructed, he perceived that the earth of Tibet was a demoness lying supine and needed to be subdued. Thus he built temples: on the right shoulder at Ka-tshal, on the left at Khra-'brug; on the right hip at Gtsang-'bram, on the left at Gram-pa rgyang—these four temples. On the right elbow at Kong-po bu-chu, on the left at Lho-brag kho-mthing; on the right wrist at Ka-brag, on the left at Pra-bdun rtse—these four border-taming temples. On the right palm to suppress the wind at Byang-'tshal, on the left at 'Dan-klong thang-sgron-ma in Khams. On the right sole at Mang-yul byams-sprin, on the left at Mon-yul bum-thang, and at Spa-gro skyer-chu—many temples in all. <br>At the original 'O-thang lake, he built a stone fortress, covered it with wood, made foundations with nāga-clay, filled it with earth, and constructed the miraculous Trulnang temple of Lhasa. In the upper chamber to the north, it is said that the naturally arisen embodiment of the Great Compassionate One with eleven faces took residence. <br>Then the king went to China's Wu-tai shan and built one hundred and eight temples. The Chinese princess Kong-jo built the Ra-mo-che temple. At that time, the Indian ācārya Kumāra, the brahmin Śaṃkara, the Nepalese teacher Śīlā-mañju, the Chinese master Hva-shang Mahāyāna, the translator Thon-mi Sambhoṭa, his disciple Dharma-kośa, and Lha-lung rdo-rje dpal translated and established various teachings. <br>This king was renowned as a manifestation of the Great Compassionate One, and there exist accounts of the two Chinese princesses as well. This king ruled for sixty-nine years and passed away at the age of eighty-two. <br>Simultaneously, Kong-jo spoke from her deathbed, saying that the Śākyamuni statue should be moved from Ra-mo-che to Trulnang, and that Mañjuśrī should be painted with lac on the door of the upper chamber. She, together with Khri-btsun, all three dissolved into the Great Compassionate One, or passed away. The ministers also exchanged the two statues according to her testament. <br>The sons and successors followed: Mang-srong mang-btsan, his son Gung-srong gung-btsan, his son 'Dus-srong mang-po-rje, his son the miraculous king Rlung-nam 'khrul, and his son Khri-lde gtsug-brtsan, who built eight temples including Lhasa mkhar-brag. The brahmin Kamalakoṇa and Myag Jñānakumāra translated the Śatasāhasrikā Prajñāpāramitā and the Suvarṇabhāsottama, and various sciences of calculation and medicine flourished. <br>His son 'Jang-tsha lha-dbon went to take the Chinese princess Gyim-shang kong-jo as bride, but the king's son died en route. From his father's exceptional merit came the manifestation of Mañjuśrī as a youth, Khri-srong lde-btsan, born in the Earth-Horse year.<br>When he was young, four men including Sang-shi were sent to China to seek the Dharma. They returned with teachings and a Chinese monk, but subsequently the king died and the prince had not yet come of age. The Bon ministers made laws forbidding the practice of Dharma even by children, so Sang-shi's teachings were temporarily hidden in the rocks. <br>Later, when the prince had grown somewhat and assumed royal power, he was pleased when Sang-shi requested to teach the Dharma to the prince. In accordance with this, Rba Gsal-snang, who was at the border of Mang-yul, also returned and requested the king to practice Dharma. Following the advice of his maternal uncle Mchad, he was imprisoned for three years, during which time Gsal-snang sent invitation to Ācārya Bodhisattva. <br>When the master arrived in Mang-yul, three ministers were sent to receive him, and he gradually came to Tibet. He met the king at Pho-brang brag-dmar palace. At Pho-brang rlung-'tshub palace, for four months the abbot taught the Dharma, but the dark forces of Tibet—the magical displays of gods and demons, and the ministers who favored Bon—prevented the teaching of Dharma, so the abbot was temporarily sent back to Nepal. <br>Then, after some time had passed, Gsal-snang departed again for China to seek the Dharma and pretended to invite the abbot Sang-shi. Once more Gsal-snang returned from China and again pretended to invite the abbot, whereupon the abbot came to Tibet. When he performed the earth-taming ritual at Samye, the auspicious circumstances were exceedingly favorable. <br>However, since the malevolent gods and demons of Tibet were fierce and could not be properly subdued as they were, it was prophesied that the abbot Padmasambhava of Oḍḍiyāna should be invited. The king sent seven messengers to invite him, and the master, having knowledge thereof, came to Mang-yul. Upon meeting him, he gradually bound the gods and demons under oath and proceeded to Samye. <br>In the direction where the master resided, the abbot broke ground, taking as model the temple of Otantapuri, and in the Fire-Female-Sheep year, construction began with first building the Ārya Pāla. Though it is said to have been completed in the Earth-Female-Sheep year, how could such a gross error occur to an excellent scholar like Buton? This is clearly an error in the scribe's calculation of years and elements. <br>At Samye, both Padmasambhava and Bodhisattva performed the consecration ritual. In the following year, the seven Sad-mi were ordained as monks. Thereafter, through the great master's clairvoyant powers and magical displays, the ministers became jealous and earnestly petitioned the king, whereupon he was sent back to India. <br>Other Indian masters were invited: Vimalamitra, Buddha-guhya, Śāntam-garbha, Viśuddha-siṃha, the yoga master Dharma-kīrti, and others. The seven Sad-mi and other translators translated the Dharma extensively. During the Dragon year, whilst residing at Pho-brang gdan-dkar palace, the teachings to be translated into Tibetan were definitively established through catalogues. <br>Not long thereafter, the abbot Bodhisattva also passed into peace. Dpal-dbyangs was appointed as master, and Sba Ye-shes dbang-po departed to meditate in Lho-brag. Afterwards, when doctrinal disputes arose with the Chinese Hva-shang, the abbot's disciple Kamalaśīla defeated the Hva-shang and sent him back to China. Ye-shes dbang-po departed for the borderlands of Khams, abandoning food. The sovereign also passed away at the age of sixty-nine, having been born in the Earth-Horse year and died in the Fire-Tiger year. <br>Thereafter his son Mu-ne btsan-po assumed royal power in the Water-Tiger year. He established four great offerings at Samye and equalized the wealth of rich and poor Tibetan subjects three times. After one year and seven months of rule, he was poisoned by his mother and died. Then his younger brother Khri-lde btsan-po, having been entrusted with royal power for four years, was renowned as Sad-na legs-grags. <br>He built the Skar-chung rgyal-sde temple and greatly promoted the custom of Dharma. He had five sons: Khri-ral, Gtsang-ma, Khri dar-ma, Lha-rje lhun-grub, and Khri-chen. Of these, Ral-pa-can, a manifestation of a great bodhisattva, assumed royal power at the age of eighteen. He built the 'O-'jang-do palace, led armies against China and conquered it, then made a treaty with China and erected a stone pillar in Lhasa. <br>Then at the age of thirty-six, in the Iron-Female-Bird year, he was murdered by ministers who placed Lang dar-ma on the throne. When that one came to power, he greatly harmed the Buddha's teaching. Then, after some time had passed, Lha-lung dpal-gyi rdo-rje, seeing that the evil king was present at the Lhasa stone pillar reading inscriptions, slew him there. <br>This king's younger queen bore one son who was protected by lamplight at night, hence known as 'Od-bsrung. The senior queen bore a son who had teeth at birth, and the mother's name was Brtan-grags. Gnam-lde 'od-bsrung passed away at the age of sixty-three, and his maternal grandsons were Khri bkra-shis brtsegs and Khri nyi-ma mgon. <br>Nyi-ma mgon departed for Mnga'-ris, where he had three sons: the eldest, Rig-pa mgon, became lord of Mar-yul; the middle one, Bkra-shis mgon, became lord of Spu-rong; and the youngest, Lde-gtsug mgon, became lord of Zhang-zhung. <br>The youngest had two sons: Drang-srong and 'Khor-lo lde. The latter, whose birth name was Srong kho-re, became a monk with the ordination name Ye-shes 'od. He sent twenty-one intelligent youths to India, of whom eighteen died from disease, whilst two returned to Tibet: the elder Rin-chen bzang-po and the younger Legs-pa'i shes-rab, who proved exceedingly beneficial to the teaching. <br>Moreover, many paṇḍitas were invited and various sūtras and tantras were translated. Particularly, yoga and Guhyasamāja were excellently developed. It appears that this was the period when the paṇḍita Smṛti came via Nepal from Tibet to Mdo-khams. <br>Kho-re's younger brother's son was Lha-lde, who had three sons: 'Od-lde, Pho-brang zhi-ba 'od, and the monk Byang-chub 'od. Through Byang-chub 'od's efforts, Jo-bo-rje was invited to Tibet, which was an act of exceedingly great kindness. <br>The Later Diffusion of the teaching arose from Mdo-khams. Previously, when the teaching was destroyed during Lang dar-ma's time, the three—Gtsang, Gyo, and Rma—carried whatever books they could and fled to Khams, where they dwelled. Among them, a householder named Dmu-zi rab-gsal became ordained, receiving the name Dge-ba rab-gsal. Due to his great wisdom, he later became renowned as the great master Dgongs-pa rab-gsal. <br>In the year following his ordination, he received full ordination, with the former abbot and disciples and the Chinese Hva-shang completing the quorum. Five years after his full ordination, ten men from Dbus and Gtsang came to Mdo-khams and requested the great master to grant them full ordination. When they implored him as the great master, he established the monastic discipline for them.<br>When they returned to Tibet, they established separate monasteries: in Dbus, five men including Klu-mes established different foundations, and in Gtsang, five men including La-stod established different foundations, thus greatly flourishing the teaching of the Victorious Śākya. <br>However, there exist conflicting historical accounts regarding the lineage of abbots from the great master and the ordination of the ten men from Dbus and Gtsang. The accounts say: Some claim the succession was: Abbot Bodhisattva's disciple Rba Ratna, he ordained Lha-lung rnal-'byor dbyangs, he ordained the great master Dgongs-gsal, he ordained Sa-gong ye-shes g.yung-drung, he ordained Grum ye-shes rgyal-mtshan, who ordained Klu-mes and others.<br>Certain testament documents state: The disciples of Abbot Bodhisattva, Dana-śīla and Jina-mitra, ordained Rba Ratna, he ordained G.yog dge-'byung, he ordained the great master Dgongs-pa gsal, he ordained Sgrol mañju-śrī, he ordained Grum ye-shes rgyal-mtshan, who ordained Klu-mes. <br>According to Rig-ral, whether the great master or the abbot's disciple Grum received ordination from the ten men of Dbus and Gtsang requires investigation. Again, regarding Gyo and others, some wish to follow the abbatial lineage of Jina-mitra, whilst others explain it as the lineage of Śī-ba-'tsho, which requires examination.<br>Thus it was that after seventy years without the teaching in Dbus and Gtsang, the ten men from Dbus and Gtsang reestablished the teaching. When the ten men came to Dbus, an old woman said, “When I was six years old, I saw monks.” When asked how old she had become, she said she was about seventy-six years old. Some say one hundred and eight years had passed. This accords with great Buton's reasoning that the Later Diffusion of the teaching began in the Water-Bird year. <br>Thus speaks the Treasury of Religious History composed by Buton the Kashmiri, as compiled by the Vidyādhara. <br>Sarva Maṅgalam (May all be auspicious) </p>", 

    "status": "published",
    "meta": { "words": "N/A", "pages": "N/A", "readTime": "N/A", "preview": "N/A" },
    "availableLanguages": ["bo", "zh", "en"],
    "createdAt": "2025-05-31T14:08:00Z",
    "updatedAt": "2025-05-31T22:18:00Z"
  },
  {
    "id": "aspiration_002",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": ["迴向"],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": { "words": "N/A", "pages": "N/A", "readTime": "N/A", "preview": "N/A" },
     "availableLanguages": ["bo", "zh", "en"],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "aspiration_002",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": ["迴向"],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": { "words": "N/A", "pages": "N/A", "readTime": "N/A", "preview": "N/A" },
     "availableLanguages": ["bo", "zh", "en"],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "aspiration_002",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": ["迴向"],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": { "words": "N/A", "pages": "N/A", "readTime": "N/A", "preview": "N/A" },
     "availableLanguages": ["bo", "zh", "en"],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "aspiration_002",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": ["迴向"],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": { "words": "N/A", "pages": "N/A", "readTime": "N/A", "preview": "N/A" },
     "availableLanguages": ["bo", "zh", "en"],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
   {
    "id": "aspiration_002",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": ["迴向"],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": { "words": "N/A", "pages": "N/A", "readTime": "N/A", "preview": "N/A" },
     "availableLanguages": ["bo", "zh", "en"],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "aspiration_002",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": ["迴向"],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": { "words": "N/A", "pages": "N/A", "readTime": "N/A", "preview": "N/A" },
     "availableLanguages": ["bo", "zh", "en"],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "aspiration_002",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": ["迴向"],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": { "words": "N/A", "pages": "N/A", "readTime": "N/A", "preview": "N/A" },
     "availableLanguages": ["bo", "zh", "en"],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "aspiration_002",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": ["迴向"],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": { "words": "N/A", "pages": "N/A", "readTime": "N/A", "preview": "N/A" },
     "availableLanguages": ["bo", "zh", "en"],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  }
]